{
  "responsibilities": [
    "Develop deep data expertise and own data quality while conforming a variety of 3rd party data sources into clean and validated solutions.",
    "Build and support complex data pipelines for financial institution rewards products, including loading, validation, and classifications of core and card data.",
    "Support credit union partners, other partners, and internal teams through simple and automated financial reconciliation processes across all data sources and integration touch points.",
    "Apply a business-minded approach to data engineering tasks with an understanding of the impact on business operations and objectives.",
    "Design and develop data pipelines and processes that optimize performance, scalability, and reliability from both internal and external data sources.",
    "Proactively monitor data infrastructure and systems, identifying and addressing potential issues to ensure uninterrupted data flow.",
    "Continuously evaluate and improve data engineering practices, staying updated on emerging technologies and best practices in the field."
  ],
  "skills": [
    "Strong SQL skills and database expertise.",
    "Experience working with distributed systems in a cloud computing environment.",
    "Proficient in identifying and implementing scalable engineering processes.",
    "Excellent communication skills, adept at conveying complex ideas clearly and seeking assistance when needed.",
    "Demonstrates a hustle mentality, driven to achieve goals efficiently and effectively.",
    "Ability to thrive in a dynamic, fast-paced, collaborative, and high-growth environment."
  ],
  "qualifications": [
    "3+ years of development experience, ideally in a microservice architecture using languages such as Python on the backend.",
    "Snowflake experience is a plus.",
    "Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time."
  ]
}