{
  "responsibilities": [
    "Carry out cutting-edge research to advance the science and technology of machine learning systems.",
    "Perform research that enables learning the semantics of data (images, video, text, audio, and other modalities).",
    "Devise better data-driven models of AI system design and optimization.",
    "Contribute research that leads to innovations in scalable machine learning systems, resource-efficient AI data and algorithm scaling, and neural network architectures.",
    "Develop memory and energy-efficient AI systems and environmentally-sustainable AI system and hardware designs.",
    "Collaborate with researchers and cross-functional partners, including communicating research plans, progress, and results.",
    "Publish research results and contribute to research that impacts Meta product development."
  ],
  "skills": [
    "Experience with Python, C++, C, Rust, or other related languages.",
    "Proficiency with the PyTorch framework.",
    "Experience developing and optimizing systems for at-scale machine learning execution.",
    "Ability to devise data-driven models and conduct real-system experiments and design implementation for AI system optimization.",
    "Experience with scalable machine learning systems, resource-efficient AI data and algorithm scaling, or neural network architectures.",
    "Problem-solving skills, including comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward.",
    "Ability to work and communicate cross-functionally in a team environment."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.",
    "Master's degree in the field of Computer Science, Computer Engineering, or equivalent practical experience.",
    "4+ years of domain-specific industry experience in areas related to development in systems, computer architectures, compiler and programming languages, machine learning, and artificial intelligence.",
    "Preferred: PhD in the field of Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.",
    "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, or publications at leading workshops, journals, or conferences.",
    "Demonstrated research and software engineering experience via work experience, coding competitions, or widely used contributions in open source repositories."
  ]
}