{
  "responsibilities": [
    "Determine the nature and scope of assigned projects, as well as budget and schedule parameters, and delegate assignments appropriately.",
    "Determine the technical design criteria for the project.",
    "Ensure that appropriate background information such as past designs, materials specifications, and governing code requirements has been researched and incorporated into the design effort.",
    "Perform necessary design calculations for the project and ensure that calculations performed by others are accurate.",
    "Prepare rough sketches and notes for the design effort and forward to a junior engineer or technician for refinement.",
    "Determine material quantities and specifications for the project.",
    "Ensure that effective coordination with other disciplines involved in the project takes place.",
    "Schedule and attend progress briefings and coordination checks to discuss the engineering effort and project status.",
    "Check and review all project drawings for adequacy and accuracy.",
    "Document all design criteria, calculations performed, and decisions made.",
    "Prepare studies and reports when appropriate.",
    "Direct and oversee the efforts of technicians, designers, and drafters assigned to the project.",
    "Devise new approaches and solutions to problems identified and modify and extend theories and practices within the field.",
    "Organize and lead engineering projects."
  ],
  "skills": [
    "Ability to collaborate across teams and communicate complex technical concepts clearly.",
    "Ability to adapt to uncertainty and overcome obstacles.",
    "Technical expertise in engineering.",
    "Passion for technology and continuous improvement of processes.",
    "Ability to inspire innovation and creative thinking.",
    "Proficiency in programming languages such as C, C++, Python, or similar languages for embedded and real-time applications."
  ],
  "qualifications": [
    "BS or MS in Computer Science, Electrical Engineering, Data Science, or a related field.",
    "Four years of relevant engineering experience with a good working knowledge of advanced engineering principles, techniques, and applications OR three years of relevant engineering experience with a pertinent master’s degree.",
    "Legal authorization to work in the United States – Sponsorship will not be provided for this position.",
    "Proven track record of leading and growing technical teams, mentoring engineers, and driving cross-functional collaboration.",
    "Strong experience in designing, developing, and launching diagnostic systems for embedded applications, particularly for sensor-based or industrial automation products."
  ]
}