{
  "responsibilities": [
    "Perform research and develop solutions to computer software and computer hardware problems.",
    "Research, design, and develop new optimization algorithms and techniques to improve the efficiency and performance of Meta’s platforms.",
    "Design and implement large-scale distributed software systems to serve large numbers of complex requests simultaneously and without failure.",
    "Utilize technical research background, train new ranking models, and run experiments.",
    "Create tools for migrating large bodies of user data across systems for new products, scalability efforts, and development of new core infrastructure.",
    "Use machine learning, statistics, or other data techniques to build algorithms.",
    "Suggest, collect, and synthesize system requirements from stakeholders and create effective feature roadmaps.",
    "Analyze and resolve computer challenges from a system engineering standpoint.",
    "Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors.",
    "Demonstrate good judgment in selecting methods and techniques for obtaining solutions."
  ],
  "skills": [
    "Technical research background",
    "Training new ranking models",
    "Running experiments",
    "Creating tools for data migration",
    "Building algorithms using machine learning, statistics, or other data techniques",
    "Synthesizing system requirements and creating feature roadmaps",
    "Analyzing and resolving computer challenges",
    "Evaluating data and identifiable factors",
    "Demonstrating good judgment in selecting methods and techniques"
  ],
  "qualifications": [
    "Doctorate degree in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field (Foreign degree equivalent is acceptable)",
    "Completion of a graduate-level course, research project, or internship involving:",
    "1. Algorithms, data structures, or systems software",
    "2. Solving analytical problems using quantitative approaches",
    "3. Gathering, manipulating, or analyzing complex, high-volume, high-dimensionality data from varying sources",
    "4. Communicating complex research in a clear, precise, and actionable manner",
    "5. Research in topics closely related to machine learning, NLP, recommendation systems, pattern recognition, signal processing, data mining, artificial intelligence, information retrieval, or computer vision",
    "6. Performing research that enables learning the semantics of data (images, video, text, audio, or other modalities) and advances the technology of intelligent machines",
    "7. Devising better data-driven models of human behavior",
    "8. Adapting standard machine learning methods to best enterprise modern parallel environments: distributed clusters, multicore SMP, or GPU",
    "9. Developing highly scalable classifiers and tools leveraging machine learning, statistics, regression, rules-based models, or mathematical models",
    "10. Proficiency in Java, C++, Perl, PHP, or Python"
  ]
}