{
  "responsibilities": [
    "Develop and implement new applications for University Advancement, including research, analysis, decision-making, implementation, and support.",
    "Lead new application development projects and provide technical consultation and development for existing and new custom applications.",
    "Prepare technical specifications, design documentation, code walk-throughs, and test plans.",
    "Develop application program interfaces (APIs) to facilitate data transfer between University Advancement systems and other systems.",
    "Design, maintain, and support enterprise application systems, web applications, custom reports, etc., using various development tools, languages, and platforms.",
    "Collaborate effectively with ITS, Treasury/Finance, Admissions, and other divisions on development projects and large-scale University initiatives.",
    "Work with both internal and external consultants on a wide range of long-term and short-term projects.",
    "Responsible for technical project management and programming of complex tasks on projects.",
    "Review and modify Advancement Technology applications as needed in collaboration with AIS, ITS, and other Advancement divisions.",
    "Work with end-users, administrators, systems analysts, and developers to resolve issues with existing applications.",
    "Provide supervision and/or assistance to other developers/analysts/administrators.",
    "Provide lead support and mentorship to other team members.",
    "Perform technical design and code review for other developers/team members."
  ],
  "skills": [
    "Strong design, programming, documentation, and mentoring skills.",
    "High level of attention to detail.",
    "Experience with database/data-warehouse management (Oracle, SQL Server, Snowflake, Mongo, etc.).",
    "Proficiency in customer relationship management (CRM) software (Salesforce, Microsoft Dynamics, Hubspot, etc.).",
    "Knowledge of object-oriented programming (Java, C#, VB.Net, etc.).",
    "Experience with scripting languages (Perl, korn shell, c-shell, python, JavaScript).",
    "Familiarity with web applications and technologies (HTTP/HTTPS, HTML, XML/XSL, CSS, Ajax, ASP, JSP, Web Services, API creation and consumption).",
    "Proficiency in reporting and analysis tools (Tableau, Power BI, Crystal Reports, etc.).",
    "Experience with extract-transform-load (ETL) tools (Informatica, MuleSoft, Cast Iron, etc.).",
    "Experience working with Salesforce.com and its proprietary tools and languages (Apex code, Visual Force, Lightning Web Components, Aura, Validation Rules, Workflows, Data Loader, Apex Explorer).",
    "Strong interpersonal skills and excellent written and oral communication skills.",
    "Ability to lead a project with some previous project management responsibilities.",
    "Ability to manage multiple projects and activities concurrently."
  ],
  "qualifications": [
    "A minimum of a Bachelor’s degree in Computer Science or equivalent related work experience.",
    "A minimum of 5 to 8 years of experience in at least three of the specified technologies.",
    "Experience working directly with customers to accurately translate and articulate functional requirements.",
    "Experience working with larger teams in a matrix-managed environment.",
    "Salesforce certifications (Administrator, Developer, AI, etc.) preferred, but not required.",
    "Experience working with ETL tools is preferred, but not required."
  ]
}