{
  "responsibilities": [
    "Design, develop, and deploy production-ready solutions for customers.",
    "Enable seamless integrations with mParticle's technology and data ecosystem.",
    "Collaborate with cross-functional teams, including Customer Success, Professional Services, and Production Engineering.",
    "Build scalable integrations tailored to customer requirements and specifications.",
    "Enhance the efficiency of Professional Services Engineering by improving documentation, tools, and reusable code templates.",
    "Partner closely with Customer Success and Professional Services teams to ensure timely delivery of high-value solutions.",
    "Translate customer needs into detailed technical requirements and accurately estimate development efforts.",
    "Rigorously test and validate integrations to guarantee reliable and performant deployments."
  ],
  "skills": [
    "Problem-solving mindset and strong attention to detail.",
    "Excellent written and verbal communication skills.",
    "Ability to collaborate effectively with technical and non-technical stakeholders.",
    "Thrive in fast-paced, ambiguous environments as a self-starter with a proactive attitude.",
    "Team player who actively supports others and contributes to a positive team dynamic.",
    "Proficiency in Python (bonus skill).",
    "Familiarity with digital marketing tools such as analytics, attribution, ad serving, DMPs, push notifications, and social media platforms (bonus skill)."
  ],
  "qualifications": [
    "Possess a 4-year undergraduate degree in Computer Science, Electrical Engineering, or equivalent professional experience.",
    "2-5 years of experience writing and deploying production-level code.",
    "Strong grasp of software engineering best practices.",
    "Proficiency in building and consuming RESTful APIs.",
    "Experience building microservice architectures that operate at a large scale with low latency.",
    "Experience managing CI/CD pipelines and working with AWS or similar cloud technologies.",
    "AWS-Certified Developer - Associate (bonus qualification)."
  ]
}