{
  "responsibilities": [
    "Design, develop, and productionize machine learning (ML) solutions in the fields of Document understanding, Search and QnA, GenAI, Virtual Agents, etc.",
    "Develop and maintain backend services using Python, focusing on AI-driven applications.",
    "Design and implement APIs for seamless integration with AI models and services.",
    "Work across the complete lifecycle of ML model development, including problem definition, data exploration, feature engineering, model training, validation, and deployment.",
    "Participate in code reviews, testing, and quality assurance processes.",
    "Troubleshoot and resolve technical issues related to AI model, integration, deployment, and backend services.",
    "Implement system telemetry, A/B testing, and other statistical methods to validate the effectiveness of AI models.",
    "Ensure the integrity and robustness of ML solutions by developing automated testing and validation processes.",
    "Document and communicate development processes, system designs, and architectural decisions.",
    "Ensure the security and compliance of healthcare data, adhering to HIPAA regulations.",
    "Responsible for adherence to the Capital Rx Code of Conduct including reporting of noncompliance."
  ],
  "skills": [
    "Strong grasp of OOP, Design Patterns, efficient algorithms, and quality software development.",
    "Strong proficiency in Python and familiarity with ML libraries such as PyTorch.",
    "Familiarity with cloud platforms such as AWS or Azure.",
    "Familiarity with GenAI services such as OpenAI GPT, Anthropic Claude, Google Gemma, etc.",
    "Experience developing and fine-tuning prompts on any of the GenAI services.",
    "Excellent problem-solving skills, attention to detail, and a strong capacity for logical thinking.",
    "Passion for customer, innovation, product quality, service excellence, and test engineering.",
    "The ability to work collaboratively across multiple disciplines in an extremely fast-paced, startup environment.",
    "Experience working with microservices/an API-based application paradigm.",
    "Good written communication skills that enable collaboration in a remote environment."
  ],
  "qualifications": [
    "Bachelor’s or Master’s degree in Computer Science, Machine Learning, or a related quantitative field.",
    "Minimum 4 years of experience in industry with a strong focus on ML solutions development and production deployment."
  ]
}