{
  "responsibilities": [
    "Analyze complex issues using multiple data sources to develop insights and identify security problems and threats.",
    "Create new solutions to mitigate security issues and make tradeoffs to balance security and operational needs.",
    "Identify and recommend process improvements and adopt best practices.",
    "Drive resolution to systemic security issues through cross-team collaboration.",
    "Anticipate previously unknown potential artifacts in data as indicators of attacker activity.",
    "Collaborate with the MS Red Team and Applied Research Scientists to leverage AI-driven techniques, including LLMs and agentic systems.",
    "Prototype, validate, and refine exploitation methods using LLMs and agentic systems.",
    "Design and execute realistic attack simulations to test and improve methodologies.",
    "Champion innovative principles and forward-looking concepts guided by research trends.",
    "Cultivate global collaborations with security researchers to exchange knowledge and build partnerships.",
    "Share knowledge with the community through presentations, publications, and active participation in social media."
  ],
  "skills": [
    "Proficiency in software development lifecycle, large-scale computing, modeling, cybersecurity, and anomaly detection.",
    "Hands-on engineering expertise in developing custom tooling for adversary simulations and executing red team campaigns.",
    "Proficiency as a reverse engineer and vulnerability researcher.",
    "Experience in exploit development, analyzing artifacts, researching scoped targets, debugging binaries, and identifying exploitable flaws.",
    "Ability to leverage AI-driven techniques, including LLMs and agentic systems.",
    "Strong analytical skills to develop insights from complex data sources.",
    "Ability to collaborate and drive cross-team initiatives.",
    "Strong communication skills for sharing knowledge and contributing to the information security ecosystem."
  ],
  "qualifications": [
    "5+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection OR Master's Degree in Statistics, Mathematics, Computer Science or related field.",
    "3+ years experience as a red team operator with hands-on engineering expertise in developing custom tooling for adversary simulations and executing red team campaigns.",
    "2+ years experience proficiency as a reverse engineer and vulnerability researcher.",
    "Ability to meet Microsoft, customer, and/or government security screening requirements.",
    "Additional or Preferred: 6+ years experience in software development lifecycle, large-scale computing, modeling, cybersecurity, and/or anomaly detection OR Doctorate in Statistics, Mathematics, Computer Science or related field."
  ]
}