{
  "responsibilities": [
    "Lead development of LLM for Agentic AI within the Generative AI team.",
    "Contribute to the development of AI applications and solve real-world problems for enterprise customers using Generative AI models and research.",
    "Act as a lead AI developer and trusted technical expert on Generative AI frameworks and LLM products.",
    "Work closely with partners and customers to build scalable industry-specific enterprise AI solutions from project scoping to POC to production.",
    "Build agentic LLM applications and explore advancements in model training, fine-tuning, and customization.",
    "Enable NVIDIA strategic service delivery partners to build enterprise AI solutions using the accelerated computing stack.",
    "Collaborate with developers and onboard them to NVIDIA AI platforms and services by providing deep technical guidance.",
    "Anticipate customer and partner needs and find enablement opportunities to expand adoption and utilization of NVIDIA Generative AI products and platforms.",
    "Establish and build repeatable reference architecture, communicate standard processes, and understand solution trade-offs.",
    "Share findings and feedback to improve products and services."
  ],
  "skills": [
    "Proficiency in Python and C++ programming.",
    "Strong foundation in deep learning, particularly generative models.",
    "Excellent communication and presentation skills.",
    "Expertise in NVIDIA AI platforms, including natural language processing and Large Language Models (NVIDIA NeMo).",
    "Practical knowledge of Generative AI and LLM development.",
    "Ability to train GPT and Megatron Models.",
    "Understanding of MLOps life cycle management and experience with LLMOps workflows.",
    "Experience with CUDA programming and benchmarking and analyzing performance of AI Agentic systems."
  ],
  "qualifications": [
    "MSc, PhD in Computer Science, Electrical Engineering, Software Engineering, ML Engineering, or related fields (or equivalent experience).",
    "5+ years of relevant work experience in developing and deploying AI models at scale as a Software Engineer or deep learning engineer.",
    "Proven track record of building enterprise-grade RAG based systems using open-source models and orchestration frameworks."
  ]
}