{
  "responsibilities": [
    "Conduct field research to measure and characterize methane emissions from natural gas infrastructure.",
    "Perform post-processing and statistical analyses of collected data.",
    "Communicate results via presentations and/or reports.",
    "Assist NETL staff in obtaining cooperation from natural gas operators and/or landowners for site access agreements.",
    "Collaborate with national laboratories and environmental agency stakeholders to provide emissions estimates for greenhouse gas inventories.",
    "Design field campaigns to determine emission rates from natural gas infrastructure.",
    "Collect, record, and post-process methane concentration/emission rate and meteorological data.",
    "Analyze collected data to find indicators, patterns, and correlations with methane emissions.",
    "Maintain and update databases with collected emissions data.",
    "Coordinate with team members to develop tools like probability maps for predicting well locations.",
    "Analyze geospatial data using spatial statistics to define relationships of methane leaks/rates.",
    "Prepare statistical maps and charts using GIS and Python.",
    "Pilot, assemble, and maintain drones with IR Imaging Systems and methane sensor payloads.",
    "Prepare regular updates and progress reports for managers and clients.",
    "Disseminate results via journal articles and national conference presentations.",
    "Develop new intellectual property based on innovative research.",
    "Provide leadership and expertise on field projects, including delegation and communication of project status."
  ],
  "skills": [
    "Experience in planning and executing onsite field sampling campaigns.",
    "Proficiency in statistical data analysis using Matlab, Python, R, or similar software.",
    "Excellent verbal and written communication skills.",
    "Proficiency in ArcGIS and other ESRI products or similar software.",
    "Familiarity with well infrastructure, materials, and design.",
    "Experience assembling and operating drones and drone sensor payloads.",
    "Familiarity with dispersion modeling and atmospheric boundary layer characteristics.",
    "Experience with meteorological instruments and ambient air monitoring analytical instruments."
  ],
  "qualifications": [
    "Master’s degree in Atmospheric Sciences, Environmental Engineering, Geology, or related field.",
    "Foundational understanding of emissions measurements.",
    "2+ years of relevant technical experience.",
    "First authorship of posters/presentations at national conferences and/or peer-reviewed journal articles.",
    "Ability to meet requirements for gaining access to work on the NETL campus."
  ]
}