{
  "responsibilities": [
    "Contribute to building and scaling a recommendation system for personalization across Max, Discovery+, and other WBD offerings.",
    "Build machine learning systems and operations for personalization.",
    "Collaborate with applied data science engineers to improve the quality, stability, and resilience of search and personalization platforms.",
    "Drive observability, scalability, cost-optimization, and performance tuning for recommendation services and models.",
    "Collaborate with platform, content, user data, and product partners as Max expands to new markets globally.",
    "Author, test, review, and optimize production-level code in Java, Go, and Python.",
    "Motivate, inspire, and create a culture of experimentation and data-driven innovation.",
    "Contribute technical documentation to support knowledge transfer and sharing.",
    "Troubleshoot issues in recommendation systems as front-line support."
  ],
  "skills": [
    "Expertise in building and scaling recommendation systems.",
    "Proficiency in machine learning systems and operations.",
    "Strong collaboration skills with data science engineers and other partners.",
    "Ability to drive observability, scalability, cost-optimization, and performance tuning.",
    "Proficiency in Java, Go, and Python programming languages.",
    "Strong understanding of version control and code integration best practices.",
    "Ability to motivate and inspire a culture of experimentation and innovation.",
    "Strong technical documentation skills.",
    "Problem-solving skills for troubleshooting recommendation system issues."
  ],
  "qualifications": [
    "Passionate about supporting, building, and scaling personalization and search platforms.",
    "Experience working in a fast-moving environment that fosters engineering and operational excellence.",
    "Obsession with customer satisfaction and rapid feature iteration.",
    "Experience working with a team of machine engineers and applied researchers.",
    "Ability to contribute to a system serving 100+ million users worldwide."
  ]
}