{
  "responsibilities": [
    "Design code and systems that influence Visa’s internal standards for scalability, security, and reusability.",
    "Collaborate multi-functionally to create design artifacts and develop best-in-class software solutions for multiple Visa technical offerings.",
    "Actively contribute to product quality improvements, valuable service technology, and new business flows in diverse agile squads.",
    "Develop robust and scalable products intended for a myriad of customers including end-user merchants, B2B, and business to government solutions.",
    "Leverage innovative technologies to build the next generation of Payment Services, Transaction Platforms, Real-Time Payments, and Buy Now Pay Later Technology.",
    "Support the piloting of new technology capabilities and features that enhance the user website experience across e-commerce products.",
    "Identify and advance bugs that threaten website functionality.",
    "Support relationships with product owners and delivery managers to gather and refine requirements for product tasks.",
    "Develop and design architect solutions, considering integrations with other solutions.",
    "Provide relevant knowledge on the development of user documentation of solutions and follow standard processes in user documentation."
  ],
  "skills": [
    "Growth mindset that is curious and passionate about technologies.",
    "Comfort in pushing the boundaries and ‘hacking’ beyond traditional solutions.",
    "Expertise in one or more general development languages (e.g., Java, C#, C++).",
    "Experience building and deploying modern services and web applications with quality and scalability.",
    "Constant drive to learn new technologies such as Angular, React, Kubernetes, Docker, etc.",
    "Experience collaborating with Product, Test, Dev-ops, and Agile/Scrum teams.",
    "Strong communication skills and ability to effectively collaborate within cross-functional teams.",
    "Excellent problem-solving skills, analytical thinking, and ability to analyze complex systems and large data sets.",
    "Familiarity with microservices architecture and developing APIs for integration with other systems.",
    "Experience in automating workflows and processes within IT operations to improve efficiency and reduce manual intervention."
  ],
  "qualifications": [
    "Bachelor’s degree, OR 3+ years of relevant work experience.",
    "Bachelor’s degree in computer science, Information Technology, or a related field, OR 3+ years of relevant work experience in software development, particularly in IT operations or infrastructure domains.",
    "2 or more years of experience in software development with a focus on AIOps solutions.",
    "Knowledge of and ability to develop front-end code (e.g. HTML, CSS, and JavaScript).",
    "Experience with machine learning frameworks and libraries (e.g., TensorFlow, PyTorch, scikit-learn).",
    "Knowledge of and ability to develop back-end code (e.g. Python, Java, C++, Shell).",
    "Knowledge of DevOps and AIOps methodologies and practices.",
    "Good understanding of the Secure Software Development Life Cycle (SSDLC) and Agile methodologies.",
    "Knowledge of systems integration processes, especially in integrating AI solutions into existing IT operations workflows.",
    "Experience with incident prediction and prevention using AI/ML models."
  ]
}