{
  "responsibilities": [
    "Lead the AI & Data technology roadmap and support integration into product line strategies for JADC2 solutions.",
    "Collaborate with leaders across Mission Systems and beyond to integrate AI solutions into JADC2 systems and processes, and to large scale demonstrations.",
    "Lead the establishment of objectives for execution of mapping and modeling of key engineering business process flows to optimize efficiency and meet program / DOD needs.",
    "Partner with divisional senior executive leadership, key stakeholders, process owners, and subject matter experts to identify and communicate key customer strategic initiatives/ DOD vision on Data & AI.",
    "Work closely with Business Development on market trends and define the technology needs required to align the portfolio.",
    "Lead in the definition and execution of engineering policies and procedures that bring value to programs and insight to leadership.",
    "Mentor programs leaders, customer desires, wants and needs.",
    "Identify and structure improvement opportunities and projects.",
    "Advise on and help drive the business operations agenda.",
    "Lead cross discipline teams. Engage across disciplines to bring focus to strategic projects and add value and velocity to engineering.",
    "Build and maintain relationships with key stakeholders across departments and business units.",
    "Present your ideas to internal and external groups; lead proposal and white paper activities; and represent Collins Aerospace at technical conferences and working groups.",
    "Understand and promote key analytical projects that assist and influence the business. Ensure alignment with the customer program objectives.",
    "Be a resource for policy knowledge and provide strategic guidance on related issues to leadership.",
    "Active engagement with RTX Business Units and recognized as an expert externally by regulatory bodies, customers and/or universities.",
    "Provide leadership to facilitate high quality technical decisions, product competitiveness and robust solutions.",
    "Engagement across the enterprise to share expertise, driving quality and success across the larger business.",
    "Lead the development and execution of strategic plans to advance product technology and organizational capability.",
    "Forward looking leadership to identify potential external technology disruptors and evaluate strategic applications.",
    "Be active, visible, and engaged in external technical communities, government standards committees and shape the future of the business, particularly as it relates to emerging technology and trends in command and control in military operations.",
    "Actively engaged in the attraction of top technical talent. Build and maintain a strong talent pipeline.",
    "Take personal responsibility to develop, advocate and retain the next generation of technical leaders, as well as delivering enrichment opportunities.",
    "Ensure compliance with international trade policies and procedures.",
    "Ensure the protection of Collins Aerospace intellectual property; safeguard customer and supplier/partner intellectual property."
  ],
  "skills": [
    "Strong business acumen to effectively communicate and influence executive leadership.",
    "Profound technical proficiency in Data & AI.",
    "Exceptional communication and presentation skills.",
    "Ability to lead strategic roadmap development and work closely with cross-functional leaders.",
    "Expertise in integrating advanced technologies to enhance mission effectiveness.",
    "Ability to provide enterprise mentorship to engineering disciplines.",
    "Ability to influence larger business with Non-Advocate Reviews, Design Reviews, and Customer Technical alignment.",
    "Ability to engage in other RTX business units and be recognized for technical expertise internally and externally.",
    "Ability to lead cross discipline teams and engage across disciplines.",
    "Ability to build and maintain relationships with key stakeholders.",
    "Ability to present ideas to internal and external groups.",
    "Ability to understand and promote key analytical projects.",
    "Ability to provide strategic guidance on related issues to leadership.",
    "Ability to provide leadership to facilitate high quality technical decisions.",
    "Ability to engage across the enterprise to share expertise.",
    "Ability to lead the development and execution of strategic plans.",
    "Ability to identify potential external technology disruptors and evaluate strategic applications.",
    "Ability to be active, visible, and engaged in external technical communities.",
    "Ability to attract top technical talent and build a strong talent pipeline.",
    "Ability to ensure compliance with international trade policies and procedures.",
    "Ability to ensure the protection of intellectual property."
  ],
  "qualifications": [
    "Demonstrated experience designing and implementing machine learning models and algorithms to solve business challenges.",
    "Knowledge of cybersecurity principles and their application in command and control environments.",
    "Experience with creating and maintaining directorate or organizational strategic roadmaps, customer trend analysis and disrupter technology.",
    "Requires expert knowledge and mastery of multiple work areas typically obtained through advanced academic qualifications combined with experience.",
    "Experience with establishing or modifying customer requirements, processes and procedures to drive positive results within the business.",
    "Executive level communication skills are required.",
    "Possess Patents, Publications, and/or Technical Presentations to industry.",
    "Familiarity with Earned Value Management best practices and experience in execution.",
    "Bachelor’s degree (typically in Science, Technology, Engineering or Mathematics (STEM)) and a minimum of 14 years of prior relevant experience OR Advanced Degree in a related field and minimum 12 years experience OR In absence of a degree, 18 years of relevant experience is required.",
    "Active and transferable DoD Secret Clearance is required prior to start date.",
    "Must be a U.S. Citizen.",
    "Technical expert level understanding of the operational environment as it relates to relevant technologies (AI/ML, C2, and data analytics).",
    "Familiarity with simulation and modeling tools for command and control scenarios.",
    "Direct recent experience working JADC2.",
    "Familiarity with cloud platforms (e.g., AWS, Azure, Google Cloud).",
    "Experience with big data technologies and data visualization tools.",
    "Experience with cost accounting structure and financial systems.",
    "Exceptional engineering analytical and decision-making skills with strong ability to be creative and innovative in designing solutions.",
    "Experience leading and training technical teams of junior to mid-level systems engineers and analysts.",
    "Current Top Secret/SCI clearance is preferred."
  ]
}