{
  "responsibilities": [
    "Design and develop innovative full-stack solutions that integrate ML models into clinical workflows.",
    "Craft responsive, user-friendly interfaces for healthcare professionals.",
    "Build and maintain robust backend services and APIs for AI model deployment and scaling.",
    "Rapidly prototype and develop MVPs to validate clinical use cases.",
    "Collaborate with clinicians to address healthcare challenges and enhance clinical practices.",
    "Lead the design and maintenance of web applications for healthcare initiatives.",
    "Build secure, scalable data pipelines connecting frontend applications with ML systems.",
    "Create clear, comprehensive documentation and uphold high development standards.",
    "Support the deployment and continuous monitoring of production systems."
  ],
  "skills": [
    "Strong full-stack development experience with modern frameworks and technologies.",
    "Expertise in frontend development (React, Vue, or similar) with a focus on UI/UX.",
    "Proficiency in backend development (Python, Node.js, or similar).",
    "Experience with RESTful APIs and microservices architecture.",
    "Knowledge of modern web development practices and responsive design.",
    "Understanding of database design and management.",
    "Experience with version control systems and CI/CD pipelines.",
    "Familiarity with cloud platforms (AWS, Azure, or GCP).",
    "Understanding of web security best practices and HIPAA compliance.",
    "Strong eye for design and user experience.",
    "Ability to rapidly prototype and iterate based on user feedback.",
    "Excellent problem-solving abilities and attention to detail.",
    "Strong communication skills for working with clinical staff.",
    "Experience in agile development methodologies.",
    "Ability to work independently and as part of a cross-functional team."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, Software Engineering, or related technical field.",
    "Minimum 3 years of professional full-stack development experience.",
    "Demonstrated expertise in frontend technologies (JavaScript/TypeScript, HTML5, CSS3, React, Vue, or similar).",
    "Demonstrated expertise in backend technologies (Python, Node.js, or similar).",
    "Experience with SQL and NoSQL databases.",
    "Experience in API Development (REST, GraphQL).",
    "Experience with version control (Git).",
    "Experience building and deploying production-grade web applications.",
    "Portfolio demonstrating UI/UX capabilities and responsive design work.",
    "Experience with automated testing and CI/CD pipelines."
  ]
}