{
  "responsibilities": [
    "Engineer applications related to data management and presentation in an enterprise data operational environment focused on network performance and cyber threats.",
    "Design and implement data analytics solutions for enterprise IT situational awareness.",
    "Manage complex data flows across the enterprise.",
    "Work with cloud computing services and technologies, including AWS, Microsoft Azure, Nutanix, and VMware.",
    "Develop applications within commercial and open-source environments using technologies such as Linux, Python, C, Bash Scripting, Perl, SQL, and UIPath.",
    "Implement and manage Security Incident and Event Management (SIEM) tools.",
    "Collaborate in a DevOps environment, ensuring seamless deployment and operational efficiency.",
    "Utilize automation and orchestration tools such as Ansible to improve efficiency and reduce operational overhead.",
    "Work closely with stakeholders to align technical solutions with business requirements."
  ],
  "skills": [
    "Proficiency in application development and scripting using Linux, Python, C, Bash Scripting, Perl, SQL, and UIPath.",
    "Expertise in SIEM tools implementation and management.",
    "Experience working within a DevOps environment, leveraging automation and orchestration solutions.",
    "Excellent problem-solving skills with the ability to adapt to evolving technologies and customer needs.",
    "Strong interpersonal and communication skills to effectively interact with stakeholders and team members.",
    "Ability to learn new technologies quickly.",
    "Customer service-oriented and detail-focused.",
    "Self-motivated and able to work well in team environments."
  ],
  "qualifications": [
    "Bachelor’s and/or Master’s degree in Computer Science, Information Technology, or a related field.",
    "Minimum of 11 years of relevant experience in software engineering and enterprise data management.",
    "Proven experience engineering data analytics solutions for enterprise IT environments.",
    "Strong background in managing data flows and large-scale data management practices.",
    "Hands-on experience with cloud computing platforms such as AWS, Microsoft Azure, Nutanix, and VMware.",
    "US Citizenship and an active TS/SCI with Polygraph security clearance required.",
    "Advanced Splunk Certification (desired).",
    "Experience with Data Lake development or implementation (desired).",
    "Experience implementing Machine Learning capabilities within SIEM tools (desired)."
  ]
}