{
  "responsibilities": [
    "Develop AI and automation technologies for self-driving labs (SDLs).",
    "Manage SDLs and design research programs leveraging SDL platforms.",
    "Work independently and collaboratively with a diverse team of experts.",
    "Report to the Academic Director and Executive Director of the Acceleration Consortium.",
    "Determine required capabilities of SDLs and develop plans to meet user requirements.",
    "Design novel instruments for automated material synthesis and characterization.",
    "Develop customized hardware and Python software packages for SDLs.",
    "Select, procure, and install equipment required for SDLs.",
    "Develop research programs to support AC faculty and industry partners.",
    "Synthesize and characterize large quantities of candidate molecules using SDLs.",
    "Calibrate theoretical models with experimental data and predict promising candidates.",
    "Elucidate structure-property relationships of emerging molecules and materials.",
    "Implement research and development projects for AC’s industry partners.",
    "Develop plans for research collaborations and estimate financial resources.",
    "Work with Product Managers to ensure research outcomes meet partner requirements.",
    "Promote AC’s research capacity and deliver presentations at conferences.",
    "Collaborate in the preparation and submission of research proposals and progress reports.",
    "Prepare manuscripts for submission to peer-reviewed publications/journals.",
    "Support consulting services related to SDLs for materials discovery.",
    "Support research-focused events such as the Annual Symposium."
  ],
  "skills": [
    "Strong and effective communicator in oral and written English.",
    "Collegial in working with team members and collaborators.",
    "Ability to work independently.",
    "Strong publication record.",
    "Success in writing and preparing manuscripts, presentations, reports, briefs, and scientific abstracts for peer-reviewed journals."
  ],
  "qualifications": [
    "Ph.D. in computer science, engineering, chemistry, physics, life sciences, or related discipline.",
    "1 to 5 years of experience in accelerated research and development.",
    "Demonstrated academic and research excellence.",
    "Experience working with industry partners and on industry-led research and development projects.",
    "Expert knowledge of AI and automation.",
    "Experience with the development of self-driving laboratories.",
    "Experience presenting research at academic conferences."
  ]
}