{
  "responsibilities": [
    "Design, model, or implement data warehousing activities to contribute to the design and development of Meta products.",
    "Manage and execute data warehouse plans for a product or a group of products to solve well-scoped problems.",
    "Identify the data needed for a business problem and implement logging required to ensure availability of data.",
    "Collaborate with engineers, product managers, and data scientists to understand data needs and represent key data insights visually.",
    "Build data expertise and leverage data controls to ensure privacy, security, compliance, data quality, and operations.",
    "Design, build, and launch new data models and visualizations in production.",
    "Independently design, build, and launch new data extraction, transformation, and loading processes in production.",
    "Support existing processes running in production and implement optimized solutions with limited guidance.",
    "Define and manage SLA for data sets in allocated areas of ownership.",
    "Work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors.",
    "Exercise judgment within defined procedures and practices to determine appropriate action."
  ],
  "skills": [
    "Data Visualization using Tableau, R, Python, or PowerBI",
    "Legacy Data Migration",
    "Database systems including relational, distributed, NoSQL, and/or object databases",
    "Custom ETL design, implementation, and maintenance",
    "Object-oriented programming languages",
    "Schema design and dimensional data modeling",
    "Writing SQL statements",
    "Analyzing data to identify deliverables, gaps, and inconsistencies",
    "Managing and communicating data warehouse plans to internal clients",
    "MapReduce or MPP system",
    "Programming in Python"
  ],
  "qualifications": [
    "Master's degree in Computer Science, Engineering, Information Systems, Statistics, Data Analytics, Mathematics, Applied Sciences, or a related field.",
    "Completion of a graduate-level course, research project, or internship in relevant areas such as data visualization, legacy data migration, database systems, ETL design, object-oriented programming, schema design, SQL, data analysis, data warehouse management, MapReduce or MPP systems, and Python programming."
  ]
}