{
  "responsibilities": [
    "Contribute to the architecture, design, development, and testing of new features and solutions for the Pipelines component in Kubeflow and OpenShift AI.",
    "Innovate in the MLOps domain by participating in open source communities.",
    "Develop integrations between various components of the OpenShift AI stack.",
    "Ensure non-functional requirements including security, resiliency, and maintainability are met.",
    "Write unit and integration tests and work with quality engineers to ensure product quality.",
    "Contribute to a culture of continuous improvement by sharing recommendations and technical knowledge with team members.",
    "Collaborate with product management, other engineering, and cross-functional teams to analyze and clarify business requirements.",
    "Communicate effectively to stakeholders and team members to ensure proper visibility of development efforts.",
    "Give thoughtful and prompt code reviews."
  ],
  "skills": [
    "Experience developing applications in Go or Python.",
    "Familiarity with Kubernetes, OpenShift, or other cloud-native technologies.",
    "Ability to quickly learn and use new tools and technologies.",
    "Experience with source code management tools such as Git.",
    "Good system understanding and troubleshooting capabilities.",
    "Ability to work independently in a fast-paced, ever-changing environment.",
    "Excellent written and verbal communication skills."
  ],
  "qualifications": [
    "Understanding of how Open Source communities work.",
    "Experience with development for public cloud services (AWS, GCE, Azure).",
    "Experience working with or deploying MLOps platforms.",
    "Experience with pipelines tools such as Argo or Tekton.",
    "Familiarity with data science workflows and machine learning pipelines.",
    "Experience writing Kubernetes/OpenShift controllers and operators.",
    "Experience writing DSLs in Python or other languages.",
    "While a Bachelor’s degree or higher in computer science or a related discipline is valued, practical experience and technical prowess are prioritized."
  ]
}