{
  "responsibilities": [
    "Partner with product management to identify challenges, scope ML opportunities, and design solutions.",
    "Understand business requirements and present technical solutions to non-technical team members.",
    "Collaborate with engineering, data science, and product teams to implement ML and GenAI solutions in production environments.",
    "Evaluate and improve existing machine learning models.",
    "Leverage Google Cloud Platform and VertexAI for model training and deployment.",
    "Enhance ML infrastructure and tools to keep aligned with industry best practices.",
    "Work with big and novel data by data wrangling, feature engineering, model building, and visualization.",
    "Process large quantities of data streamed from many different applications to test and build models.",
    "Build DAGs, ETL pipelines, perform exploratory data analysis, and develop scalable solutions."
  ],
  "skills": [
    "Proficient in developing in Python and SQL.",
    "Experience with ML/AI frameworks and tools: PyTorch, Tensorflow, Sci-kit Learn, XGBoost, Pandas, Numpy, Flask, Langchain, Spark/Pyspark.",
    "Experience with Google Cloud Platform - Vertex AI or other cloud platforms for ML implementation.",
    "Experience working with BigQuery, Composer, DAGs, Spark/Pyspark, and other data tools.",
    "Eagerness to learn new techniques and technologies.",
    "Problem-solving skills and ability to contribute in a team environment.",
    "Great interpersonal skills and experience working with cross-functional teams."
  ],
  "qualifications": [
    "Masters or PhD qualification in a quantitative field such as Computer Science, Machine Learning/AI, Mathematics, Physics, Statistics, etc.",
    "3+ years of commercial/academic experience with demonstrated technical skills in areas such as NLP, Classification, Statistical Modelling, Deep Learning, GenAI, and Forecasting.",
    "Professional experience developing, deploying, and evaluating machine learning in an industrial setting, with a track record of delivering impactful results.",
    "Illustrated history of living the values necessary to Priceline: Customer, Innovation, Team, Accountability, and Trust.",
    "Unquestionable integrity and ethics."
  ]
}