{
  "responsibilities": [
    "Work closely with engineers, researchers, and product managers to implement ML solutions that promote globalization and culturalization.",
    "Work across organizational boundaries to align on priorities and drive projects forward.",
    "Contribute to designing and developing Machine Learning technologies for text, image, audio, and video, focusing on Generative AI.",
    "Collaborate with cross-functional teams, including machine learning engineers, research engineers, and product management, to contribute to new ML features.",
    "Engage in the product lifecycle, design, deployment, and production operations.",
    "Be comfortable with prompt engineering and building models leveraging large data.",
    "Preprocess, clean, organize, and evaluate datasets as needed for model training and evaluation.",
    "Evaluate model performance and improve accuracy.",
    "Stay up-to-date with the latest machine learning and AI technologies, bringing innovative solutions to the team and advocating for new tools, frameworks, and methodologies.",
    "Create and maintain detailed documentation for data processing, model development, testing, and integration ensuring clear communication across teams and stakeholders."
  ],
  "skills": [
    "Proficient in multiple programming languages (preferably Typescript/Javascript, Python), web components and ML frameworks.",
    "Knowledge and experience with the entire ML training pipeline (data collection, training and evaluation).",
    "Good verbal and written communication skills.",
    "Self-motivated, self-starter, quick learner, independent."
  ],
  "qualifications": [
    "BS in Computer Science or equivalent.",
    "3-8 years of experience as a Software Development or Machine Learning engineer or equivalent.",
    "Experience with integrating ML solutions into products.",
    "Experience in building generative and conversational AI solutions.",
    "Experience in GenAI (LLMs and Diffusion model).",
    "Experience with GPU optimization."
  ]
}