{
  "responsibilities": [
    "Support product development efforts ranging from generative AI and machine learning application development and deployment to model development and monitoring, ML management, and DevOps.",
    "Contribute to a Software Engineering team that supports production applications and helps develop new features and models.",
    "Interface with internal and external stakeholders to ensure delivery of workable solutions that meet customer requirements and technical capabilities.",
    "Drive the end-to-end model development lifecycle, ensuring reproducible research and well-managed software delivery.",
    "Collaborate with a cross-functional team, sharing information and partnering effectively with colleagues globally.",
    "Mentor teammates and work closely with product teams to integrate and deploy work into production environments.",
    "Translate complex business problems into projects with clearly defined scope and deliver timely, well-managed deliverables.",
    "Foster innovative ideas to solve real-world challenges and iterate on improvements rapidly.",
    "Communicate proactively and compellingly to both technical and non-technical audiences.",
    "Lead the adoption of AI across the enterprise."
  ],
  "skills": [
    "Proficiency in Python.",
    "Solid software engineering skills and experience.",
    "Experience in designing, developing, and implementing machine learning models and algorithms.",
    "Ability to manage uncertainty and ambiguity in problem statements and paths to success.",
    "Strong communication and data-driven decision-making skills.",
    "Experience developing libraries and APIs for others to use.",
    "Familiarity with NLP/CV libraries such as PyTorch, TensorFlow, Scikit-learn, spaCy, HuggingFace Transformers/Diffusers, OpenAI, LangChain, Semantic Kernel & OpenCV.",
    "Experience using Cloud solutions (AWS, Azure, etc.) for building and deploying applications.",
    "Experience in a fast-paced, agile environment."
  ],
  "qualifications": [
    "Master’s or Bachelor’s in a relevant discipline, or relevant experience in lieu of a degree.",
    "At least 3+ years of practical, relevant experience building AI/ML products and applications.",
    "Recent demonstrable experience using Generative AI technologies such as RAG patterns, ReAct, LangChain, etc.",
    "Experience as a technical leader, leading aspects of ideation with product stakeholders.",
    "Ability to obtain and maintain a U.S. National Security Clearance.",
    "Preferred: 6+ years of practical experience using AI and ML to solve diverse and/or ambiguous problems in academia or industry.",
    "Preferred: Familiarity with common NLP use cases such as chatbot development, information retrieval, language translation, NER, summarization, and topic modeling.",
    "Preferred: Familiarity with LLM training and efficient finetuning (PEFT, LoRA, Quantization)."
  ]
}