{
  "responsibilities": [
    "Partner with a cross-functional team of engineers, research scientists, technical program managers, and product managers to deliver AI-powered products.",
    "Design, develop, test, deploy, and support AI software components including foundation model training, large language model inference, similarity search, guardrails, model evaluation, experimentation, governance, and observability.",
    "Leverage a broad stack of Open Source and SaaS AI technologies such as AWS Ultraclusters, Huggingface, VectorDBs, Nemo Guardrails, PyTorch, and more.",
    "Invent and introduce state-of-the-art LLM optimization techniques to improve the performance of large scale production AI systems.",
    "Contribute to the technical vision and the long term roadmap of foundational AI systems at Capital One."
  ],
  "skills": [
    "Strong foundation in engineering and mathematics.",
    "Expertise in hardware, software, and AI.",
    "Ability to intuitively understand scientific publications and apply novel techniques in production.",
    "Ability to adapt quickly and bring clarity to big, undefined problems.",
    "Excellent communication and presentation skills.",
    "Ability to lead and mentor an engineering team and influence cross-functional stakeholders."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, Engineering, or AI plus at least 6 years of experience developing AI and ML algorithms or technologies, or Master's degree plus at least 4 years of experience.",
    "At least 6 years of experience programming with Python, Go, Scala, or Java.",
    "7 years of experience deploying scalable and responsible AI solutions on cloud platforms (e.g. AWS, Google Cloud, Azure).",
    "Experience designing, developing, integrating, delivering, and supporting complex AI systems.",
    "Experience developing AI and ML algorithms or technologies using Python, C++, C#, Java, or Golang.",
    "Master's degree in Computer Science, Computer Engineering, or relevant technical field.",
    "Experience developing and applying state-of-the-art techniques for optimizing training and inference software."
  ]
}