{
  "responsibilities": [
    "Collect external data and create actionable fraud and financial crime intelligence for enterprise control owners.",
    "Conduct internal threat hunting and analytical research to detect active attacks and emerging trends.",
    "Perform control validation testing to identify and remediate control and data visibility gaps.",
    "Enhance the organization's ability to detect and prevent cyber-enabled financial crimes.",
    "Develop new signals and rapid prototypes to mitigate fraud losses and cybercrime exposure.",
    "Assess criminal enablement tools/services and develop new fingerprint and detection capabilities.",
    "Conduct advanced threat simulations and perform control tests.",
    "Collaborate and consult with peers, colleagues, and managers to resolve issues and achieve goals.",
    "Mitigate fraud losses and operational expenses by improving mean-time-to-detect (MTD).",
    "Partner with Engineering on deploying production-ready/scalable capabilities.",
    "Drive efficiency, automation, and collaboration across relevant horizontal processes.",
    "Detect account patterns and features linked to Crime-as-a-Service enablers and cybercriminal tactics, techniques, and procedures (TTPs).",
    "Develop a deep understanding of internal systems that could be exploited by financially motivated criminals."
  ],
  "skills": [
    "Cyber security threat detection and response",
    "Offensive cybercrime security research",
    "Complex financial crime investigations (fraud, Anti-Money Laundering)",
    "Fraud strategies",
    "Data science and advanced analytical threat detection",
    "Log analysis, Splunk, pen testing, mobile and/or cloud security",
    "Reverse engineering",
    "Security architecture",
    "Financial crime detection management",
    "BOT mitigation platforms and edge security controls",
    "Incident response lifecycle management",
    "Proficient operational security",
    "Knowledge of FinCEN's financial crime priorities, including BSA/AML",
    "Python programming (a plus)"
  ],
  "qualifications": [
    "5+ years of cyber security engineering experience, or equivalent demonstrated through work experience, training, military experience, or education",
    "5+ years of programming and cyber-enabled financial crime threat mitigation experience",
    "Ability to travel up to 10%"
  ]
}