{
  "responsibilities": [
    "Partner with various teams to develop business requirements to standardize the business input and develop a long-term vision.",
    "Design and implement data solutions that drive business impact.",
    "Turn data chaos into scalable, efficient, and automated solutions.",
    "Design, implement, and build data models and pipelines that deliver data with measurable quality under the service level agreement.",
    "Partner with product teams, data analysts, and engineering teams to build foundational data sets that are trusted, well understood, and aligned with business strategy.",
    "Work with the team and stakeholders to scope and prioritize solutions.",
    "Follow rigorous engineering processes to ensure service quality, delivery of new capabilities, and continuously improving metrics.",
    "Understand Microsoft security and privacy guidelines and bring the system in compliance.",
    "Understand Big Data strategy and implement a scalable data platform.",
    "Embody Microsoft’s Culture and Values."
  ],
  "skills": [
    "Leadership, creativity, and out-of-the-box thinking.",
    "Ability to design and implement data solutions.",
    "Ability to turn data chaos into scalable, efficient, and automated solutions.",
    "Ability to build data models and pipelines.",
    "Ability to work with product teams, data analysts, and engineering teams.",
    "Ability to follow rigorous engineering processes.",
    "Understanding of Microsoft security and privacy guidelines.",
    "Understanding of Big Data strategy."
  ],
  "qualifications": [
    "Bachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 2+ years experience in business analytics, data science, software development, data modeling, or data engineering work OR Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering, or related field AND 1+ year(s) experience in business analytics, data science, software development, or data engineering work OR equivalent experience.",
    "2+ years of experience building highly scalable applications, specifically with coding languages such as Python and SQL (Structured Query Language).",
    "Ability to meet Microsoft, customer, and/or government security screening requirements.",
    "3+ years of software engineering experience including building a large-scale data platform (Preferred).",
    "3+ years of experience building highly scalable applications (Preferred).",
    "Experience creating high-quality data pipelines (Preferred).",
    "Proven experience in version control and CI/CD (Continuous integration and continuous delivery) tools (Preferred).",
    "Extensive experience in pioneering, scaling, and optimizing data pipelines, data storage, large-scale data processing/analytics platform, dashboards (Preferred)."
  ]
}