{
  "responsibilities": [
    "Manage and maintain database systems (e.g., Oracle, SQL Server, AWS RDS, Snowflake) to ensure availability, reliability, and optimal performance.",
    "Perform routine database tuning, including indexing, query optimization, and storage management, to meet workload demands.",
    "Plan and execute database backups, recovery strategies, and replication to ensure business continuity and disaster recovery alignment.",
    "Oversee database security, implementing role-based access control (RBAC), encryption, and compliance with corporate security policies.",
    "Collaborate with development teams to design and implement schema changes, migrations, and performance benchmarks.",
    "Design, build, and maintain ETL/ELT pipelines for investment applications, ensuring seamless integration and high-performance data workflows.",
    "Implement CI/CD pipelines to automate data deployment, testing, and monitoring processes.",
    "Develop reusable frameworks and best practices for ingesting, transforming, and integrating structured and unstructured datasets.",
    "Build and maintain cloud-native data platforms, with a focus on AWS services (e.g., S3, RDS, Redshift, Athena) and Snowflake.",
    "Implement Infrastructure as Code (IaC) practices using tools like Terraform or CloudFormation to provision and manage cloud resources.",
    "Monitor cloud resource utilization and optimize for performance and cost efficiency.",
    "Establish proactive monitoring and alerting for data workflows and databases using tools like AWS CloudWatch, Datadog, or Prometheus.",
    "Troubleshoot and resolve database and data pipeline issues, ensuring minimal downtime and consistent performance.",
    "Drive automation initiatives to streamline manual database tasks and improve operational efficiency.",
    "Define and enforce standards for data quality, data governance, and audit readiness.",
    "Work closely with IT Governance, Unified Data Platform (UDP) and Unified Data Governance (UDG) and InfoSec groups to ensure all database and data operations meet Governance and ICFR standards.",
    "Act as a technical liaison for database and data platform-related vendor engagements.",
    "Interpret internal/external challenges, critically evaluate products/services/workflows, identify areas of inefficiencies and optimization, and recommend solutions based on best practices.",
    "Act as a mentor for junior colleagues and invest time to grow individuals in a technical capacity.",
    "Advocate for Agile and DevOps principles, fostering a culture of collaboration and continuous improvement."
  ],
  "skills": [
    "Expertise in SQL and advanced query optimization.",
    "Strong proficiency in database platforms, including Oracle, SQL Server, PostgreSQL, and Snowflake.",
    "Experience with cloud-native database services such as AWS RDS, Redshift, DynamoDB, and Snowflake.",
    "Hands-on experience with ETL tools (e.g., AWS Glue, DBT, Apache Airflow) and DevOps tools (e.g., Azure DevOps, Jenkins, GitLab CI/CD, Docker, Kubernetes).",
    "Advanced knowledge of backup, recovery, replication, and disaster recovery strategies.",
    "Hands-on experience with Infrastructure as Code (IaC) tools like Terraform or equivalent.",
    "Strong problem-solving and troubleshooting abilities.",
    "Exceptional collaboration and communication skills to interact effectively with technical and business stakeholders.",
    "Detail-oriented and proactive in delivering high-quality data solutions.",
    "Desire to improve processes and procedures to improve current workflows."
  ],
  "qualifications": [
    "7+ years of experience in data operations, database administration, or related roles.",
    "Proven experience managing databases across cloud (AWS, Snowflake) and on-premises environments.",
    "Experience with automation is an asset.",
    "Certifications such as AWS Certified Database - Specialty, AWS Certified Data Engineer, SnowPro Advanced Architect, or Oracle Database Administrator are highly desirable."
  ]
}