{
  "responsibilities": [
    "Design and implement generative AI models using frameworks such as TensorFlow, PyTorch, or JAX.",
    "Work with advanced machine learning techniques, including GANs, VAEs, and transformer-based models.",
    "Stay up to date with the latest advancements in generative AI and apply cutting-edge research to develop innovative products.",
    "Collaborate with other research teams to explore new applications and technologies within the field of AI.",
    "Improve the efficiency and accuracy of generative models, implementing optimization techniques such as pruning, quantization, and knowledge distillation.",
    "Ensure the scalability of models for deployment in production environments.",
    "Work closely with software development teams, data scientists, and designers to integrate generative AI models into commercial applications and end-user products.",
    "Contribute to the definition of model architecture and the end-to-end lifecycle of AI solutions.",
    "Develop solutions to process and generate relevant outputs from large datasets using advanced data processing and machine learning techniques.",
    "Ensure that data pipelines and models are efficient and capable of handling real-world datasets at scale.",
    "Contribute to the development of generative AI-powered products such as content generation tools for text, images, video, music, or other multimedia.",
    "Provide insights into the application of generative models for commercial use cases.",
    "Implement rigorous testing strategies to ensure the robustness, reliability, and ethical considerations of generative models.",
    "Evaluate model performance, identify limitations, and propose improvements."
  ],
  "skills": [
    "Proficiency in Python and familiarity with programming languages such as C++ or Java for optimization tasks.",
    "Extensive experience with deep learning frameworks like TensorFlow, PyTorch, or JAX for developing and training generative models.",
    "Expertise in designing and deploying Generative Adversarial Networks (GANs), Variational Autoencoders (VAEs), and transformer-based models such as GPT, BERT, or similar architectures.",
    "Strong knowledge of linear algebra, probability theory, statistics, and optimization techniques relevant to AI and machine learning.",
    "Experience in handling large datasets, including preprocessing, augmentation, and cleaning data for AI models.",
    "Familiarity with data pipeline tools like Apache Spark, Dask, or similar technologies for scalable data processing.",
    "Knowledge of cloud platforms (AWS, Google Cloud, Azure) and experience in deploying machine learning models in cloud environments.",
    "Strong software engineering skills, including version control (Git), collaborative workflows, and Agile methodologies.",
    "Performance tuning and model optimization techniques such as pruning, quantization, and distributed training for large-scale model deployment.",
    "Understanding of the ethical considerations in AI development, including fairness, transparency, and bias mitigation techniques.",
    "Soft skills: Ability to work under pressure, maintain quality at work, and be results-oriented."
  ],
  "qualifications": [
    "Proficiency in Python and familiarity with programming languages such as C++ or Java.",
    "Extensive experience with deep learning frameworks like TensorFlow, PyTorch, or JAX.",
    "Expertise in designing and deploying GANs, VAEs, and transformer-based models.",
    "Strong knowledge of linear algebra, probability theory, statistics, and optimization techniques.",
    "Experience in handling large datasets and using data pipeline tools.",
    "Knowledge of cloud platforms and experience in deploying machine learning models in cloud environments.",
    "Strong software engineering skills, including version control and Agile methodologies.",
    "Experience with model optimization techniques and understanding of ethical considerations in AI development."
  ]
}