{
  "responsibilities": [
    "Build scalable and extensible platforms, services, and tools using Java, Python, Go, and other relevant technologies.",
    "Ensure automation, reliability, and security across multiple cloud environments (AWS, GCP, etc.).",
    "Design and automate security best practices into the CI/CD deployment pipeline.",
    "Work closely with data engineering, development, and IT teams to promote a culture of security awareness.",
    "Investigate vulnerability findings within the environment and coordinate remediation efforts.",
    "Ensure adherence to industry security standards (e.g., SOC 2, GDPR, HIPAA).",
    "Maintain up-to-date container images, apply security patches, and implement robust security measures for regulatory compliance."
  ],
  "skills": [
    "Proficiency in Java, Python, Go, or similar backend languages.",
    "Experience in building, maintaining, and debugging services, internal tools, and frameworks.",
    "Experience in automating and deploying large-scale production services in AWS, GCP, ECS & EKS, and/or GCP GKE.",
    "Proficiency in managing CI/CD infrastructures and tools like Github Actions, Jenkins, ArgoCD, Gitlab.",
    "Strong experience in security practices and AWS network engineering.",
    "Familiarity with configuration management tools like Chef/Terraform.",
    "Experience in designing, building, and managing complex deployment pipelines across multiple cloud providers."
  ],
  "qualifications": [
    "5+ years of experience with Java, Go, Python, or similar backend languages.",
    "5+ years of experience building, maintaining, and debugging services, internal tools, and frameworks.",
    "5+ years of experience automating and deploying large-scale production services in AWS, GCP, ECS & EKS, and/or GCP GKE.",
    "3+ years experience managing CI/CD infrastructures.",
    "Ability to access federal environments and/or have access to protected federal data.",
    "U.S. Person status (e.g., U.S. Citizen, National, Lawful Permanent Resident, Refugee, or Asylee)."
  ]
}