{
  "responsibilities": [
    "Design, build, and maintain the infrastructure required for optimal extraction, transformation, and loading of data from various sources.",
    "Develop and manage data pipelines and workflows for machine learning models.",
    "Design, develop, and implement machine learning models for underwriting and other financial service applications.",
    "Ensure models are robust, scalable, and maintainable.",
    "Work closely with data scientists, software engineers, and product managers to integrate machine learning models into production systems.",
    "Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.",
    "Monitor and evaluate the performance of deployed models, ensuring they meet the desired accuracy and efficiency metrics.",
    "Implement processes for continuous improvement and optimization of models.",
    "Design and implement experiments to optimize models and ensure they align with business goals.",
    "Provide guidance and mentorship to junior engineers, fostering a culture of learning and growth within the team."
  ],
  "skills": [
    "Proficiency in programming languages such as Python or Ruby.",
    "Strong understanding of data structures, algorithms, and software design principles.",
    "Experience with machine learning frameworks and libraries (e.g., TensorFlow, PyTorch).",
    "Familiarity with MLOps practices and tools for continuous integration and deployment of ML models.",
    "Experience with cloud services (e.g., AWS, GCP) and containerization technologies (e.g., Docker, Kubernetes).",
    "Strong problem-solving skills with the ability to analyze complex data sets.",
    "Proficient in building predictive models, performing statistical analysis, and utilizing machine learning algorithms.",
    "Excellent verbal and written communication skills."
  ],
  "qualifications": [
    "Bachelor’s degree in Computer Science, Engineering, Mathematics, or a related field. Advanced degree preferred.",
    "Minimum of 3 years of experience in machine learning engineering, with a proven track record of deploying ML models in production environments."
  ]
}