{
  "responsibilities": [
    "Architect production level ML workloads for customers using the Databricks platform, including end-to-end ML pipelines, training/inference optimization, integration with cloud-native services, and MLOps.",
    "Provide advanced technical support to Solution Architects during the technical sale, including feature engineering, training, tracking, serving, and model monitoring.",
    "Collaborate with product and engineering teams to represent the voice of the customer, define priorities, and influence the product roadmap.",
    "Build and increase customer data science workloads and apply best MLOps practices to productionize these workloads across various domains.",
    "Serve as a trusted technical advisor for customers developing GenAI solutions, such as RAG architectures, querying structured data with natural language, content generation, and monitoring."
  ],
  "skills": [
    "Expertise in architecting production-grade ML applications.",
    "Advanced technical support and problem-solving skills.",
    "Ability to collaborate with product and engineering teams.",
    "Proficiency in building and optimizing data science workloads.",
    "Strong advisory skills for developing GenAI solutions.",
    "Experience with cloud platforms (AWS/Azure/GCP) and MLOps.",
    "Knowledge of natural language processing techniques and tools like HuggingFace, Langchain, and OpenAI.",
    "Excellent communication and teaching skills for both technical and non-technical audiences.",
    "Passion for collaboration, life-long learning, and driving company values through ML."
  ],
  "qualifications": [
    "5+ years of hands-on industry ML experience in roles such as ML Engineer or Data Scientist.",
    "Graduate degree in a quantitative discipline (Computer Science, Engineering, Statistics, Operations Research, etc.) or equivalent practical experience.",
    "[Preferred] 2+ years of customer-facing experience in a pre-sales or post-sales role.",
    "[Preferred] Experience working with Apache Spark™ to process large-scale distributed datasets.",
    "Ability to meet expectations for technical training and role-specific outcomes within 3 months of hire.",
    "Willingness to travel up to 30% when needed."
  ]
}