{
  "responsibilities": [
    "Oversee the design and implementation of a master database management system for vegetation data.",
    "Ensure the database system is accessible, up-to-date, and searchable with existing GIS, transmission, distribution inspection, tree trimming, reporting, and customer databases.",
    "Document decisions and maintain organized and versioned documentation for regulatory oversight.",
    "Design and oversee execution of Master Database Management for databases such as GIS, SQL, remote sensing, invoicing, inspections, and vegetation catalogs.",
    "Hire and oversee employees, contractors, or consultants in database build.",
    "Mentor and coach analysts in using new databases.",
    "Assess skills of existing team and provide training recommendations.",
    "Provide technical vision and roadmap for future state of Vegetation Management.",
    "Gather requirements from IT, GIS, Transmission, Distribution, Vegetation Management, Data Governance in database design.",
    "Provide timeline and effort estimates to leadership.",
    "Co-build databases with IT.",
    "Communicate with senior leadership on proposed database recommendations."
  ],
  "skills": [
    "Database design and implementation",
    "Documentation and version control",
    "Leadership and team management",
    "Mentoring and coaching",
    "Technical vision and roadmap development",
    "Requirement gathering and collaboration",
    "Communication with senior leadership"
  ],
  "qualifications": [
    "Bachelor's degree in a quantitative field or equivalent experience.",
    "10 years of experience with multiple data engineering/ETL ecosystems such as Palantir Foundry, Spark, Informatica, SAP BODS, OBIEE.",
    "Proven track record of successfully implementing data warehouses/data lakes over the previous five years.",
    "Experience leading development teams.",
    "3 years of experience in machine learning algorithm deployment and machine learning operations.",
    "Experience as a technical lead (desired).",
    "Experience in managing projects: delivery, timeline, roadmap design, and stakeholder engagement (desired).",
    "Experience in Agile development (desired).",
    "Very experienced in SQL and Python (desired).",
    "Demonstrated experience in database design (desired).",
    "Experience in Foundry (desired).",
    "Experience in GIS (desired).",
    "Utility experience (desired).",
    "Salesforce Application (desired)."
  ]
}