{
  "responsibilities": [
    "Design and deploy advanced machine learning, operations research, and optimization solutions across various aspects of healthcare operations.",
    "Translate complex healthcare challenges into actionable strategies.",
    "Collaborate effectively with clinicians, operations teams, and product managers to align data-driven solutions with business goals.",
    "Design experiments, pilot studies, and A/B tests to assess the impact of interventions in clinical and operational contexts.",
    "Stay current with advancements in machine learning, operations research, and healthcare analytics.",
    "Prioritize adherence to healthcare privacy regulations and implement secure workflows for data handling and deployment."
  ],
  "skills": [
    "Developing and deploying machine learning models using complex healthcare data.",
    "Creating and scaling LLM-based solutions, including Retriever-Augmented Generation (RAG) architectures.",
    "Applying operations research techniques such as linear programming, queueing theory, and optimization.",
    "Excellent communication skills to convey complex technical concepts to both technical and non-technical stakeholders.",
    "Proficiency in Python or R, with experience in libraries/frameworks like scikit-learn, PyTorch, or TensorFlow.",
    "Strong SQL skills and familiarity with distributed computing platforms like Spark or Hadoop.",
    "Experience with cloud environments (AWS, GCP, Azure) and MLOps best practices.",
    "Knowledge of LLMs, NLP, and Retriever-Augmented Generation (RAG).",
    "Strong analytical thinking and problem-solving abilities."
  ],
  "qualifications": [
    "5+ years of experience in data science, predictive analytics, or related roles.",
    "Exposure to EHR data structures and workflows in healthcare.",
    "Master’s or PhD in Data Science, Computer Science, Statistics, Mathematics, Operations Research, or a related quantitative discipline.",
    "Hands-on experience with operations research methods, simulation modeling, and resource optimization in healthcare or related fields (Nice to Have).",
    "Familiarity with RTLS data for asset tracking or workflow analysis (Nice to Have).",
    "Previous experience mentoring or leading junior data scientists or engineers (Nice to Have).",
    "Familiarity with DevOps/MLOps tools like Docker, Kubernetes, and Airflow, as well as CI/CD pipelines (Nice to Have).",
    "Advanced knowledge of simulation modeling and its application in healthcare (Nice to Have).",
    "Experience developing tools for real-time decision-making in healthcare environments (Nice to Have)."
  ]
}