{
  "responsibilities": [
    "Design, build, and launch scalable ML and data processing systems supporting multi-machine data processing, GPU/TPU model training, and automated model monitoring systems on cloud platforms.",
    "Automate model lifecycle management, including training, evaluation, and deployment, to enable fast, safe, and consistent updates across environments.",
    "Introduce modern, scalable frameworks for model monitoring, feature engineering, hyperparameter tuning, and continuous re-training.",
    "Lead the deployment of models through REST and gRPC APIs for smooth integration with application frontends and real-time user interaction.",
    "Continuously research, evaluate, and implement the latest MLOps tools, frameworks, and platforms.",
    "Implement and manage monitoring systems to track model and data performance, using tools like Prometheus and Grafana.",
    "Apply best practices in secure data handling and model integrity within ML workflows.",
    "Share MLOps knowledge and improvements in ML engineering workflows through internal training sessions and presentations.",
    "Support the next phase of ML pipeline development, focusing on building, maintaining, and monitoring pipelines to handle increased data volume."
  ],
  "skills": [
    "Ability to exude ambitious, collaborative, and empathetic values.",
    "High standards for quality and passion for the field.",
    "Agility in moving between rapid prototyping and stable production development.",
    "Proficiency in writing design documents, performing code reviews, and maintaining state-of-the-art engineering practices.",
    "Openness to giving and receiving critical feedback.",
    "Enthusiasm for teamwork and pair work.",
    "Utilization of data and metrics to drive decision-making.",
    "Proactive identification and addressing of bottlenecks in the ML pipeline."
  ],
  "qualifications": [
    "8+ years of software development experience with a focus on platform development with AI/ML applications of scale.",
    "Experience in providing technical leadership to ML Infra / ML Platform teams.",
    "Experience in shipping products at scale.",
    "Expertise in clean and efficient coding with a focus on Python.",
    "Experience with orchestration frameworks such as Dagster/Airflow.",
    "Expertise in one or more Cloud platforms (GCP preferred but not required).",
    "Bachelor’s Degree or higher in Computer Science, Mathematics, or related field.",
    "Excellent document writing skills and presenting results through Jupyter notebooks.",
    "Extreme creativity and resourcefulness, appetite to solve previously unsolved problems."
  ]
}