{
  "responsibilities": [
    "Design, develop, and maintain automated test frameworks and suites using Java-based frameworks such as JUnit, TestNG.",
    "Collaborate closely with software engineers, product managers, and other stakeholders to understand requirements and ensure comprehensive test coverage.",
    "Implement and execute test plans and test cases to ensure comprehensive test coverage.",
    "Perform API testing using tools like REST Assured to validate data integrity and functionality of backend services.",
    "Define requirements and propose solutions to streamline the testing process with a strong commitment to ownership.",
    "Engage in in-depth technical dialogues with the engineering team, comprehend software workflows and use cases, and ensure the system's testability.",
    "Deliver timely and precise updates on testing status and quality metrics to stakeholders throughout all testing phases.",
    "Compile Quality outcomes summary upon project completion.",
    "Advocate for superior software testing practices within the team and foster adoption across the organization."
  ],
  "skills": [
    "Strong analytical and problem-solving skills to effectively debug and resolve complex technical issues.",
    "Ability to grasp issues quickly and make educated, critical judgment in the absence of complete requirements.",
    "Adaptability to thrive in fast-paced environments with frequent context switching.",
    "Proficiency in programming languages such as Java.",
    "Ability to abstract technical details and effectively communicate to audiences at different levels.",
    "Proficient at balancing multiple efforts simultaneously and meeting strict deadlines."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science or equivalent field.",
    "Minimum of 3+ years of professional experience in software development, with a strong emphasis on designing, implementing frameworks/APIs, and tools.",
    "Solid understanding of software development lifecycle, testing methodologies, QA terminology, and processes.",
    "Experience developing in Java, Python, familiar with databases, SQL, and scripting languages.",
    "Deep understanding of automated software testing methodologies and lifecycle, including integration testing, component mocking, and dependency injection.",
    "Experience in testing API/Web Service, Web and iOS native applications.",
    "Hands-on experience on Karate, RestAssured, Playwright/Selenium, Appium/XCUI, and similar frameworks.",
    "Proven experience as an SDET or similar role, with a focus on testing eCommerce platforms or large-scale web applications.",
    "Experience with Kubernetes, Docker, AWS services (Lambda, S3, EC2), GCP, or Azure for cloud-based test execution and infrastructure management.",
    "Exposure to machine learning tools and their integration with automation frameworks."
  ]
}