{
  "responsibilities": [
    "Engage with complex business challenges, harnessing modern tools and technologies to securely store, process, transform, and enrich terabyte to petabyte scale healthcare data.",
    "Design, develop, and maintain optimal data pipelines to assemble large and intricate datasets.",
    "Collaborate closely with teams to craft tools that provide actionable insights and integrate them with consumer touchpoints.",
    "Deliver innovative solutions to business problems by collaborating with cross-functional teams in a dynamic and agile environment.",
    "Solve problems associated with large scale complex, structured and unstructured data."
  ],
  "skills": [
    "SQL and NoSQL",
    "Python or a comparable scripting language",
    "Data modeling and technical architectures",
    "ETL/ELT and building high-volume data pipelines",
    "Reporting/analytic tools",
    "Query optimization, data structures, transformation, metadata, dependency, and workload management",
    "Big data and cloud architecture",
    "Collaboration and communication skills",
    "Data visualization and reporting",
    "Designing and building data engineering solutions in cloud environments",
    "Git, CI/CD pipeline, and other DevOps principles/best practices",
    "Bash shell scripts, UNIX utilities & UNIX Commands",
    "Software development methodologies including waterfall and agile",
    "Leveraging multiple tools and programming languages to analyze and manipulate data sets",
    "API development",
    "Schema design and dimensional data modeling",
    "Knowledge of microservices and SOA"
  ],
  "qualifications": [
    "1+ years of experience with SQL, NoSQL",
    "1+ years of experience with Python (or a comparable scripting language)",
    "1+ years of experience with Data warehouses and infrastructure components",
    "1+ years of experience with ETL/ELT, and building high-volume data pipelines",
    "1+ years of experience with reporting/analytic tools",
    "1+ years of experience with query optimization, data structures, transformation, metadata, dependency, and workload management",
    "1+ years of experience with Big data and cloud architecture",
    "Experience with complex systems and solving challenging analytical problems",
    "Google Professional Data Engineer Certification (preferred)",
    "Formal SAFe and/or agile experience",
    "Previous healthcare experience and domain knowledge",
    "Experience designing, building, and maintaining data processing systems",
    "Experience architecting and building data warehouse and data lakes",
    "Bachelor’s Degree or equivalent work experience in Computer Science, Information Systems, Data Engineering, Data Analytics, Machine Learning, or related field required",
    "Master’s Degree preferred"
  ]
}