{
  "responsibilities": [
    "Lead the design and development of advanced algorithms and software solutions for trusted autonomous systems.",
    "Conduct experiments to explore new AI and ML technologies.",
    "Collaborate with cross-functional teams, including hardware engineers, system engineers, and product managers.",
    "Develop Test, Evaluation, Verification, and Validation (TEV&V) procedures and techniques for IAS.",
    "Solve real-world challenges and define ML strategy for key DoD clients."
  ],
  "skills": [
    "Experience in AI or ML research and development, with a focus on autonomous systems.",
    "Experience with ML, computer vision, and deep learning algorithms.",
    "Proficiency in programming languages, including Python, C++, or Java.",
    "Ability to develop innovative ML models and algorithms to improve IAS performance.",
    "Ability to present research findings and recommendations to clients and executive leadership.",
    "Ability to build collaboration partnerships with industry and academic institutions.",
    "Ability to identify opportunities for innovation in AI and ML technologies and autonomous systems."
  ],
  "qualifications": [
    "Ability to obtain a Secret clearance.",
    "Bachelor's degree in Computer Science or Electrical Engineering.",
    "Experience with DevOps tooling, pipelines, and building containerized applications in a Kubernetes environment (Nice to have).",
    "Experience with CI/CD principles, methodologies, and tools, including GitLab CI/CD and Jenkins (Nice to have).",
    "Experience with distributed data and computing tools, including Spark, Databricks, Hadoop, Hive, AWS EMR, or Kafka (Nice to have).",
    "Experience leading a team of AI and ML engineers, researchers, and data scientists (Nice to have).",
    "Possession of strong communication and leadership skills (Nice to have).",
    "Possession of strong R&D proposal writing and organization skills (Nice to have).",
    "Secret clearance (Nice to have).",
    "Master's degree in Computer Science or Electrical Engineering (Nice to have)."
  ]
}