{
  "responsibilities": [
    "Define and measure quantitative UX goals and metrics in collaboration with Designers, Qualitative Researchers, Data Scientists, Engineers, and Program Managers.",
    "Develop code and statistical models to understand user experience.",
    "Conduct empirical research using methods from computer science, quantitative social science, statistics, econometrics, and other fields to understand user behavior and extract meaningful patterns from large data sets.",
    "Examine existing data and product designs to generate hypotheses and plans for high-impact research.",
    "Prioritize and drive research to improve user experience.",
    "Communicate findings to stakeholders in the company.",
    "Make research findings convincing and actionable for both research experts and non-experts."
  ],
  "skills": [
    "Proficiency in programming languages used for data manipulation and computational statistics (e.g., Python, R, MATLAB, C++, Java, or Go).",
    "Expertise in descriptive, inferential, and multivariate statistics, including t-test and ANOVA, and experimental design.",
    "Ability to program computational and statistical algorithms for large data sets.",
    "Excellent command of research questions within a given domain, and of technical tools for the analysis of data within that field.",
    "Skills in behavioral research design, statistical methods, and general programming."
  ],
  "qualifications": [
    "Bachelor’s degree or equivalent practical experience.",
    "5 years of experience in an applied research setting, or similar.",
    "Product research experience in an applied research setting.",
    "Master's or PhD degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field (preferred).",
    "5 years of experience conducting UX research on products and working with executive leadership (e.g., Director level and above) (preferred).",
    "3 years of experience managing projects, and working in a large, matrixed organization (preferred)."
  ]
}