{
  "responsibilities": [
    "Design and optimize efficient data models, databases, and dashboards.",
    "Maintain data structure, ensuring accuracy and accessibility.",
    "Identify relevant data sources and support BI reporting and analytics.",
    "Build and maintain data infrastructure for data-driven activities.",
    "Develop systems to collect, store, and process large volumes of data.",
    "Collaborate with technology and development teams to define data standards.",
    "Work collaboratively with academic and administrative units to define, design, develop, implement, analyze, and communicate key institutional metrics.",
    "Streamline data collection and reporting processes across departments.",
    "Support learning analytics by ensuring timely and accessible data on student engagement and performance.",
    "Provide integrated data for informed decision-making on programs, enrollment, and policies.",
    "Ensure scalable data infrastructure to handle increased data volumes.",
    "Prioritize and drive technical deliverables across data warehousing efforts.",
    "Develop and maintain dashboards with KPIs for college leadership.",
    "Write SQL for data extraction and transformation from college systems.",
    "Align institutional measurements with accreditation processes and strategic initiatives.",
    "Develop BI and data visualizations for various projects and requests.",
    "Represent the department on college-wide committees.",
    "Act as a technical liaison between Institutional Research and IT departments.",
    "Mentor team members and advise on BI tooling.",
    "Conduct regular data audits to ensure data integrity and compliance.",
    "Develop and implement data governance policies and procedures.",
    "Train staff in data management best practices and BI tools.",
    "Collaborate with external partners and vendors to integrate new data sources and technologies.",
    "Monitor and optimize the performance of data systems and applications.",
    "Provide technical support and troubleshooting for data-related issues.",
    "Stay updated with the latest trends and advancements in data analytics and BI technologies.",
    "Supervise student interns and research associates, when applicable."
  ],
  "skills": [
    "Proficiency in programming languages like Python, Java, or R.",
    "Expertise in SQL and NoSQL databases (e.g., MSSQL, MySQL, PostgreSQL, MongoDB).",
    "Experience with ETL tools like Apache Airflow, Talend, or Informatica.",
    "Familiarity with big data technologies like Hadoop, Spark, and Kafka.",
    "Expertise in cloud platforms like AWS, Azure, or Google Cloud.",
    "Experience with data warehousing solutions like Snowflake, Redshift.",
    "Skills in creating efficient data models.",
    "Proficiency in BI tools like Microsoft Power BI, Tableau.",
    "Ability to create data visualizations using industry tools.",
    "Knowledge of shell scripting and automation tools.",
    "Experience with version control systems like Git.",
    "Understanding of RESTful APIs and data integration.",
    "Ability to read database schemas and use DML functions.",
    "Ability to write SQL views and stored procedures.",
    "Ability to collaborate effectively with a wide range of constituents.",
    "Ability to contribute to team efforts in research and qualitative/quantitative analyses.",
    "Ability to develop reporting solutions that are automated and sustainable."
  ],
  "qualifications": [
    "Bachelor’s degree in computer information systems, IT, Engineering, or related field preferred.",
    "Master’s Degree in related field preferred.",
    "Four years of related experience or equivalent education and experience.",
    "Experience with Data Governance & Security, including compliance with FERPA, HIPAA, and other regulations.",
    "Experience in business intelligence (BI) and ability to create data visualizations and reports.",
    "Proficient with Microsoft Office suite.",
    "Education and career experiences in research theory, principles, and methods of statistical analysis.",
    "Bilingual (English/Spanish) or conversational language abilities preferred.",
    "Commitment to working effectively with students, employees, and community members of all backgrounds."
  ]
}