{
  "responsibilities": [
    "Act as a trusted advisor and coach to leaders in Research and Trust & Safety, including the Chief Science Officer and Head of Trust and Safety.",
    "Provide support to employees and managers on all human resource-related topics throughout their lifecycle at Anthropic in partnership with other People team experts.",
    "Work closely with management to create a culture of high performance based on company values and team culture.",
    "Ensure that performance management and employee relations issues are managed appropriately.",
    "Act as a partner and liaison with specialist teams, leadership, and finance to implement top-tier, scalable programs and policies to attract, retain, and grow outstanding talent.",
    "Work on cross-functional projects with other HRBPs and partners in specialist teams to enable and grow the workforce."
  ],
  "skills": [
    "Ability to provide confidential, practical support and training in topics like conflict resolution.",
    "Strong working knowledge of human-resource-related best practices.",
    "Ability to implement HR practices in a culturally appropriate fashion.",
    "Pragmatic problem-solving skills and ability to develop creative solutions.",
    "Ability to build and scale processes and set up new systems in a growing company.",
    "Strong communication skills and ability to collaborate effectively."
  ],
  "qualifications": [
    "Minimum of 6-10 years experience in HRBP, People Operations, Employee Relations, Recruiting, or related functions.",
    "Experience operating at a fast-growing tech company in HR.",
    "Fluency with employment law and best practices in North America.",
    "Experience working at a tech company, start-up, or similarly fast-paced environment.",
    "Experience working with AI-focused Research and Engineering teams (preferred).",
    "Deep care for supporting a diverse set of people at all levels of an organization.",
    "Curiosity about artificial intelligence and its potential applications."
  ]
}