{
  "responsibilities": [
    "Participate in the decision-making process during the design and development of applications.",
    "Specialize in importing data from hospital applications into UHN DHP.",
    "Deliver aggregate data to help clinicians and scientists streamline clinical workflows and research.",
    "Build and run SQL queries for efficiently pulling data from hospital database systems.",
    "Set up database views for projects that require access to regularly updated data.",
    "Liaise across various UHN stakeholders to ensure projects follow UHN policies and meet all specifications.",
    "Collaborate with internal/external resources to acquire data from Epic Clarity & Caboodle.",
    "Build or modify Epic Clarity & Caboodle database views for projects.",
    "Build or modify database queries to pull data from non-Epic databases and NoSQL MongoDB.",
    "Identify and troubleshoot data quality issues.",
    "Act as a primary support contact for Epic reporting needs.",
    "Review peer reports for validity, accuracy, and completeness.",
    "Identify, communicate, and resolve risks related to Epic Cogito data extract activities and initiatives."
  ],
  "skills": [
    "Advanced knowledge of databases.",
    "Excellent communication and interpersonal skills.",
    "Background in data & analytics within a hospital environment.",
    "Ability to lead requirements gathering sessions and document user requirements.",
    "Ability to analyze data, problem-solve, and clearly communicate solutions to both technical and non-technical stakeholders.",
    "Ability to effectively work both independently and in a team-oriented environment.",
    "Strong project management skills.",
    "Experience working in a fast-paced, dynamic environment.",
    "Python/pandas experience for data processing/cleaning."
  ],
  "qualifications": [
    "Certification in Cogito Fundamentals, Clarity Data Model, Caboodle Data Model, Clinical Data Model certifications is strongly preferred.",
    "If not already certified, then certification must be completed during the probationary period.",
    "Familiarity with database technology such as Microsoft SQL Server and Oracle DB.",
    "Advanced knowledge of building and optimizing SQL queries.",
    "Intermediate knowledge of NoSQL MongoDB databases is strongly preferred.",
    "Experience in data & analytics within a healthcare environment strongly preferred.",
    "Knowledge of healthcare data sources and standards is preferred."
  ]
}