{
  "responsibilities": [
    "Build/integrate new machine learning models into production using the necessary tools to monitor/administer them",
    "Collaborate with cross-functional teams to set and align on machine learning platform strategies to meet company objectives",
    "Deliver best-in-class technical approach and problem analysis documents",
    "Impact key company objectives by working closely with Product to refine our roadmap",
    "Build/maintain reports, dashboards, and metrics to monitor the performance of our products",
    "Mentor junior team members helping them to grow their skills and expertise",
    "Drive key architectural decisions and contribute to our ML platform architecture and strategy",
    "Act as a data evangelist to create a data-driven culture across the company and provide mentorship/feedback to analysts and other data-minded stakeholders"
  ],
  "skills": [
    "Advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, or similar) and experience with applications",
    "Deep understanding of machine learning techniques (clustering, decision tree learning, artificial neural networks, or similar) and their real-world advantages/drawbacks",
    "Strong communication and presentation skills",
    "Expert level fluency using languages like Python & SQL to manipulate data and draw insights from large data sets",
    "Working knowledge of common web/mobile architectures, data pipelines, CI/CD processes, etc.",
    "Strong understanding of DBT or other similar data transformation/organization methodologies",
    "Strong understanding of the dynamics around two-sided marketplaces and/or other complex business models, with an emphasis on product acumen",
    "Experience with BI tools (e.g. Mode, Tableau, Looker)"
  ],
  "qualifications": [
    "BA/BS in Math, Statistics, Physics, Computer Science, or other quantitative fields",
    "Advanced degrees preferred but not required, e.g. PhD or Masters of Physics, CS, Stats, etc.",
    "At least 10 years experience doing quantitative analysis, modeling and pushing ML into production"
  ]
}