{
  "responsibilities": [
    "Partner with a cross-functional team of data scientists, software engineers, machine learning engineers, and product managers to deliver AI-powered products.",
    "Leverage a broad stack of technologies to reveal insights from large volumes of numeric and textual data.",
    "Build AI foundation models through all phases of development, including design, training, evaluation, validation, and implementation.",
    "Engage in high impact applied research to advance AI developments for customer experiences.",
    "Translate complex work into tangible business goals using interpersonal skills."
  ],
  "skills": [
    "Ability to analyze and create innovative solutions.",
    "Research and evaluate emerging technologies.",
    "Creative problem-solving and idea generation.",
    "Leadership and talent development.",
    "Proficiency with open-source languages and cloud computing platforms.",
    "Experience in developing AI foundation models and solutions.",
    "Deep understanding of AI methodologies.",
    "Experience with large deep learning models and training optimization.",
    "Engineering mindset for delivering models at scale.",
    "Ability to own and pursue a research agenda."
  ],
  "qualifications": [
    "PhD or in the process of obtaining a PhD with at least 2 years of experience in Applied Research, or M.S. with at least 4 years of experience in Applied Research.",
    "PhD in Computer Science, Machine Learning, Computer Engineering, Applied Mathematics, Electrical Engineering, or related fields.",
    "PhD focus on NLP or Masters with 5 years of industrial NLP research experience.",
    "Multiple publications on topics related to pre-training of large language models.",
    "Experience with large scale deep learning based recommender systems.",
    "Contributions to common open source frameworks.",
    "Experience with production real-time and streaming environments.",
    "Worked on scaling graph models to greater than 50m nodes.",
    "Experience with datasets with 100m+ users."
  ]
}