{
  "responsibilities": [
    "Work with internal teams to understand user requirements.",
    "Create data center electrical designs and collaborate with other disciplines to create a construction document set.",
    "Ensure designs meet or exceed quality requirements and fall within budgetary requirements.",
    "Specify appropriate electrical equipment with regional vendors and manufacturers.",
    "Define site utility requirements in collaboration with local utilities.",
    "Ensure compliance with federal, state, and municipal requirements and building codes by working with local agencies.",
    "Review and approve equipment submittals.",
    "Define project scope and provide technical support for information requests prior to and during construction phases.",
    "Work with commissioning teams to test and validate installation, operation, and performance of electrical systems.",
    "Manage concurrent projects in multiple geographical regions.",
    "Travel to sites for site review and work with onsite field engineers, as well as provide engineering evaluations, electrical systems audits, and startup as needed.",
    "Offer creative, out-of-the-box solutions."
  ],
  "skills": [
    "Hands-on electrical design experience.",
    "Understanding of critical equipment needs for a data center.",
    "Knowledge of constructability of varying designs.",
    "Ability to define critical equipment specifications and approve equipment submittals.",
    "Capability to work on concurrent projects in multiple geographical regions.",
    "Excellent communication skills.",
    "Attention to detail and ability to maintain high quality standards.",
    "Ability to think outside of the box to find creative and innovative solutions."
  ],
  "qualifications": [
    "Bachelor’s degree in electrical engineering, or 8+ years of relevant electrical experience.",
    "Cumulative 3+ years of experience with industrial or commercial electrical design.",
    "US Citizenship.",
    "Experience with fast track design/build projects and/or multiple significant upgrade projects (preferred).",
    "Basic understanding of mechanical equipment and system design (preferred).",
    "Direct experience with the construction, operation, or maintenance of data centers (preferred)."
  ]
}