{
  "responsibilities": [
    "Work with the Shopping Assistant team to build, optimize, and scale new & existing GenAI product features.",
    "Continuously research and implement new AI technologies and methodologies to improve system functionality and efficiency.",
    "Collaborate with cross-functional teams in product engineering to develop AI solutions that enhance user experience.",
    "Conduct regular system tests and troubleshoot issues to ensure smooth and effective prompt system operation.",
    "Work closely with Software Engineers and Test Engineers to implement and optimize AI models based on information architecture and member experience requirements.",
    "Collaborate with Member Success, Data Science, Legal, AI Safety, and GenAI platform teams on AI evaluation standards and practices.",
    "Document all processes, designs, and updates related to the prompt system for future reference and development.",
    "Provide guidance and support to team members, fostering an environment of learning and continuous improvement.",
    "Contribute to the design and evolution of prompt architectures to enhance system efficiency, responsiveness, and adaptability.",
    "Ensure all AI systems comply with data privacy regulations and company policies.",
    "Participate in regular team meetings, providing updates on progress and collaborating on future developments.",
    "Stay up-to-date with industry trends and advancements in AI technology, applying this knowledge to the ongoing development of the prompt system."
  ],
  "skills": [
    "Strong analytical and critical thinking skills for evaluating prompt strategies and making data-driven decisions.",
    "Excellent problem-solving skills for troubleshooting complex issues.",
    "Experience working in cross-functional teams and collaborating effectively with different stakeholders.",
    "Progress mindset with iterative working and optimizing for desired member experience through feedback loops.",
    "Proactive approach to work, driving innovation and improvements in processes and systems.",
    "Excellent communication skills, with the ability to synthesize and communicate ideas visually, verbally, and in writing.",
    "Ability to convey complex prompt strategies to diverse stakeholders.",
    "Adaptability and willingness to learn and grow in a rapidly evolving field.",
    "Comfort in distinguishing knowns from unknowns."
  ],
  "qualifications": [
    "Minimum of 5 years of experience in the tech industry in high-impact roles such as Product, Engineering, or Research.",
    "Experience in prompt design and Prompt Engineering.",
    "Familiarity with conversational AI, NLP, and machine learning frameworks (such as NLUs, RAG databases, TensorFlow, PyTorch, or similar).",
    "Experience in designing prompts for GenAI interactions and/or direct experience with Prompt Engineering in AI Information Architecture for high-impact, complex features.",
    "Demonstrated experience working with GenAI and understanding of architecture, design, and functionality.",
    "Technological skills to incorporate prompts and other relevant data into automated runs or product code for quick validation and collaboration.",
    "Advanced knowledge of AI and machine learning algorithms and their application in Fintech.",
    "Strong project management skills, with the ability to lead projects from conception to completion.",
    "Track record of success working with cloud-based technologies and leading projects involving distributed systems.",
    "Experience in mentoring or leading teams, fostering an environment of learning and continuous improvement."
  ]
}