{
  "responsibilities": [
    "Develop SQL queries / ETL packages using T-SQL and SSIS to ingest data from source systems to integrate with SQL Server data warehouse.",
    "Design and develop physical data model structures in SQL Server.",
    "Design and develop high-quality dashboards / reports using tools like Power BI, SSRS, Crystal Report, Excel/PowerPivot, and Tableau.",
    "Build and maintain proper documentation, data lineage, and extract-transform-load (ETL) processes.",
    "Collect business requirements / user stories while working in a lab with a product owner, Business Analyst, Scrum Master, and application developers.",
    "Develop SQL views to enable data consumers to read data from data warehouse.",
    "Document databases, data process flows, and maintain data dictionaries, support, and onboarding procedures.",
    "Troubleshoot and resolve database and application defects in a timely manner with consultation with internal and external groups as needed.",
    "Train and assist users at all levels.",
    "Analyze root causes of operational malfunctions including but not limited to batch jobs and provide resolutions.",
    "Analyze highly complex business requirements; generate technical specifications to design or redesign complex software components and applications.",
    "Act as an expert technical resource in Data Warehouse/DBs and ETL.",
    "Leverage industry best practices to design, test, implement, and support a solution.",
    "Assure quality, security, and compliance requirements are met for supported area.",
    "Be flexible and thrive in an evolving environment.",
    "Adapt to change quickly and adjust work accordingly in a positive manner.",
    "On-call responsibilities to operate as the L2 point of contact for monitoring TIDAL/EDL jobs requests may be required for weekends rotation."
  ],
  "skills": [
    "Experience with databases such as Microsoft BI stack SQL Server, T-SQL, SSRS, MS SQL Enterprise Manager, MySQL, Crystal Report, Tidal jobs.",
    "Experience working in an agile development team engaged in the SDLC process and SDLC methodologies (agile / waterfall).",
    "Experience with EDL / Hadoop / Hive / Tableau.",
    "Hands-on programming experience and advanced knowledge of SQL.",
    "Expertise with data visualization / BI tools like Power BI.",
    "Clear communication and interpersonal skills.",
    "Familiarity with JIRA/SharePoint.",
    "Attention to detail and ability to rapidly complete feedback from clients on dashboards and reports.",
    "Experience developing code to consume REST API services and integrating systems with sftp.",
    "Experience with MS Azure / SQL Server MI / Machine Learning services.",
    "Experience with databases, dimensional data modeling design.",
    "Experience with data warehouse, ETL, SSIS, SSAS/cubes.",
    "Experience with implementing DevOps / CIAD.",
    "Experience with web development (in ASP.NET MVC / C#)."
  ],
  "qualifications": [
    "3-5 years previous experience working within a technically focused environment as a database analyst / data developer."
  ]
}