{
  "responsibilities": [
    "Initiate, lead, and perform independent and impactful analyses on the local and regional economic and employment impacts of future policies and market actions in scenarios achieving carbon neutrality nationally and globally.",
    "Deliver innovative solutions to sponsors.",
    "Craft successful proposals and scientific presentations and publications.",
    "Engage regularly with the academic and practitioner communities.",
    "Develop and implement a cohesive research strategy to ensure the success of new and ongoing research projects.",
    "Deliver ORNL’s mission by aligning behaviors, priorities, and interactions with core values of Impact, Integrity, Teamwork, Safety, and Service.",
    "Promote diversity, equity, inclusion, and accessibility by fostering a respectful workplace."
  ],
  "skills": [
    "Strong written and oral communication skills.",
    "Excellent interpersonal skills with a demonstrated leadership ability.",
    "Strong computer programming skills (e.g., R, Python, GAMS, MATLAB, etc.).",
    "Familiarity with leading economic and employment models and datasets (e.g., IMPLAN, WiNDC, WIRED/JEDI, EMPLOY, SLiDE, JOBS).",
    "Ability to function well in a fast-paced research environment.",
    "Ability to set priorities to accomplish multiple tasks within deadlines.",
    "Ability to adapt to ever-changing needs."
  ],
  "qualifications": [
    "Ph.D. degree in economics, agricultural or natural resource economics, or a related discipline.",
    "Experience in the development and/or use of quantitative models to estimate economic and social impacts of future policies, regulations, and productive investments.",
    "Experience working for or collaborating with DOE National Laboratories (or similar R&D organizations), universities, consultancies, and industry stakeholders.",
    "Motivated self-starter with the ability to work independently and to participate creatively in collaborative teams across the laboratory and university environments."
  ]
}