{
  "responsibilities": [
    "Collaborate with project team members to ensure development and implementation of new data-driven business solutions.",
    "Drive development effort End-to-End for on-time delivery of high-quality solutions that conform to requirements, architectural vision, and applicable standards.",
    "Collaborate with senior technical staff and PM to identify, document, plan contingency, track and manage risks and issues until all are resolved.",
    "Present technical solutions, capabilities, considerations, and features in business terms.",
    "Effectively communicate status, issues, and risks in a precise and timely manner.",
    "Coach and mentor junior team members and evolve team talent pipeline."
  ],
  "skills": [
    "Strong development background with expertise in public cloud and AI/ML production systems.",
    "Hands-on technical knowledge and leadership skills.",
    "Knowledgeable about cloud technologies, business drivers, and emerging AI/ML trends.",
    "Experience with AWS and GCP services.",
    "Strong interpersonal skills and excellent written and verbal communication.",
    "Ability to manage complex projects and deadlines.",
    "Problem-solving mindset and hands-on approach.",
    "Expertise with IaC solutions (Terraform, CloudFormation etc.).",
    "Expertise in one or more of Golang, Java, Rust, and C/C++.",
    "Expertise in cloud architecture and service offerings.",
    "Expertise in various cloud services such as compute, storage, databases, networking, AI, and machine learning.",
    "Experience in Cloud Big Data Services.",
    "Experience in Cloud AI/ML solutions and tools such as AWS Sagemaker, Comprehend, GCP AutoML, AWS EKS, ElasticCache, CloudWatch.",
    "Strong cloud security and best practices for cloud infrastructure management."
  ],
  "qualifications": [
    "8 or more years of relevant work experience with a Bachelor Degree or at least 5 years of experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 2 years of work experience with a PhD.",
    "9 or more years of relevant work experience with a Bachelor Degree or 7 or more relevant years of experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 or more years of experience with a PhD.",
    "4+ years of related hands-on experience in delivering robust and scalable solutions on public cloud platforms such as AWS, Google Cloud Platform, and Microsoft Azure, preferably in an AI/ML production environment.",
    "5+ years of related experience with AWS, GCP, or Azure, preferably in an AI/ML production environment."
  ]
}