{
  "responsibilities": [
    "Deliver high-quality, human annotated, machine learning data at scale for product teams across Apple.",
    "Develop and maintain iOS applications, web applications, cloud-based services, and large-scale data pipelines.",
    "Create automated workflows, services, APIs, and user-interfaces for diverse stakeholders.",
    "Provide insights into key metrics to augment user experiences.",
    "Ensure services are robust, predictable, scalable, monitored, efficient, and highly-available.",
    "Collaborate with designers, product managers, and software engineers to meet customer needs."
  ],
  "skills": [
    "Expertise in Swift and iOS development.",
    "Experience building front-end applications, web services, or large-scale data pipelines.",
    "Proficiency in modern compiled object-oriented languages such as Swift, Objective-C, Go, C++, or Java.",
    "Experience with automated unit, integration, and acceptance tests.",
    "Familiarity with continuous integration systems.",
    "Experience with modern programming languages like Python or Javascript.",
    "Ability to build highly usable user interfaces using modern Javascript frameworks (e.g., React, Angular).",
    "Experience working in Unix environments (e.g., Darwin, Linux, BSD).",
    "Knowledge of commercial cloud services (e.g., AWS, Google Cloud, Microsoft Azure).",
    "Strong SQL skills and experience with databases.",
    "Excellent collaboration and communication skills with a focus on user experience."
  ],
  "qualifications": [
    "Bachelor's degree or greater in Computer Science or equivalent experience.",
    "Experience leading and delivering complex projects with cross-functional technical and business collaborators.",
    "Experience mentoring other software engineers.",
    "Interest in building and maintaining Swift applications on various Apple operating systems.",
    "Familiarity with Agile software development processes (e.g., Scrum, Extreme Programming).",
    "Experience with distributed systems (e.g., distributed compute using Spark or Hadoop).",
    "Experience with more than one programming language."
  ]
}