{
  "responsibilities": [
    "Assist in experiments for research projects under supervision of the project lead or the PI.",
    "Analyze and accurately record scripts, codes, and results.",
    "Maintain databases used in the lab.",
    "Order necessary reagents and other lab supplies to conduct experiments.",
    "Participate in joint upkeep of the lab.",
    "Participate in the determination of appropriate procedures for experiments.",
    "Learn basic concepts in bioinformatics, statistics, genomics, and computational biology.",
    "Assist in small animal procedures and a wide range of lab techniques such as Western blot analysis, qPCR, immunohistochemistry.",
    "Modify techniques as necessary to meet research and/or experimental needs.",
    "Synthesize and interpret information obtained from graphs, charts, laboratory experiments, statistical summaries, and other data collection methods.",
    "Prepare written reports on the status of each research project, analyze and interpret data, and draw conclusions.",
    "Collaborate with the Principal Investigator in writing and editing abstracts and manuscripts for publication.",
    "Operate and maintain moderate to complex lab equipment.",
    "Participate in the upkeep of the lab, including cleaning glass and plastic ware and performing autoclaving.",
    "Perform or refer routine maintenance of lab equipment and report equipment malfunctions.",
    "Work safely within the lab environment and wear personal protective equipment as required.",
    "Attend and potentially make presentations at lab meetings and journal clubs."
  ],
  "skills": [
    "Understanding of basic scientific laboratory techniques and terminology.",
    "General laboratory skills as attained during education.",
    "Proficiency in R, Python, or familiarity with computational biology.",
    "Self-motivation and ability to work independently after training.",
    "Ability to work carefully, accurately, and consistently with instruction or protocol.",
    "Ability to work safely and properly use protective equipment.",
    "Excellent verbal and written communication skills.",
    "Proficiency in Word, PowerPoint, Excel, and Internet searches.",
    "Knowledgeable and compliant in all hospital, State, and Federal regulatory requirements."
  ],
  "qualifications": [
    "Bachelor's degree in biological or physical sciences."
  ]
}