{
  "responsibilities": [
    "Maintain the automated testing suite for governed reference data required to support applications and systems.",
    "Drive the automated tests and care for the binding/glue code, shaping the direction and quality of tests.",
    "Design, develop, and maintain complex automation and custom test frameworks.",
    "Participate in the design and development of systems with a focus on quality and testability.",
    "Provide automation test strategies and tools for technologies and systems.",
    "Aid the development team as needed."
  ],
  "skills": [
    "Proficiency with the system development lifecycle, including agile techniques and other methodologies.",
    "Adept at scripting in one or more languages.",
    "Developing proficiency at working with databases, web application frameworks, and common line interfaces.",
    "Demonstrated ability with Object-oriented design and coding skills (Java).",
    "Ability to design and develop test automation frameworks from scratch.",
    "Effective at navigating ambiguity.",
    "Excellent time management and organization skills.",
    "Outstanding verbal and written communication.",
    "Ability to recognize and mitigate risks.",
    "Focus on Customer Centricity."
  ],
  "qualifications": [
    "1+ year experience with Object-oriented programming.",
    "1+ year experience in a technical Quality Assurance role.",
    "Proven interpersonal skills and the ability to communicate effectively.",
    "Bachelor's degree in Computer Science, Computer Engineering, or equivalent job-related experience.",
    "Proficient in driving technical and process improvements (desired).",
    "Working knowledge of Java application development and Windows/UNIX/Linux systems (desired).",
    "Working knowledge of common industry testing tools (Selenium/Webdriver, IntelliJ, Cucumber, Jmeter, SoapUI) (desired).",
    "Understanding of the transportation/global logistics industry (desired).",
    "Applicants must be eligible to lawfully work in the U.S. immediately; employer will not transfer or sponsor applicants for U.S. work authorization."
  ]
}