{
  "responsibilities": [
    "Plan, design, maintain, and execute test cases with minimal direction based on specification documents and access to databases.",
    "Stand up and execute a wide breadth of tests with scripts and tools.",
    "Report bugs with impeccable isolation and regression techniques.",
    "Manage priorities and communicate progress and risk effectively and systematically.",
    "Coordinate cross-functional test efforts with other team members.",
    "Engage in continual dialogue with Engineering and Design as products evolve.",
    "Advocate effectively on behalf of users.",
    "Streamline processes for data collection and systematically parse large data sets.",
    "Ensure the successful delivery of a quality product by performing ad-hoc and structured tests."
  ],
  "skills": [
    "Proficient in one or more compiled languages: e.g. Swift, Objective-C, Java, C++.",
    "Proficient in one or more scripting languages (system automations / web development): e.g. Python, Go, Scala, JavaScript, Bash.",
    "Experience with test frameworks such as JUnit, XCTest, XCUI.",
    "Familiar with SDLC practices (Agile vs. Waterfall, SCM, issue tracking).",
    "Strong problem-solving skills and ability to identify opportunities for technical improvement.",
    "Comfortable with *nix commands and shell scripting environments.",
    "Excellent communication skills to collaborate across teams."
  ],
  "qualifications": [
    "A minimum of 2 years of industry experience performing tools and automation engineering.",
    "Bachelor’s degree required in computer science, engineering, or a similar academic field.",
    "Computer Science fundamentals (object-oriented design, data structures, algorithm design, and complexity analysis).",
    "Experience bringing a software project from technical spec to production (preferred).",
    "Experience with DevOps (CI, CD, automation strategies, etc.) (preferred).",
    "Data Science and ML expertise (preferred).",
    "Background in mental and physical health-related fields (preferred)."
  ]
}