{
  "responsibilities": [
    "Collaborate with cross-functional teams to craft requirements that align with safety, regulatory, and product needs.",
    "Gather and analyze critical data to define metrics, qualify systems for release, and influence system design decisions based on evidence-based insights.",
    "Create and maintain clear, precise documentation to support system designs, decisions, and processes while ensuring alignment across teams.",
    "Drive strategic alignment and lead discussions around system design trade-offs, ensuring buy-in from stakeholders and fostering a collaborative team culture."
  ],
  "skills": [
    "Strong skills in creating clear and concise technical documentation and effectively presenting complex ideas to diverse audiences.",
    "Proficiency with tools like Python, MATLAB, or similar for data analysis.",
    "Familiarity with systems modeling tools or methodologies (e.g., SysML) is a plus."
  ],
  "qualifications": [
    "Bachelor’s or Master’s degree in a relevant engineering or related field (e.g., Software Engineering, Mechanical Engineering, Electrical Engineering, Computer Science, Robotics, Controls, Aerospace, etc.).",
    "Demonstrated ability to tackle technical challenges, analyze cross-disciplinary problems, and propose innovative, maintainable solutions.",
    "Experience with data collection, statistical analysis, and developing metrics to support system evaluation or improvement.",
    "Proven ability to contribute to or lead cross-functional initiatives, driving alignment and ensuring stakeholder engagement throughout the development process.",
    "Experience with large-scale system architecture, including integrating hardware and software systems in a regulated or safety-critical environment.",
    "Familiarity with leveraging machine learning models for system optimization or predictive analytics.",
    "Experience leading cross-team initiatives, including coordinating with external vendors or partners to deliver high-impact solutions."
  ]
}