{
  "responsibilities": [
    "Work across all phases of the software development lifecycle (SDLC) for the design, development, testing, implementation, deployment, and maintenance of enterprise-scale data engineering and data platform solutions.",
    "Build large-scale distributed systems and develop critical services in the data pipeline to empower users to deliver better content on the platform.",
    "Design and build data transformations efficiently and reliably for reporting, growth analysis, and multi-dimensional analysis.",
    "Design and implement reliable, scalable, robust, and extensible big data systems that support core products and business.",
    "Upgrade old and outdated systems to new systems with higher performance improvements.",
    "Help customers resolve any issues they encounter during usage.",
    "Participate in designing micro-services to provide higher flexibility of the system.",
    "Establish solid design and best engineering practices for engineers and non-technical audiences.",
    "Mentor junior engineers and interns."
  ],
  "skills": [
    "Proficiency in software development lifecycle (SDLC) processes.",
    "Expertise in building large-scale distributed systems.",
    "Ability to develop critical services in data pipelines.",
    "Skills in designing and building data transformations for analysis.",
    "Experience in designing and implementing big data systems.",
    "Problem-solving skills for upgrading systems and resolving customer issues.",
    "Knowledge of micro-services design.",
    "Ability to establish design and engineering best practices.",
    "Mentoring and leadership skills."
  ],
  "qualifications": [
    "Experience in enterprise-scale data engineering and data platform solutions.",
    "Proven track record in building and maintaining distributed systems.",
    "Strong background in big data systems and data transformations.",
    "Experience in system upgrades and performance improvements.",
    "Ability to work collaboratively in a fast-paced environment.",
    "Experience in mentoring junior engineers and interns."
  ]
}