{
  "responsibilities": [
    "Build distributed data processing solutions and highly loaded database solutions for various business cases.",
    "Contribute as part of a self-organized team of experienced data engineers.",
    "Investigate, create, and implement solutions for existing technical challenges.",
    "Provide guidance, instruction, direction, and leadership to a development team.",
    "Develop functional and design specifications and get approval from collaborators.",
    "Ensure assigned areas are delivered within set timelines and quality objectives.",
    "Provide estimations, agree on task duration with the manager, and contribute to the project plan.",
    "Analyze scope of alternative solutions and make decisions based on experience and technical expertise.",
    "Lead functional and architectural design of assigned areas.",
    "Address area-level risks and implement mitigation plans.",
    "Report on area readiness/quality and raise red flags in crisis situations.",
    "Resolve crisis situations within their area of responsibility.",
    "Initiate and conduct code reviews, build code standards, conventions, and guidelines.",
    "Suggest technical and functional improvements to contribute to the product."
  ],
  "skills": [
    "Proficiency in Python programming with strong SQL skills (Data modeling and Data designing).",
    "Expertise in Database fundamentals, SQL, and distributed computing.",
    "Advanced proficiency in Complex SQL and ability to write and optimize SQL queries for Snowflake or Delta tables.",
    "Proven experience in ETL orchestration and workflow management tool Airflow.",
    "Excellent interpersonal skills.",
    "Experience in Apache Airflow, Data Pipeline (SQL/SparkSQL), and Spark (Good to have).",
    "Experience with Distributed data/similar ecosystem (Spark, Hive, Presto) and/or streaming technologies such as Kafka/Flink (Good to have)."
  ],
  "qualifications": [
    "Minimum 5 years' working experience in relevant fields.",
    "Valid work authorization in Canada without requiring future sponsorship of a visa."
  ]
}