{
  "responsibilities": [
    "Work closely with engineering teams to design and develop data structures that enable deeper analysis.",
    "Demonstrate expertise in the analytics engineering development cycle, including data modeling, version control, documentation, testing, and ensuring codebase best practices.",
    "Build visually compelling, high-performance reporting and dashboards using tools like Tableau to provide valuable insights from large datasets.",
    "Create and optimize data models and schemas to support self-serve analytics and ensure data integrity.",
    "Collaborate with business stakeholders to influence data-driven decision-making, proactively uncovering meaningful patterns and insights."
  ],
  "skills": [
    "Expertise in data modeling, version control, documentation, and testing.",
    "Ability to build high-performance reporting and dashboards using tools like Tableau.",
    "Proficiency in creating and optimizing data models and schemas.",
    "Strong collaboration skills with business stakeholders to influence data-driven decision-making.",
    "Proficiency in Python or a similar scripting language for data processing and analysis.",
    "Strong expertise in SQL, including experience with data modeling and adherence to database design best practices."
  ],
  "qualifications": [
    "4+ years of professional experience in data science, analytics, and/or data engineering.",
    "Strong understanding of data architecture, including building scalable pipelines and optimizing storage solutions for analytical workflows (e.g., S3, Redshift).",
    "Strong understanding of data engineering principles, including ETL / ELT processes.",
    "Hands-on experience with data orchestration tools (e.g., Airflow) and data modeling frameworks (e.g., dbt).",
    "Proven ability to create impactful reports and dashboards using business intelligence tools such as Tableau and Looker.",
    "Experience in a fast-paced, constantly improving, start-up environment that focuses on solving problems with iterative technical solutions."
  ]
}