{
  "responsibilities": [
    "Develop, optimize, and maintain robust data models in dbt to support Accounting and Finance processes.",
    "Build and automate data pipelines for reconciliation and reporting between systems like NetSuite, Shopify, Stripe, Avalara, and Snowflake.",
    "Partner with Accounting and Finance teams to validate and reconcile data, including orders, invoices, refunds, disputes, and item fulfillment data.",
    "Implement and maintain data quality testing frameworks to ensure the integrity and reliability of financial data.",
    "Collaborate with Data Engineering to improve data ingestion and warehouse optimization.",
    "Document processes, prioritize data governance, and support stakeholders in using self-service tools like Sigma for financial reporting and analysis.",
    "Provide technical guidance and support for Finance-related projects, including data integration, reporting automation, and strategic financial analysis.",
    "Apply software engineering best practices to analytics code, including version control, testing, and continuous integration."
  ],
  "skills": [
    "Advanced expertise in SQL and ETL optimization techniques.",
    "Hands-on experience with data modeling and schema design for financial reporting.",
    "Familiarity with accounting and finance concepts, such as revenue recognition and cost allocation.",
    "Experience with ERP systems like NetSuite and financial platforms such as Shopify, Stripe, and Avalara.",
    "Excellent attention to detail.",
    "Ability to partner effectively with Accounting, Finance, and other cross-functional teams."
  ],
  "qualifications": [
    "2-4 years of experience in analytics engineering, data engineering, business intelligence, or a similar technical role with a focus on financial data.",
    "Advanced expertise in SQL and ETL optimization techniques, particularly within Snowflake or comparable data warehouses.",
    "Hands-on experience with data modeling and schema design for financial reporting.",
    "Familiarity with accounting and finance concepts, such as revenue recognition and cost allocation.",
    "Experience with ERP systems such as NetSuite and financial platforms like Shopify, Stripe, and Avalara.",
    "Willingness to relocate to Boston, MA, if necessary, to work out of the WHOOP office."
  ]
}