{
  "responsibilities": [
    "Demonstrate expertise in SQL as part of the Data and Analytics squad.",
    "Design, develop, and enhance data and analytics solutions and pipelines.",
    "Collaborate with scrum masters, product owners, and engineering teams to create data and analytics solutions.",
    "Work closely with the development team in building innovative, cloud-native solutions using SQL, AWS, Snowflake, Python, Rest API, etc.",
    "Continuously enhance the full delivery pipeline through automation and efficient test coverage.",
    "Optimize and fine-tune existing data pipelines for performance, scalability, and reliability.",
    "Implement data quality checks and monitoring processes to ensure data accuracy and consistency.",
    "Stay current with industry trends and best practices in data engineering.",
    "Mentor junior engineers in the team and participate in technical documentation and code reviews."
  ],
  "skills": [
    "Proficient in SQL and hands-on experience with Python.",
    "Experience with data modeling and data warehousing.",
    "Experience with public cloud data platforms: Snowflake, AWS, Azure.",
    "Proficiency with AWS Services including AWS S3, AWS Glue, AWS Lambda, AWS EC2.",
    "Proficient with ETL/ELT data pipelines and patterns for loading Data Warehouses, Lakes.",
    "Experience with build/deploy automation & DevOps frameworks (CI/CD, Bamboo, GitHub Actions, pipeline-as-code).",
    "A design thinking and test-driven development mindset.",
    "Experience with business intelligence tools and reporting solutions (Power BI, Tableau, etc.)."
  ],
  "qualifications": [
    "A bachelor’s degree in a technical or business discipline, or equivalent experience.",
    "5+ years of related data engineering experience with a focus on designing and building data pipelines.",
    "Previous experience in Investments / Asset Management, Finance Data modeling is highly desirable.",
    "Familiarity in building and consuming APIs (REST, API Gateway, etc.).",
    "Cognizance of security concerns, from access control and authentication to secured processes.",
    "Knowledge of containerization and orchestration tools (e.g., Docker, Kubernetes).",
    "A comprehensive understanding of agile environments and the ability to adapt to rapidly changing circumstances."
  ]
}