{
  "responsibilities": [
    "Rotate through a full-time, two-year rotational program with 6 months assignments to gain exposure to various business functions and technologies.",
    "Actively integrate into the day-to-day operations of the project team, assuming full responsibility for tasks assigned, with guidance and mentorship from senior technical leads.",
    "Collaborate with a global team of innovators to solve current business challenges.",
    "Build technical skills in critical areas while partnering across the organization to solve business challenges.",
    "Solve real business problems, working on real projects such as full-stack software initiatives using React, Node.js, Python, Java or .NET.",
    "Deploy cutting-edge serverless cloud technologies such as Lambda, Step Functions, Kafka, SQS, SNS, etc.",
    "Leverage high-availability cloud databases.",
    "Develop NLP, AI, and Machine Learning solutions.",
    "Employ a working knowledge of SDLC, SCRUM, and Agile methodologies."
  ],
  "skills": [
    "Technical skills in full-stack software development using React, Node.js, Python, Java, or .NET.",
    "Experience with serverless cloud technologies such as Lambda, Step Functions, Kafka, SQS, SNS, etc.",
    "Knowledge of high-availability cloud databases.",
    "Understanding of natural language processing and machine learning techniques.",
    "Working knowledge of SDLC, SCRUM, and Agile methodologies.",
    "Excellent verbal and written communication skills.",
    "Ability to collaborate and innovate within a team."
  ],
  "qualifications": [
    "Currently earning or recently completed a Bachelor’s or Master’s degree in Computer Science, Math, or related engineering field.",
    "Formal training/class work/internship work in software development.",
    "U.S. work authorization required.",
    "Project experience with web application technologies: Front End (JavaScript, HTML/DHTML, React, Bootstrap, etc.), Middle Tier (Python, Java/J2EE, node.js or .NET), Back End (Relational databases (SQL), knowledge of NoSQL databases a plus).",
    "Exposure to cloud technologies (AWS, Azure) preferred.",
    "Ambition and interest in taking a career towards a technical leadership role."
  ]
}