{
  "responsibilities": [
    "Design and develop creative, learner-centered training content for on-demand, instructor-led, and blended training.",
    "Build associated assets including labs, videos, facilitator guides, and other resources.",
    "Collaborate effectively with Engineers, Portfolio Managers, and other partners to support initiatives.",
    "Ensure and drive best practices standardization across all projects, content, and curricula.",
    "Perform needs and task analysis, scope projects, and evaluate existing documentation to identify the most appropriate training approach and content to meet the learning needs of each audience across global audiences."
  ],
  "skills": [
    "Deep knowledge in Cloud computing technologies.",
    "Proficiency with Learning and development tools and technologies (i.e., authoring tools, learning platforms, and other relevant technologies).",
    "Ability to translate technical content into effective learning solutions.",
    "Experience coding in Python, SQL, and TensorFlow.",
    "Experience building and managing data pipelines.",
    "Familiarity with R and data visualization tools.",
    "Ability to collaborate with highly technical subject matter experts and stakeholders."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, Mathematics, Information Architecture, or equivalent practical experience.",
    "4 years of experience in Cloud Data or a related discipline.",
    "4 years of experience with cloud computing technologies.",
    "4 years of experience as a technical instructor or in technical training curriculum development.",
    "Experience within learning content, including technical topics to novice or non-technical audiences.",
    "Associate or professional certification in ML/AI or Data (preferred).",
    "Experience creating and managing learning (i.e., labs) by collaborating with highly technical subject matter experts and managers to develop training content and curricula (preferred)."
  ]
}