{
  "responsibilities": [
    "Design, develop, and implement machine learning models for various applications, including resource planning optimization, predictive analytics, time-series forecasting, and natural language processing.",
    "Research and implement innovative science-based algorithms to address specific business challenges.",
    "Design and implement end-to-end machine learning workflows using AWS cloud (such as Sagemaker).",
    "Collaborate with multi-functional teams, including data scientists, software engineers, and domain experts, to understand requirements and deliver effective solutions.",
    "Document code, algorithms, and ensure reproducibility.",
    "Provide technical mentorship in standard methodologies for model development and deployment to the data science team.",
    "Effectively communicate technical concepts and insights to both technical and non-technical customers.",
    "Deploy science models using pipeline established by engineers, including provisioning, cloud resource management, and containerization as necessary."
  ],
  "skills": [
    "Proficiency in developing science models using Python, Java, or similar languages.",
    "Expertise in SQL.",
    "Proficiency with version control systems (e.g., Git) and coding practices.",
    "Strong understanding of cloud platforms for ML pipeline such as AWS Sagemaker.",
    "Experience with containerization & orchestration tools (e.g., Docker, Kubernetes).",
    "Experience with Infrastructure as Code tools (e.g., Terraform, CloudFormation).",
    "Strong problem-solving skills.",
    "Ability to work independently and in a fast-paced environment.",
    "Excellent oral and written communication skills."
  ],
  "qualifications": [
    "Graduate Degree (MS or PhD or equivalent experience) in Data Science, Machine Learning, Statistics, Operations Research, or related field.",
    "5+ years of experience in developing and deploying production-level systems using combinations of algorithms and machine learning models in a production environment.",
    "Experience in machine learning, forecasting, reinforcement learning, optimization, and simulation.",
    "Understanding of deep learning techniques (Reinforcement Learning is a plus).",
    "Ability to travel up to 10% of the time."
  ]
}