{
  "responsibilities": [
    "Conduct research on GenAI and Foundation models (FM) to address academic and industrial challenges.",
    "Work with an international team of experts to transfer and apply Bosch in-house GenAI / FM innovations and 3rd-party solutions to Bosch AI products and services, such as ADAS, AI agents, etc.",
    "Stay abreast of the latest technological advancements and market trends by attending academic conferences, technical events, and seminars.",
    "Offer expert insights to the management team in relevant technology sectors, aiding in strategic planning, R&D trajectory, and investment decisions.",
    "Document and disseminate research findings through high-caliber publications and/or patent submissions."
  ],
  "skills": [
    "In-depth experiences in deep learning, with work in at least two of the following areas: AI agent, RAG, multimodal transformers, multimodal language models, diffusion models, autonomous driving, time-series data analysis.",
    "Proficiency in one or more programming languages commonly used in systems research (e.g., Python, C++).",
    "Hands-on experience with AI / NLP / CV libraries.",
    "Strong interpersonal, communication, and teamwork capabilities.",
    "Strong background in math and statistics.",
    "Leadership skills with excellent English communication & teamwork skills."
  ],
  "qualifications": [
    "Ph.D. in Computer Science or Engineering, or a related discipline or master’s degree with 3+ years industry experience (GenAI and/or foundation model related) after graduation.",
    "2+ years of research experience or equivalent graduate research experience on foundation models, including training, fine-tuning, and prompting.",
    "Publication record in top venues including ACL, EMNLP, CVPR, ICCV, ECCV, ICRA, IROS, RSS, NeurIPS, AAAI and CoRL.",
    "3+ years experiences in industrial research.",
    "Hands-on experience in product development in the above-mentioned areas for consumer/enterprise markets.",
    "Experience in leading R&D project & team dealing with international customers."
  ]
}