{
  "responsibilities": [
    "Work with the Product Owner, Product Manager, and Development Lead to understand and determine the best mix of development and technical solutions to meet business requirements and project objectives.",
    "Work on detailed design and development phases of project initiatives; identifying, tracking, and resolving technical issues.",
    "Ensure design/development solutions are aligned to the data/architecture strategy.",
    "Ensure adequate technical/reference documentation and training is in place.",
    "Provide assistance to the application support team in troubleshooting and resolving production issues.",
    "Coordinate with the Quality Engineering team on all aspects of testing and verification, ensuring quality assurance testing is performed for all changes.",
    "Impart knowledge, benefit of experience, and mentoring to other members of the team."
  ],
  "skills": [
    "Experience with Scala, Spark, Python",
    "Experience with Apache Hadoop/Hive ETL/data-pipelines or other big-data platform technology/tools",
    "Experience with SQL, Oracle/PL-SQL or any ANSI-compliant RDBMS platform",
    "Experience on Windows/Unix/Linux OS",
    "Solid communication and time management skills",
    "Experience with DevOps tools/technologies, including continuous integration/delivery tools and technologies such as GitHub, Jenkins, Synk, JIRA, Confluence, Airflow",
    "Experience with containerization tools and technologies such as Docker, Kubernetes, Redhat OpenShift Container Platform (OCP)",
    "Experience with Capital Markets or other financial technology services’ middle/back office environments",
    "Experience with/exposure to cloud technology platforms such as PCF (on-prem), AWS, Azure (off-prem)",
    "Experience with/exposure to Business Intelligence (BI)/Analytics/Reporting tools, such as Tableau, Datameer, Power BI, Presto, Snowflake, Apache Superset",
    "Experience with/exposure with Test driven development (TDD) and automated unit testing"
  ],
  "qualifications": [
    "3+ years’ experience with Scala, Spark, Python",
    "Solid experience with Apache Hadoop/Hive ETL/data-pipelines or other big-data platform technology/tools",
    "Solid experience with SQL, Oracle/PL-SQL or any ANSI-compliant RDBMS platform preferred",
    "Undergraduate degree/diploma in computer science/engineering or related technology discipline"
  ]
}