{
  "responsibilities": [
    "Design, implement, and optimize robust and scalable data pipelines using SQL, Python, and cloud-based ETL tools such as Databricks.",
    "Develop and refine data models to accurately represent business processes.",
    "Enhance data architecture strategy, assisting in decisions related to data storage, consumption, integration, and management within cloud environments.",
    "Lead and contribute within Agile/SCRUM frameworks to ensure timely and efficient project deliveries.",
    "Partner with data scientists, BI teams, and other engineering teams to translate complex data requirements into actionable engineering solutions.",
    "Guide and mentor junior data engineers, promoting best practices in SQL, Python, and cloud technologies.",
    "Uphold and champion data quality standards and governance policies.",
    "Monitor and enhance the performance of data infrastructure, identifying and resolving bottlenecks or inefficiencies.",
    "Stay abreast of emerging data engineering and AI technologies and methodologies.",
    "Generate comprehensive documentation for data processes, pipelines, and architectures."
  ],
  "skills": [
    "Proficiency in SQL and Python for data analysis, data manipulation, and scripting.",
    "In-depth knowledge of developing and managing ETL and ELT architectures.",
    "Experience with cloud platforms such as Azure, AWS, or Google Cloud.",
    "Understanding of Big Data technologies and frameworks, including Spark and Cloud ETL tools such as Databricks.",
    "Familiarity with Agile methodologies and SCRUM practices.",
    "Expertise in analyzing large datasets to derive insights and inform business decisions.",
    "Ability to work effectively with cross-functional teams.",
    "Skills in mentoring junior engineers and leading project teams.",
    "Commitment to staying updated on the latest industry trends and technologies in data engineering."
  ],
  "qualifications": [
    "Bachelor’s Degree in Computer Science, Data Science, Information Technology, or other quantitative disciplines.",
    "7+ years of progressive experience in data engineering.",
    "Extensive hands-on experience with SQL Server, Oracle, or other RDBMS.",
    "Proficient with at least one major cloud data platform (Azure, AWS, Google Cloud).",
    "Familiarity with Big Data technologies such as Spark and Cloud ETL tools like Databricks.",
    "Proven track record of using Agile and SCRUM methodologies.",
    "Experience in developing data models for integration and analysis.",
    "Preferred: Master’s Degree in relevant fields.",
    "Preferred: Experience with the Microsoft Azure technology stack or similar technologies.",
    "Preferred: Professional certification in Agile and SCRUM methodologies.",
    "Preferred: Certifications in Python and SQL programming.",
    "Preferred: Certifications in cloud services relevant to the job.",
    "Preferred: Big Data certifications."
  ]
}