{
  "responsibilities": [
    "Integrate and curate data from Commercial systems (CRM, Marketing Cloud, 3rd Party Logistics Providers) to support analytics and monitoring.",
    "Collaborate closely with business teams to understand requirements and translate them into data solutions.",
    "Manage, maintain, and improve the Vertex Data Platform solutions that support and enable the Commercial organization.",
    "Estimate, architect, and execute on delivery of critical data solutions across the Commercial domain, in partnership with the DSE leadership team.",
    "Manage a team of data engineers to maintain compliant, timely, secure, and reliable data workloads for Commercial.",
    "Advocate for process enhancements and opportunities to improve capabilities with a focus on efficiency, scale, and data connectivity."
  ],
  "skills": [
    "Ability to mentor junior team members and prioritize workload to team.",
    "Ability to work independently and manage multiple projects that require collaboration across functional areas.",
    "Skillful, collaborative team player able to develop rapport and credibility with stakeholders.",
    "Ability and willingness to teach, engage, and support others as they learn new technologies and concepts.",
    "Enthusiasm for and the ability to quickly learn new technologies and tackle difficult problems.",
    "Strong presentation, verbal, and written communication skills.",
    "Working knowledge of key workflow tools, including JIRA and Confluence."
  ],
  "qualifications": [
    "8 years of development experience using Snowflake, Databricks, Spark, Redshift, or equivalent data technologies.",
    "Prior experience leading Data Engineering projects and teams within the pharmaceutical Commercial domain.",
    "Demonstrated experience with internal and external Commercial datasets (e.g., Veeva, Iqvia).",
    "Demonstrated experience with Compliance frameworks (HIPAA, GDPR).",
    "Successful track record managing an integrated vendor team.",
    "Experience in delivery in agile environments (5+ years)."
  ]
}