{
  "responsibilities": [
    "Build and own the infrastructure and tools required for processing and storing data from a wide variety of data sources.",
    "Design, develop, and optimize data pipelines, architectures, and data sets.",
    "Collaborate with Data Engineers, Data Scientists, and other customers to understand complex data requirements.",
    "Assist data users in defining requirements and refining existing processes.",
    "Integrate new tools and solutions to empower the organization’s data consumers.",
    "Implement data monitoring and alerting solutions to identify and address data issues.",
    "Implement systems to monitor the performance of deployed AI models.",
    "Design, develop, and implement AI solutions using GenAI, LLMs, and RAG methodologies.",
    "Engineer prompts for AI models to improve their accuracy and utility.",
    "Conduct comprehensive testing and validation of AI models.",
    "Collaborate with data scientists, software developers, and other customers to integrate AI models into existing systems.",
    "Maintain and optimize existing AI systems.",
    "Stay updated with the latest advancements in AI and related technologies.",
    "Initialize and manage cloud platforms with Azure.",
    "Develop, maintain, and test data pipelines, application frameworks, and infrastructure for data generation.",
    "Employ Azure Functions to deploy scalable cloud-based solutions.",
    "Implement event-based architecture for real-time data processing and integration.",
    "Build, code, test, and maintain high-quality software.",
    "Translate user requirements into software requirements.",
    "Develop and maintain applications using Python.",
    "Use the Microsoft Power Platform to create custom business applications and workflows.",
    "Participate in Agile sprints and ceremonies.",
    "Work closely with information architects and data scientists.",
    "Participate in functional demos using new technologies.",
    "Collaborate with team members, participate in code reviews, and share skills and methods.",
    "Stay abreast of developments in technical subject areas and experiment with emerging technologies."
  ],
  "skills": [
    "Experience maintaining and extending Infrastructure as Code (IaC) modules.",
    "Ability to develop IaC scripts and modules for cloud infrastructure.",
    "Ability to integrate IaC scripts with DevOps and Build pipelines.",
    "Ability to implement CI/CD pipelines for IaC deployments.",
    "Experience configuring RBAC and access controls via automation or CLI.",
    "Experience in requirements, design, and solution discussions for application, architecture, networking, and infrastructure.",
    "Proficiency in designing, developing, and implementing AI solutions.",
    "Ability to engineer prompts for AI models.",
    "Skills in testing and validating AI models.",
    "Experience in collaborating with data scientists and software developers.",
    "Proficiency in maintaining and optimizing AI systems.",
    "Knowledge of cloud platform management, particularly with Azure.",
    "Skills in developing, maintaining, and testing data pipelines and application frameworks.",
    "Proficiency in using Azure Functions for scalable solutions.",
    "Ability to implement event-based architecture.",
    "Software development skills, particularly in Python.",
    "Experience with the Microsoft Power Platform.",
    "Participation in Agile methodologies.",
    "Collaboration and communication skills.",
    "Continuous learning and experimentation with emerging technologies."
  ],
  "qualifications": [
    "6+ years of experience as a Data Platform Engineer.",
    "Experience with Infrastructure as Code (IaC) and cloud infrastructure.",
    "Experience with AI Engineering, including GenAI, LLMs, and RAG methodologies.",
    "Experience with cloud platform management, particularly Azure.",
    "Proficiency in software development, particularly in Python.",
    "Experience with Agile methodologies.",
    "Strong collaboration and communication skills.",
    "Commitment to continuous learning and staying updated with technological advancements."
  ]
}