{
  "responsibilities": [
    "Lead the design, development, and implementation of computer vision algorithms for aerial object detection and tracking.",
    "Conduct research and stay up-to-date with the latest advancements in computer vision and machine learning.",
    "Collaborate with cross-functional teams to integrate computer vision solutions into defense systems.",
    "Optimize and enhance existing algorithms for improved accuracy, efficiency, and real-time performance.",
    "Analyze and interpret complex data sets to improve detection and tracking accuracy.",
    "Provide technical leadership and mentorship to other engineers.",
    "Prepare and present technical reports, documentation, and presentations to stakeholders and customers.",
    "Ensure compliance with industry standards and regulatory requirements in all developed solutions."
  ],
  "skills": [
    "Strong programming skills in Python and C++.",
    "Familiarity with relevant libraries such as OpenCV, TensorFlow, and PyTorch.",
    "In-depth knowledge of image processing, feature extraction, object detection, and tracking algorithms.",
    "Excellent problem-solving skills with the ability to think critically and innovate.",
    "Strong communication skills, both written and verbal.",
    "Ability to work effectively in a team-oriented, collaborative environment."
  ],
  "qualifications": [
    "Master's or Ph.D. in Computer Science, Electrical Engineering, or a related field with a focus on computer vision and machine learning.",
    "Minimum of 10 years of experience in computer vision, with a significant portion in aerial object detection and tracking.",
    "Proven experience in developing and deploying machine learning and deep learning models in real-world applications.",
    "Experience with defense industry projects and a solid understanding of military standards and requirements.",
    "Preferred: Experience with drone technology and UAV systems.",
    "Preferred: Knowledge of radar, LIDAR, and other sensing technologies.",
    "Preferred: Familiarity with cloud computing platforms and edge computing.",
    "Preferred: Security clearance or the ability to obtain one."
  ]
}