{
  "responsibilities": [
    "Implement and integrate generative AI models and machine learning algorithms into existing and new software solutions.",
    "Fine-tune and optimize pre-trained AI/ML models for specific use cases.",
    "Collaborate with engineers and data scientists to build and deploy scalable AI-driven features.",
    "Write clean, efficient, and maintainable code for AI-powered software applications.",
    "Contribute to both frontend and backend development tasks as part of a cross-functional team.",
    "Work closely with team members and product leads to understand requirements and design AI/ML-enabled features.",
    "Participate in architectural discussions to incorporate AI technologies into existing systems.",
    "Optimize and refactor code to address performance bottlenecks in AI/ML pipelines.",
    "Write and execute robust unit and integration tests for AI/ML models and other software components.",
    "Troubleshoot and resolve issues related to AI/ML model performance and system integration.",
    "Stay updated on advancements in AI/ML, particularly in generative AI models.",
    "Propose and implement creative solutions using AI to solve business problems.",
    "Partner with senior, staff, and principal engineers to refine development processes for AI/ML integration.",
    "Share knowledge about AI/ML best practices with teammates and mentor junior engineers."
  ],
  "skills": [
    "Proficiency in multiple programming languages, frameworks, and technologies such as Python, SQL, ReactJS, Node.js, JavaScript, TypeScript, Apache Beam, dbt, and BigQuery.",
    "Experience using AI/ML libraries and frameworks (e.g., GPT-4, Gemini, Llama, Vertex, TensorFlow, Scikit-learn).",
    "Knowledge of application architectures, security best practices, and data integration concepts.",
    "Exposure to ETL technologies and data engineering with a focus on building and maintaining data platforms and pipelines.",
    "Understanding of database concepts, data modeling, and data warehousing principles.",
    "Understanding of distributed data management systems and related applications.",
    "Familiarity with public cloud infrastructure design, tools, and strategies.",
    "Knowledge of software development methodologies including Agile, Kanban, and Scrum.",
    "Effective communication skills, with the ability to articulate technical concepts to both technical and non-technical stakeholders.",
    "Familiarity with CI/CD pipelines and DevOps practices.",
    "Experience with implementing scalable and high-performance features.",
    "Experience in mentoring more junior level engineers.",
    "Prior experience with technical problem-solving and the ability to navigate complex technical challenges."
  ],
  "qualifications": [
    "Bachelor’s degree in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience.",
    "3+ years as a software engineer, with a focus on a combination of frontend, backend, and data engineering.",
    "Experience training and fine-tuning machine learning models, including supervised, unsupervised, and reinforcement learning approaches."
  ]
}