{
  "responsibilities": [
    "Design, develop, and maintain robust backend services and APIs using Python frameworks like Django, Flask, or FastAPI.",
    "Manage schema migrations using Alembic for SQLAlchemy.",
    "Define and interact with models using SQLAlchemy or similar ORMs.",
    "Deploy, manage, and scale backend services on GCP, ensuring high availability and performance.",
    "Work on ETL, reverse ETL, data warehousing, and metadata handling.",
    "Monitor, analyze, and improve the performance, reliability, and scalability of backend systems.",
    "Design systems for scale and implement security best practices.",
    "Collaborate with cross-functional teams to understand requirements and translate them into technical solutions.",
    "Stay up-to-date with industry trends, emerging technologies, and best practices.",
    "Own, design, implement, and maintain business impacting features end to end."
  ],
  "skills": [
    "Proficiency in Python frameworks such as Django, Flask, or FastAPI.",
    "Expertise in schema management using Alembic for SQLAlchemy.",
    "Skilled in using SQLAlchemy or similar ORMs.",
    "Experience with GCP, Docker, and Kubernetes for deploying and managing backend services.",
    "Knowledge of ETL, reverse ETL, data warehousing, and metadata handling.",
    "Ability to monitor and optimize backend system performance.",
    "Understanding of scalable and secure system design.",
    "Strong collaboration and communication skills.",
    "Continuous learning and adaptability to new technologies.",
    "Ability to write clean, simple, and elegant code."
  ],
  "qualifications": [
    "Proven experience of 2-6 years as a Backend Engineer.",
    "Hands-on experience in Python frameworks such as Django, Flask, or FastAPI preferred.",
    "Understanding of the process from code commit to production environments, including CI/CD pipelines and multi-cluster environments.",
    "Growth mindset with the ability to learn new technologies and frameworks.",
    "Understanding of ML models and MLOps practices is a plus.",
    "Experience in B2B product engineering is a plus."
  ]
}