{
  "responsibilities": [
    "Develop the industry’s best cloud-based solutions to grow the GenAI business.",
    "Enable new capabilities for customers to develop and deploy GenAI workloads on AWS.",
    "Facilitate the enablement of AWS technical community, solution architects, and sales with customer-centric value propositions and demos.",
    "Drive engagement and interact with startups, enterprises, and AWS partners.",
    "Articulate the potential and challenges of GenAI models and applications to engineering teams and C-Level executives.",
    "Drive the development of the GTM plan for building and scaling GenAI on AWS.",
    "Interact with customers to understand their business problems and help define and implement scalable GenAI solutions.",
    "Work closely with account teams, research scientists, and product teams to drive model implementations and new solutions.",
    "Represent the team to executive management and partner with other AWS teams.",
    "Work with AWS ML and EC2 product teams to shape product vision and prioritize features for AI/ML frameworks and applications."
  ],
  "skills": [
    "Technical and business background to drive engagement and interact at high levels.",
    "Deep familiarity with compute infrastructure (Amazon EC2, Lustre), ML frameworks (PyTorch, JAX), orchestration layers (Kubernetes, Slurm), and parallel computing (NCCL, MPI).",
    "Understanding of MLOps and target use cases in the cloud.",
    "Ability to articulate GenAI models and applications to engineering teams and executives.",
    "Passion for helping companies/partners understand best practices for operating on AWS.",
    "Ability to interact, communicate, and partner with various AWS teams.",
    "Natural appetite to learn, optimize, and build new technologies and techniques.",
    "Ability to identify patterns and trends that can be broadly applied across industry segments."
  ],
  "qualifications": [
    "2+ years of design, implementation, or consulting in applications and infrastructures experience.",
    "4+ years of experience in specific technology domain areas (e.g., software development, cloud computing, systems engineering, infrastructure, security, networking, data & analytics).",
    "5+ years of IT development or implementation/consulting in the software or Internet industries experience.",
    "Experience working within software development or Internet-related industries (preferred).",
    "Experience migrating or transforming legacy customer solutions to the cloud (preferred).",
    "Experience working with AWS technologies from a dev/ops perspective (preferred)."
  ]
}