{
  "responsibilities": [
    "Design, develop, test, and deploy algorithms and models for weather forecasting.",
    "Collaborate with scientists, engineers, and product managers to understand business requirements and translate them into technical solutions.",
    "Provide technical leadership and mentorship to engineers and peers.",
    "Ensure code quality, performance, reliability, and scalability of the platform components.",
    "Research and evaluate new technologies and frameworks to improve platform capabilities.",
    "Troubleshoot and resolve issues in production and development environments.",
    "Maintain and improve existing service pipelines: identify performance bottlenecks and single point failures.",
    "Improve deployment and test pipeline reliability to reduce live site incidents.",
    "Coordinate communication across different time zones (approximately 5% to 10%)."
  ],
  "skills": [
    "Knowledge of modern cloud-based architecture and services, including containers, caching, load-balancing, IO bandwidth optimization, and non-sql databases.",
    "General understanding of machine learning and deployment of SOTA deep learning models.",
    "Performance tuning experience for serving deep learning models.",
    "Coding proficiency in languages such as C, C++, C#, Java, JavaScript, or Python.",
    "Experience with deep learning frameworks (PyTorch, TensorFlow, Keras, etc.).",
    "Ability to analyze cloud service performance bottlenecks and drive end-to-end service pipeline optimization."
  ],
  "qualifications": [
    "Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in specified languages OR equivalent experience.",
    "6+ years of direct experience delivering, scaling, and owning highly successful and innovative machine learning products or services in a multi-tiered distributed cloud environment.",
    "Ability to meet Microsoft, customer, and/or government security screening requirements, including passing the Microsoft Cloud Background Check.",
    "Preferred: Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience OR equivalent experience.",
    "Experience working through full product cycles from initial design to final product delivery.",
    "Demonstrated understanding of the inference pipeline of deep learning models and its optimization."
  ]
}