{
  "responsibilities": [
    "Be an integral part of a team responsible for developing and deploying Machine Learning algorithms in the cloud.",
    "Ensure cloud-based ML training and serving platforms are available and performant, and proactively identify problems.",
    "Build tools to improve speed, confidence, and availability of the platform.",
    "Help build security into every step of the software & infrastructure development life cycle.",
    "Collaborate across multiple technical functions to ensure high availability, disaster recovery, and customer satisfaction."
  ],
  "skills": [
    "Ability to solve manual & repetitive operations through automation.",
    "Enjoyment of learning new tools, languages, and frameworks.",
    "Ability to work in a highly collaborative environment.",
    "Strong organizational and detail-oriented skills.",
    "Strong customer focus.",
    "Good communication skills and ability to remain calm under pressure.",
    "High sense of ownership and a “can-do” attitude.",
    "Willingness to dig deep into infrastructure and code to solve problems.",
    "Enthusiastic self-starter with a commitment to learning."
  ],
  "qualifications": [
    "A Bachelor’s degree in Computer Science, Engineering.",
    "5+ years of combined experience in Software/Data Engineering, MLOps, DevOps, or SRE teams.",
    "Strong hands-on experience in Kubernetes designing, creating, deploying, and maintaining enterprise-class ML models and services.",
    "Experience in Data Science or working with Data Scientists as stakeholders.",
    "Experience with model training pipelines using Kubeflow.",
    "Experience deploying and maintaining Linux-based, highly scalable, and fault-tolerant enterprise-class software platforms.",
    "Demonstrated experience with object-oriented programming in Python.",
    "Hands-on experience with technologies such as Spark, Istio/service mesh architecture, cloud security, Terraform/CloudFormation.",
    "Hands-on experience with developing microservices in a Public Cloud environment such as Amazon’s AWS Services, Azure, or GCP.",
    "Familiarity with common monitoring, log aggregation, and metrics gathering platforms such as Grafana, Prometheus, and CloudWatch.",
    "Engineering experience with databases such as Snowflake, Postgres, MySQL, Redis, DynamoDB, etc.",
    "Familiarity with common configuration management & orchestration tools such as Jenkins, Puppet/Bottlerocket, and Chef."
  ]
}