{
  "responsibilities": [
    "Develop Big Data system infrastructure and processing engine in C/C++/C# and Python.",
    "Develop and support Big Data engine solutions, working across runtimes and distributed hardware devices.",
    "Participate in/lead designs, and write production-level, high-quality code.",
    "Deploy and maintain software to meet significant reliability, security, and service level requirements.",
    "Work in a team of software and hardware engineers to deploy working systems to a very large user base.",
    "Embody Microsoft's culture and values."
  ],
  "skills": [
    "Proficiency in coding languages including C, C++, C#, and Python.",
    "Experience in software development across all stages of a release cycle (design, implementation, and test).",
    "Experience in compiler and/or automation tools and flows.",
    "Flexibility to work across various functions.",
    "Ability to develop and support Big Data engine solutions.",
    "Ability to deploy and maintain software with high reliability, security, and service level requirements."
  ],
  "qualifications": [
    "Bachelor's Degree in Computer Science or related technical disciplines AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Python OR equivalent experience.",
    "4+ years of software development experience in all stages of a release cycle (design, implementation, and test).",
    "Ability to meet Microsoft, customer, and/or government security screening requirements, including passing the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "Preferred: Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience."
  ]
}