{
  "responsibilities": [
    "Lead, guide, and influence customers and team members throughout the DevOps journey.",
    "Solve cloud-based solutions at scale using deep technical expertise.",
    "Guide customers through transforming their business with cultural philosophies, practices, and tools.",
    "Collaborate with customers and partners on key engagements.",
    "Design and code modules for infrastructure, application, and processes.",
    "Develop and deliver proof-of-concept projects, technical workshops, and support implementation projects.",
    "Create white papers, author blogs, build demos, and other reusable collateral for customers.",
    "Work with Solution Architects, Data Scientists, and Service Engineering teams.",
    "Engage in remote delivery methods and onsite engagement, including travel to customer locations as needed."
  ],
  "skills": [
    "Hands-on experience of programming in languages such as Python, Ruby, Go, Swift, Java, .Net, C++, Node.js, or similar object-oriented language.",
    "Experience with automating cloud native technologies, deploying applications, and provisioning infrastructure.",
    "Hands-on experience with Infrastructure as Code, using CloudFormation, Terraform, CDK, or other tools.",
    "Experience developing cloud native CI/CD workflows and tools, such as GitHub Actions, Jenkins, Bamboo, TeamCity, Code Deploy (AWS), and/or GitLab Pipelines.",
    "Hands-on experience with microservices and distributed application architecture, such as containers, Kubernetes, and/or serverless technology.",
    "Experience with the full software development lifecycle (SDLC) and delivery using Agile practices.",
    "Experience with configuration management frameworks such as Chef, Puppet, Salt, or Ansible in production environments.",
    "Knowledge of code Version Control branching strategies.",
    "Knowledge of IP networking, VPN's, DNS, load balancing, and firewall.",
    "Experience with monitoring and log aggregation frameworks such as Kafka, Logstash, Splunk, ElastiSearch, and Kibana.",
    "Knowledge of the DORA metrics and how they relate to the SDLC process.",
    "Experience implementing and designing cloud native security concepts, DevSecOps, or MLOps.",
    "Strong presentation, verbal communication, and written communications skills."
  ],
  "qualifications": [
    "Bachelor’s degree or higher in Computer Science, Engineering, Mathematics, or a related field with a conferral date within May 2023 to August 2025.",
    "1+ years of hands-on experience of programming in relevant languages.",
    "AWS Certification(s) such as Solutions Architect Pro, DevOps Engineer Pro, SysOps Admin, Developer Associate."
  ]
}