{
  "responsibilities": [
    "Design, develop, and deploy data products and services to meet the analytical needs of the organization.",
    "Create and maintain comprehensive data models that support various business functions and analytical requirements.",
    "Develop and manage self-service data portals to empower business users with easy access to data.",
    "Implement and manage ETL processes to integrate data from various sources into new data models and views.",
    "Work closely with data analysts, data scientists, and other stakeholders to understand and deliver on data requirements.",
    "Ensure data quality, security, and compliance with organizational standards and regulations.",
    "Optimize database performance and ensure efficient data retrieval and processing.",
    "Maintain comprehensive documentation of data engineering processes, data models, and data dictionaries.",
    "Provide guidance and mentorship to junior data engineers and other team members."
  ],
  "skills": [
    "Advanced knowledge of SQL Server and T-SQL programming.",
    "Experience with PowerBI for data visualization and reporting.",
    "Familiarity with MS Fabric for data integration and management.",
    "Knowledge of programming languages such as Python or Java.",
    "Proficiency in Microsoft Azure, including Azure Data Factory, Azure Databricks, and Azure Synapse Analytics (nice to have).",
    "Strong understanding of data warehousing concepts and best practices.",
    "Experience in developing and managing ETL pipelines.",
    "Strong analytical and problem-solving skills with the ability to interpret complex data sets.",
    "Excellent verbal and written communication skills, with the ability to convey technical information to non-technical stakeholders.",
    "Proven ability to work collaboratively in a team environment and manage multiple priorities.",
    "High attention to detail and a commitment to data accuracy and integrity."
  ],
  "qualifications": [
    "Bachelor's or Master's degree in Computer Science, Information Technology, Data Science, or a related field.",
    "Minimum of 5 years of experience in data engineering, with a strong focus on Microsoft technologies."
  ]
}