{
  "responsibilities": [
    "Lead mission-critical projects and deliver data ingestion capabilities end-to-end with high quality.",
    "Have clear ownership of one or many products, APIs, or platform spaces.",
    "Work within Rippling's central infrastructure team to deliver highly scalable distributed data ingestion systems.",
    "Build a data lake architecture for various downstream systems to consume.",
    "Get exposure to partners and customers in different business domains to gather feedback for your product space.",
    "Ensure operational excellence and scale the platform capabilities to serve many different use cases across Rippling Products.",
    "Build and grow engineering skills in different challenging areas and solve hard technical problems.",
    "Influence architecture, technology selections, and trends of the whole company."
  ],
  "skills": [
    "Ability to lead and manage mission-critical projects.",
    "Strong ownership and accountability for products, APIs, or platform spaces.",
    "Expertise in building scalable distributed data ingestion systems.",
    "Experience in building data lake architectures.",
    "Strong communication skills for interacting with partners and customers.",
    "Ability to ensure operational excellence and scalability.",
    "Problem-solving skills in challenging technical areas.",
    "Ability to influence architecture and technology decisions."
  ],
  "qualifications": [
    "8+ years of professional work experience as a backend engineer.",
    "Significant leadership experience driving complex cross-functional projects across teams, product managers, designers, etc.",
    "Expertise in building complex distributed services with high availability and strict SLAs.",
    "Experience building large-scale user-facing applications, APIs, and developer tools.",
    "Strong CS fundamentals, and knowledge of architecture and common design patterns.",
    "Passion for being in a product-focused environment with a strong emphasis on customer impact.",
    "Experience running data processing pipelines in production using distributed data processing frameworks like Apache Spark or Flink.",
    "Bonus: Experience building integrations with 3rd party SaaS providers and workflow orchestration systems.",
    "Bonus: Previous experience with AWS and working knowledge of observability tooling."
  ]
}