{
  "responsibilities": [
    "Design and optimize high-throughput data pipelines for streaming and processing massive training datasets.",
    "Implement caching, sharding, and prefetching techniques to maximize data-loading efficiency.",
    "Ensure efficient integration with distributed storage systems (e.g., S3, GCS, Lustre, Ceph).",
    "Build and optimize distributed checkpoint mechanisms for large-scale training workflows.",
    "Implement techniques to minimize checkpoint I/O overhead and ensure fault tolerance.",
    "Develop incremental and differential checkpointing solutions to reduce storage costs.",
    "Profile and debug bottlenecks in data pipelines and checkpoint systems.",
    "Optimize for GPU/TPU utilization by ensuring efficient data feeding and checkpoint recovery times.",
    "Develop systems that scale efficiently across thousands of nodes and petabyte-scale datasets.",
    "Ensure fault-tolerant recovery and resume mechanisms for long-running training jobs.",
    "Work closely with ML researchers, data engineers, and infrastructure teams to understand workload requirements.",
    "Build tools and frameworks to enable seamless integration of dataset and checkpointing systems with existing ML workflows."
  ],
  "skills": [
    "Expertise in high-performance data processing libraries (e.g., PyTorch DataLoader, TensorFlow Data, DALI).",
    "Proficiency in distributed storage systems and data formats (e.g., Parquet, HDF5).",
    "Strong understanding of checkpointing frameworks and file systems (e.g., POSIX, Lustre, GPFS).",
    "Proficient in Python, C++, or Go for performance-critical systems.",
    "Experience with I/O optimization techniques (e.g., asynchronous data loading, prefetching).",
    "Familiarity with compression and serialization for large datasets and checkpoints.",
    "Analytical and problem-solving mindset.",
    "Strong communication and collaboration skills across teams."
  ],
  "qualifications": [
    "5+ years of experience in data engineering, distributed systems, or ML infrastructure.",
    "Experience with ML frameworks (e.g., PyTorch, TensorFlow, JAX) and distributed training (Nice-to-Have).",
    "Familiarity with hardware accelerators (e.g., GPUs, TPUs) and storage optimizations (Nice-to-Have).",
    "Knowledge of open-source contributions or projects related to data pipelines or checkpointing (Nice-to-Have).",
    "Experience with incremental and real-time checkpointing solutions (Nice-to-Have)."
  ]
}