{
  "responsibilities": [
    "Partner closely with account managers, specialists, and channel partners to create a seamless and holistic customer experience and strategy to drive revenue growth and net new business.",
    "Develop an exhaustive understanding of what drives a customer’s business and what motivates their decision making.",
    "Create customer-facing content (Technical Walkthroughs, Deep Dives, Qualification Guides, etc.) for AI and HPC opportunities.",
    "Advise leadership on appropriate methodologies and strategies to increase overall AI and HPC knowledge and enhance Pure’s position in the market.",
    "Lead/Participate in customer-facing calls, demos, POCs, EBCs, internal strategy/sizing sessions, and other related solution-focused activities.",
    "Connect the dots from technology solutions, inclusive of the Pure Storage portfolio and others from the ecosystem, to measurable customer business outcomes.",
    "Refine sales strategy and tactics, taking command of technical responsibilities.",
    "Delight customers and teammates with technical leadership and domain expertise on storage products, distributed storage architectures, file systems, and competitive storage offerings in the DAS, NAS, and SAN product spaces.",
    "Capture requirements and translate Customer’s business needs into innovative solutions to accelerate their growth and capacity.",
    "Contribute significant portions and/or lead responses to RFPs, RFQs, and RFIs.",
    "Seek out and spur new opportunities for interoperability, functional, and performance testing/validation.",
    "Promote mutual roadmap and planning exchanges.",
    "Liaise with product and technical marketing to produce materials (i.e., whitepaper, web presentations) that support overall alliance plans and objectives.",
    "Stay current with the competition and ensure that materials accurately reflect the latest, differentiated solution positioning.",
    "Move with market trends and competitive landscape to promote thought leadership within the organization.",
    "Be seen as the solution expert in complex POC and TCO calculations.",
    "Daily Slack availability and enablement, leading to customer/opportunity influence.",
    "Post-sales assistance with expert-level knowledge around solutions.",
    "Partner with Sales & SE Leaders for two-way feedback and communication.",
    "High degree of cross-functional engagement with other GTM and corporate functions.",
    "Communicate, connect, and align people within the direct team and develop internal relationships across Pure Storage."
  ],
  "skills": [
    "Strong technical and tactical problem-solving skills and experience with complex engineering designs.",
    "Excellent oral and written communication skills with an ability to explain complex concepts simply.",
    "Ability to articulate and understand the customer strategy and Pure Storage’s solution strategy to a technical level of detail for the AI and HPC domain.",
    "Proficiency with CRM and opportunity management systems, preferably Salesforce.com.",
    "Self-motivated individual with an ownership mindset who drives the business to overachieve expectations.",
    "Strong knowledge of digital transformation to a Cloud Native architecture, On-Prem, Public Cloud, Provisioning Automation, and Containers.",
    "Familiarity with AWS, Azure, GCP, containers, k8s, and microservices architectures.",
    "Deep understanding of industry AI frameworks (pytorch, tensorflow, jax etc).",
    "Deep understanding of high performance, low latency, highly parallelized compute solutions at scale (compute, network, storage).",
    "Deep understanding of accelerated compute environments (GPU, ASIC, FPGA etc).",
    "Understanding of AI and HPC orchestration and management layer (Kubernetes, slurm, vertex, sagemaker).",
    "Deep understanding of the convergence of HPC and AI infrastructure requirements and challenges.",
    "Understanding of classic unstructured data applications and next-generation analytics and web frameworks.",
    "Strong acumen in the Datacenter space with deep interest and vision for the industry."
  ],
  "qualifications": [
    "Bachelor's Degree in Computer Science or related field or equivalent experience.",
    "8+ years of experience in the data center field, including hands-on experience designing, implementing, and maintaining comprehensive storage, networking, cloud, HPC, and AI architectures and standards.",
    "Technical pre-sales experience is required.",
    "Prior experience in targeting new prospects and converting them into clients.",
    "Ability to travel throughout the territories as required."
  ]
}