{
  "responsibilities": [
    "Deliver complex code solutions.",
    "Support the build and deployment pipeline.",
    "Diagnose and solve production support or on-call issues.",
    "Contribute to overall system design, architecture, security, scalability, reliability, and application performance.",
    "Provide end-to-end support.",
    "Develop and implement computer vision algorithms for tasks such as object detection, image segmentation, feature extraction, and tracking.",
    "Work with large-scale image and video datasets to train, test, and refine models.",
    "Optimize models for performance, accuracy, and efficiency, particularly in real-time applications.",
    "Collaborate with software engineers to integrate computer vision solutions into product pipelines.",
    "Deploy computer vision models into low powered edge environments.",
    "Troubleshoot and debug models and systems to ensure robustness and reliability in production."
  ],
  "skills": [
    "Proficiency in programming languages such as Python, C++, Java or similar.",
    "Hands-on experience with machine learning frameworks and libraries (e.g., TensorFlow, PyTorch, OpenCV, etc.).",
    "Expertise with image processing techniques and tools.",
    "Proficiency with deep learning models and GPU acceleration.",
    "Proficiency with deploying computer vision models into edge environments.",
    "Proficiency with Cloud Technologies such as AWS, GCP, or Azure.",
    "Experience working with large datasets and creating integrations to access or share these datasets.",
    "Excellent problem-solving skills.",
    "Ability to work in a fast-paced, collaborative environment.",
    "Ability to organize multiple engineers, negotiate solutions, and provide upward communication.",
    "Consistency in demonstrating and upholding standards of coding, infrastructure, and process.",
    "Capable of high-velocity contributions.",
    "Ability to work on tasks which span multiple domains, requiring cross-team collaboration.",
    "Ability to deliver clear, concise, effective messages across different levels.",
    "Fosters a culture of mentoring and coaching across multiple technical teams and other stakeholders.",
    "Encourages sharing of opinions and contributes to discussions in a respectful manner."
  ],
  "qualifications": [
    "A Computer Science degree or comparable formal training, certification, or work experience.",
    "5+ years of experience in software development.",
    "Extensive experience in computer vision algorithms (e.g., CNNs, RNNs, image processing, feature extraction, customizing open-source models, etc.).",
    "High degree of personal accountability to self and team for continued growth.",
    "Ability to leverage Agile metrics to improve team performance and deliverables.",
    "Ability to evaluate and adjust resources, self, and team as necessary.",
    "Embraces risk, change, and helps team manage ambiguity within the team's scope of work.",
    "Ability to drive progress without having a complete picture and can articulate potential tradeoffs and prioritize when faced with ambiguity."
  ]
}