{
  "responsibilities": [
    "Work closely and collaboratively with engineers, PMs, designers, and data scientists to understand business needs and constraints to align on research goals.",
    "Develop appropriate study designs and execute in-person and remote user studies on a variety of Apple products and features.",
    "Extract insights about usability, user experience, and user sentiment from qualitative and quantitative data.",
    "Recommend product or feature improvements based on findings to engineering, design, PM, product marketing, and executives.",
    "Evolve research planning, processes, and tools to support efficient and impactful data collection and communication.",
    "Work autonomously and mentor other researchers to support the goals of the research organization."
  ],
  "skills": [
    "Ability to conduct human-centered research and analysis.",
    "Proficient in analyzing large amounts of qualitative and quantitative data to identify themes, trends, and other results.",
    "Ability to create visualizations and informative presentations to communicate data, insights, and recommendations effectively.",
    "Proficient using data analysis and visualization software, and/or programming languages for data analysis (e.g., Matlab, JMP, SPSS, Python, R, Tableau).",
    "Experienced using spreadsheet and presentation software (e.g., Numbers, Excel, Keynote, PowerPoint, Adobe Illustrator).",
    "Ability to develop novel approaches to researching complex user experience problems."
  ],
  "qualifications": [
    "BS/MS in behavioral/social sciences, such as psychology, neuroscience, human-computer interaction, human factors, or related field, or equivalent industry experience.",
    "7+ years of experience in human-centered research (in-person and remote) for consumer software and/or hardware products.",
    "Demonstrated experience designing and conducting user studies using established qualitative and quantitative methods.",
    "Ph.D. in behavioral/social sciences, such as psychology, neuroscience, human-computer interaction, human factors, or related field, or equivalent industry experience (preferred).",
    "Prior research experience with virtual assistants, speech recognition, natural language understanding, voice input, smart home devices, artificial intelligence, or machine learning (preferred).",
    "Prior experience working in user research labs with recording equipment and specialized tools such as vision or motion tracking and/or simulators (preferred).",
    "Previous experience as a Product Manager or Strategy Consultant (preferred)."
  ]
}