{
  "responsibilities": [
    "Develop and implement new AI models to solve high-value business problems.",
    "Utilize familiarity with state-of-the-art AI methods and tools to perform applied research.",
    "Adapt AI methods to new business problems and invent new methods for solving them, including machine learning, deep learning, reinforcement learning, natural language processing, computer vision, timeseries prediction, tabular data modeling, or pattern finding.",
    "Complete the full research cycle from academic literature survey, through performing the research, developing a proof of concept, and providing a production-ready model."
  ],
  "skills": [
    "Familiarity with state-of-the-art AI methods and tools.",
    "Ability to perform applied research and adapt AI methods to new business problems.",
    "Experience in machine learning, deep learning, reinforcement learning, natural language processing, computer vision, timeseries prediction, tabular data modeling, or pattern finding.",
    "Proficiency in developing algorithms for Reinforcement learning (Model-based or Model-free), Control for Gaussian Models, Neural-based control, Extremum Seeking adaptive methods, Identification in Nonlinear Systems (Parametric or Non-parametric), or Neural Ordinary Differential Equations.",
    "Experience in robotics in the manufacturing automation research domain.",
    "Proficiency in developing in Python and/or C++ languages and Linux.",
    "Intermediate to Advanced English Level."
  ],
  "qualifications": [
    "Ph.D. in Computer Science, Automatic Control, or any related field in progress, at least 75/100 completed.",
    "1+ years of experience in Machine Learning for Dynamics and Control applied to humanoid robots or robot manipulators.",
    "1+ or more publications in top-tier conference/journal focused on Control, Robotics, Machine Learning, etc.",
    "1+ years of experience in development of algorithms for Reinforcement learning, Control for Gaussian Models, Neural-based control, Extremum Seeking adaptive methods, Identification in Nonlinear Systems, or Neural Ordinary Differential Equations.",
    "1+ years of experience in robotics in the manufacturing automation research domain.",
    "2+ years of experience developing in Python and/or C++ languages and Linux.",
    "A candidate who accepts an offer of employment in Mexico is required to present their own personal identification information and numbers for the Mexican Security Number (NSS), Tax Identification Number (RFC), and CURP identification number."
  ]
}