{
  "responsibilities": [
    "Drive the design and architecture for generative AI tools like Copilot, M365 Copilot, and ChatGPT Enterprise.",
    "Review and assess generative AI use cases, align them to existing and planned tools, and maintain a generative AI roadmap of capabilities.",
    "Ensure alignment of generative AI tools to capabilities while considering cost vs productivity gains.",
    "Define technical requirements to onboard generative AI tools and lay out the process and framework for product evaluation, POC, valuation, and general availability.",
    "Partner with risk, legal, and compliance organizations to compile necessary approvals, governance, and acceptable use statements for generative AI tools.",
    "Build strong business relations with business partners and technology peers within the generative AI domain.",
    "Produce generative AI tool recommendations that align with Experian use cases.",
    "Partner with key GenAI vendors such as Microsoft and OpenAI.",
    "Communicate with senior technology leadership on generative AI strategy and submit use cases to governing bodies for approval.",
    "Design solutions to mitigate risks associated with generative AI tools, including security controls, and address audit findings.",
    "Ensure generative AI solutions comply with internal security, industry standards, and regulations."
  ],
  "skills": [
    "Ability to translate business needs into technical architecture requirements.",
    "Familiarity with the Enterprise Microsoft portfolio (Active Directory, Azure, EntraID, InTune, M365).",
    "Familiarity with cloud platforms (AWS, Azure, Google Cloud).",
    "Familiarity with containerization technologies (Docker, Kubernetes).",
    "Knowledge of software development methodologies."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, related technical discipline, or equivalent experience.",
    "8+ years of related experience using end-user computing productivity tools."
  ]
}