{
  "responsibilities": [
    "Write and test product or system development code.",
    "Collaborate with peers and stakeholders through design and code reviews to ensure best practices amongst available technologies.",
    "Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.",
    "Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.",
    "Design and implement solutions in one or more specialized ML areas, leverage ML infrastructure, and demonstrate expertise in a chosen field."
  ],
  "skills": [
    "Proficiency in software development in one or more programming languages.",
    "Knowledge of data structures and algorithms.",
    "Experience in testing, maintaining, or launching software products.",
    "Understanding of software design and architecture.",
    "Expertise in speech/audio technology, reinforcement learning, ML infrastructure, or another ML field.",
    "Ability to develop accessible technologies.",
    "Versatility and leadership qualities.",
    "Enthusiasm for tackling new problems across the full-stack."
  ],
  "qualifications": [
    "Bachelor’s degree or equivalent practical experience.",
    "5 years of experience with software development in one or more programming languages, and with data structures/algorithms.",
    "3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture.",
    "3 years of experience with one or more of the following: Speech/audio technology, reinforcement learning, ML infrastructure, or specialization in another ML field.",
    "3 years of experience with ML infrastructure (e.g., model deployment, model evaluation, optimization, data processing, debugging).",
    "Preferred: Master's degree or PhD in Computer Science or related technical field.",
    "Preferred: 1 year of experience in a technical leadership role."
  ]
}