{
  "responsibilities": [
    "Lead and provide technical guidance to a team of machine learning engineers working on complex machine learning integration projects.",
    "Design and implement scalable and efficient integrations with popular machine learning frameworks, such as PyTorch, while ensuring compatibility with future frameworks.",
    "Analyze the characteristics of various ML models to make informed design decisions for scalable, intuitive, and user-friendly APIs.",
    "Optimize software to accelerate ML model training and ensure high throughput and low latency during inference.",
    "Stay up-to-date with advancements in machine learning and deep learning, and apply state-of-the-art techniques to enhance solutions.",
    "Evaluate trade-offs between different approaches, clearly articulate design choices, and develop detailed proposals for implementing new features.",
    "Build and maintain robust automated test suites to ensure software quality, performance, and reliability.",
    "Contribute to an agile team environment by delivering high-quality software and adhering to agile development practices.",
    "Collaborate with cross-functional teams, including compiler engineers, kernel developers, and system architects, to integrate ML capabilities seamlessly into products and services."
  ],
  "skills": [
    "Proficiency in Python for building and maintaining scalable systems.",
    "Advanced proficiency in C++, with an emphasis on multi-threaded programming, performance optimization, and system-level development.",
    "Hands-on experience with ML frameworks such as PyTorch, TensorFlow, or JAX, and a strong understanding of their underlying architectures.",
    "Solid understanding of software architectural patterns for large-scale, high-performance applications.",
    "Proven experience leading and mentoring software or machine learning engineers.",
    "In-depth knowledge of machine learning algorithms, theory, and best practices for developing production-ready software.",
    "Strong problem-solving skills, with the ability to balance technical depth with practical implementation constraints.",
    "Exceptional communication and presentation skills, with the ability to work both independently and collaboratively across multidisciplinary teams."
  ],
  "qualifications": [
    "Bachelor’s, Master’s, or PhD in Computer Science, Computer Engineering, Mathematics, or a related field.",
    "5+ years of experience in large-scale software engineering, with a focus on deep learning or related domains."
  ]
}