{
  "responsibilities": [
    "Lead project-based teams in a client-facing role to analyze large data sets and derive insights through ML and AI techniques.",
    "Act as the primary architect and technical lead on projects to scope and estimate work streams.",
    "Architect and model technical solutions to meet business requirements.",
    "Serve as a technical expert in client communications.",
    "Participate in design sessions and provision environments.",
    "Coach and lead junior resources on projects."
  ],
  "skills": [
    "Proficiency in programming languages such as Python, TensorFlow, PyTorch, or Hugging Face Transformers for model development and experimentation.",
    "Strong understanding of NLP fundamentals, including tokenization, word embeddings, language modeling, sequence labeling, and text generation.",
    "Experience with data processing using LangChain, data embedding using LLMs, Vector databases, and prompt engineering.",
    "Advanced knowledge of relational and non-relational databases (SQL, NoSQL).",
    "Proficient in large-scale distributed systems (Hadoop, Spark, etc.).",
    "Experience with designing and presenting compelling insights using visualization tools (RShiny, R, Python, Tableau, Power BI, D3.js, etc.).",
    "Passion for leading teams and providing both formal and informal mentorship.",
    "Experience with wrangling, exploring, transforming, and analyzing datasets of varying size and complexity.",
    "Knowledgeable of tools and processes to monitor model performance and data quality, including model tuning experience.",
    "Strong communication and interpersonal skills, and the ability to engage customers at a business level in addition to a technical level.",
    "Stay current with AI/ML trends and research; be a thought leader in AI area."
  ],
  "qualifications": [
    "8+ years of proven experience in the architecture, design, and implementation of large scale and enterprise grade AI/ML solutions, including hands-on statistical modeling and/or analytical experience in an industry or consulting setting.",
    "Master’s degree in statistics, mathematics, computer science, or related field (a PhD is preferred).",
    "Experience with a variety of ML and AI techniques (e.g., multivariate/logistic regression models, cluster analysis, predictive modeling, neural networks, deep learning, pricing models, decision trees, ensemble methods, etc.).",
    "Experience with implementing machine learning models in production environments through one or more cloud platforms: Google Cloud Platform, Azure cloud services, AWS cloud services.",
    "Thrive in a fast-paced, dynamic, client-facing role where delivering solid work products to exceed high expectations is a measure of success.",
    "Contribute in a team-oriented environment.",
    "Prioritize multiple tasks in order to consistently meet deadlines.",
    "Creatively solve problems in an analytical environment.",
    "Adapt to new environments, people, technologies, and processes.",
    "Excel in leadership, communication, and interpersonal skills.",
    "Establish strong work relationships with clients and team members.",
    "Generate ideas and understand different points of view."
  ]
}