{
  "responsibilities": [
    "Apply machine learning/deep learning to the automotive industry, including areas such as autonomous driving, manufacturing, and material design.",
    "Maintain and enhance existing machine learning modules.",
    "Design and implement new machine learning-based approaches based on existing frameworks.",
    "Keep up to speed with the state of the art of academic research and technology in the industry.",
    "Transfer technologies and solutions to Volkswagen Group.",
    "Integrate new software modules into the framework.",
    "Test developed modules in the prototype (unit tests, integration tests, in-vehicle/field tests, etc.).",
    "Analyze and evaluate conducted tests.",
    "Develop technical specifications and documentation."
  ],
  "skills": [
    "Strong communication skills - ability to explain complex technical topics to non-experts.",
    "Team player with good collaboration and integration skills – joining people, processes, and systems.",
    "Highly innovative and capable of seeing problems and potential solutions in a new light.",
    "Able to work in a dynamic, multi-disciplinary, time-line, and target-oriented work environment.",
    "Problem-solving skills.",
    "Analytical skills.",
    "Conceptual thinking skills.",
    "Background in Deep Neural Network Learning, Computer Vision, and Machine Learning.",
    "Strong programming skills with Python and TensorFlow on desktops, embedded, and distributed backends (e.g., AWS).",
    "Experience with data gathering, data quality, system architecture, coding best practices.",
    "Take initiative to launch projects with the ability to quickly learn and develop own ideas in an interdisciplinary environment.",
    "Extracting high-level logical structure from low-level, multi-dimensional data.",
    "Experience with CNNs, RNN, LSTMs, and the latest research trends.",
    "Specification/Documentation of interfaces between software modules.",
    "Graphical Models.",
    "Object Detection, NLP, Scene Understanding.",
    "Experience with C++, CUDA, OpenCV, and Matlab.",
    "Big Data and cloud experience strongly preferred.",
    "C++ & GPU Programming.",
    "Passion for cars or physical products."
  ],
  "qualifications": [
    "5+ years or equivalent experience.",
    "Master’s Degree in Computer Science or equivalent (required).",
    "PhD (desired).",
    "Background or strong interest in automotive Engineering."
  ]
}