{
  "responsibilities": [
    "Troubleshoot advanced system and operational issues.",
    "Monitor health of automated adapters, vertical lifts, and automated robotic vehicles.",
    "Communicate technical concepts clearly and concisely to site teams and customers.",
    "Document and report issues to engineering teams and work with them on solutions.",
    "Assist in escalation as required to support teams to solve production impacting problems.",
    "Participate in initiatives for continuous improvement, standardization, and improvement of the warehouse automation solution.",
    "Ensure safety commitments in compliance with OSHA, Symbotic, and customer processes and procedures are met daily."
  ],
  "skills": [
    "Familiarity with PLC (Allen Bradley, Siemens), Robot (ABB), and software languages (SQL, Linux, Python).",
    "Knowledge of industry standard continuous improvement and operational excellence practices.",
    "Excellent hands-on experience with assembling, operating, and troubleshooting robotics and electro-mechanical systems.",
    "Ability to learn new equipment and assist team members as needed.",
    "Excellent written, verbal, and visual presentation communication skills.",
    "Ability to assist other team members with physical work as necessary."
  ],
  "qualifications": [
    "Currently pursuing a bachelor’s degree in electrical engineering, mechanical engineering, or related field.",
    "Must be able to work at heights of up to 45 feet and within restrictive areas of 24 inches.",
    "Capable of working in temperatures ranging from 105° to 32° Fahrenheit.",
    "Frequent ability to safely and efficiently lift items weighing up to 60lbs and move items weighing up to 80lbs.",
    "Ability to stand/walk for up to 8 hours.",
    "Capable of occasional and/or continuous feeling, seeing, hearing, bending, twisting, stooping, pushing, pulling, balancing, gripping, climbing, crawling, sitting, handling objects, and repetitive movement using both hands and feet."
  ]
}