{
  "responsibilities": [
    "Collaborate with perception and vision experts on algorithm design, prototyping, testing, deployment, and productization.",
    "Collaborate on writing internal specifications related to vision architecture and providing input and recommendation on hardware sensor technology for optimal implementations.",
    "Design and develop vision software utilizing C and C++ on embedded Linux environments following company and industry requirements and best practices.",
    "Responsible for the analysis, design, programming, optimizing, debugging, and modification of software programs related to vision algorithms.",
    "Write code, complete programming, and perform testing and debugging of applications using current programming language and technologies controlling hardware for hospital automation.",
    "Perform software verification including code reviews, writing unit test cases, creating, and implementing automated testing, and running static analysis.",
    "Lead and solve complex vision integration issues by analyzing critical factors and recommending corrective or alternative actions and resolutions.",
    "Proactively maintain accurate documentation of concepts, designs, and implementations and a means to facilitate design reviews, and knowledge sharing among the team and stakeholders.",
    "Interface with other engineers to define software design and state machine requirements.",
    "Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors.",
    "Support, update, and create new SW architectures to further feature development and existing system functionality."
  ],
  "skills": [
    "Experience and/or knowledge in characterizing and calibrating camera images sensors, optics, and illumination sources.",
    "Experience using C++ in a Linux environment with embedded systems.",
    "Strong analytical and problem-solving skills.",
    "Drives design of complex features and new products.",
    "Contributes to vision/imaging technology strategy.",
    "Owns direction, technical vision, and strategy direction across multiple projects.",
    "Often serves as a consultant to management and external spokesperson for the SW organization related to vision implementations, feasibility, or prototyping efforts.",
    "Good interpersonal communication skills, working within an Agile Development framework.",
    "Ability to work independently with high competency and little guidance."
  ],
  "qualifications": [
    "Bachelor’s degree in computer science, Computer Engineering, relevant technical field, or equivalent practical experience.",
    "MS degree in Computer Science, Computer Vision or related technical field.",
    "8+ years of experience as software or firmware developer along with integration experience with Hardware and Software.",
    "Minimum 5 years of imaging experience.",
    "Experience developing and deployment of computer vision models or image recognition technologies and algorithms.",
    "Experience with light sources, optics and multi sensor data for optimal image processing.",
    "Ability to own direction, technical vision and strategy direction across multiple projects.",
    "Knowledge and/or experience with state machines and stateless systems.",
    "Experience in the medical device industry or other industries operating under a quality management system. Knowledge of ISO 13485, ISO 14971, ISO 62304 and CFR 820 a plus.",
    "Experience in the design of software driven electromechanical Class II medical devices.",
    "Experience with JIRA.",
    "PhD degree in Computer Science, Computer Vision, Robotics or related technical field.",
    "Developing and designing Computer Vision technologies and systems for running on edge devices (custom hardware).",
    "Experience with Matrox Imaging Library.",
    "Experience with SwiftDecoder and COIL Barcode Parsing."
  ]
}