{
  "responsibilities": [
    "Work in a multidisciplinary team focused on creating new applications dedicated to Data Analytics.",
    "Participate with stakeholders to gather requirements, develop solutions, and create stories.",
    "Create schedules, track progress, manage priorities, and ensure they are communicated and harmonized.",
    "Act as an ambassador of change and inspire stakeholders to adopt new applications in their day-to-day activities.",
    "Establish and track key performance indicators (KPIs) related to project progress, user adoption, and satisfaction.",
    "Provide regular reports on progress and outcomes to stakeholders.",
    "Identify and address resistance to change by working with individuals and teams to understand their concerns and provide solutions.",
    "Prepare and present visibility reports at various governance levels to different layers of the organization.",
    "Actively support the improvement projects of processes and tools.",
    "Analyze large amounts of data to identify trends for efficient decision-making."
  ],
  "skills": [
    "Professional attitude and superior communication skills.",
    "Excellent organizational and time management skills.",
    "Foresight, accuracy, attention to detail, and commitment to objectives and responsibilities.",
    "Proactive attitude and ability to manage multiple priorities.",
    "Strategic mind and attention to detail.",
    "Self-motivated, autonomous, and enthusiastic.",
    "Ability to work willingly and independently in a fast-paced, challenging environment.",
    "Effective problem-solving skills with the ability to make good decisions to move projects along.",
    "Good computing skills; proficiency in MS Office (PowerBI, MS Excel, MS Project, SharePoint)."
  ],
  "qualifications": [
    "Bachelor’s degree in computer science, engineering, information systems, aerospace, or a related field.",
    "Minimum of 10 years in data engineering.",
    "Education and experience in project management (PMP certification is an asset).",
    "Experience in technology or software development lifecycle or in database management (Python and SQL).",
    "Good knowledge in Machine Learning and AI (asset).",
    "Sound aircraft engineering and/or operations experience."
  ]
}