{
  "responsibilities": [
    "Collaborate with researchers, including faculty, staff, and students, to support their scholarly work.",
    "Offer technical expertise in research design, survey methodology, coding, and automation.",
    "Provide tailored solutions using Qualtrics, REDCap, and other data collection tools as necessary.",
    "Work within a team that supports all phases of the data lifecycle for quantitative, qualitative, and geospatial research.",
    "Partner closely with Data Services, Research Technology Services, NYU Libraries, faculty members, and researchers.",
    "Handle referrals, develop services, implement technology, and establish standards.",
    "Collect and present usage and resource health metrics.",
    "Manage resources and oversee projects."
  ],
  "skills": [
    "Excellent verbal and written communication, organizational, and interpersonal skills.",
    "Ability to work courteously and effectively with users and colleagues in a collaborative team environment.",
    "Proficiency with commonly used survey research methods.",
    "Aptitude for detail, with a commitment to accuracy and follow-through.",
    "Ability to work on independent projects, manage multiple priorities, and meet deadlines.",
    "Proficiency in a database-related coding language, such as SQL, Java, Python, or another relevant language.",
    "Experience with API programming for automation and integration tasks.",
    "Familiarity with cloud services, preferably AWS.",
    "Understanding of data privacy principles, data security practices, and compliance regulations."
  ],
  "qualifications": [
    "Bachelor's Degree or equivalent.",
    "Preferred: Master's Degree in computer science, statistics, data science, mathematics, psychology, public health, or a related field.",
    "5+ years experience in application support, development, or system administration or an equivalent combination of education and experience.",
    "Experience in conducting or assisting with research design and development using web survey tools/data collection tools such as Qualtrics and REDCap.",
    "Preferred: 2+ years experience designing, developing, and implementing database systems using data collection tools such as Qualtrics and REDCap.",
    "Skilled in coding and automation with a deep understanding of data accuracy, privacy, security, and validation.",
    "Experience in an academic environment, preferably within IT or a research lab/unit."
  ]
}