{
  "responsibilities": [
    "Lead novel research in advanced computing and applied machine learning.",
    "Lead interdisciplinary teams to turn research results into prototype operational capabilities for government customers and stakeholders.",
    "Conduct rapid prototyping to demonstrate and evaluate technologies in relevant environments.",
    "Test and evaluate new and novel systems for performance and usability.",
    "Collaborate with researchers, developers, engineers, designers, technical leads, campus labs, and government customers to understand challenges, needs, and potential solutions.",
    "Mentor and teach junior staff, lead design sessions, and establish technical norms for the division.",
    "Explore the latest in advanced hardware, including FPGAs, CGRAs, TPUs, and emergent technologies such as neuromorphic and analog processors.",
    "Work with division leadership and colleagues to plan, develop, expand, and carry out an overall research strategy, and influence the national research agenda regarding future technology.",
    "Develop and deliver compelling technical presentations for diverse audiences, tailor content for varied stakeholders, speak at conferences and workshops, and publish in pertinent peer-reviewed journals."
  ],
  "skills": [
    "Mastery of C/C++, Python, Verilog/VHDL, and/or other pertinent languages and software tools and frameworks.",
    "Experience leading research projects and collaborating across research teams and mentoring other researchers.",
    "Experience writing and delivering successful research proposals to funding agencies and leading the resulting projects.",
    "Experience working with Department of Defense and Intelligence Community.",
    "Familiarity with emerging trends and opportunities in industry and government."
  ],
  "qualifications": [
    "BS in Electrical Engineering, Computer Science, or related discipline with ten (10) years of experience; OR MS in the same fields with eight (8) years of experience; OR PhD with five (5) years of experience.",
    "Able to travel to the Arlington SEI office, sponsor sites, conferences, and offsite meetings on occasion. Moderate (25%) travel outside of home location.",
    "Subject to a background check investigation and need to obtain and maintain a Department of Defense security clearance.",
    "Legally authorized to work for CMU in the United States. CMU will not sponsor or take over sponsorship of an employment visa for this opportunity.",
    "A published track record of conducting research and applying scientific methods."
  ]
}