{
  "responsibilities": [
    "Build and deploy Lattice, the foundation for Anduril's defense technology systems.",
    "Work on platform engineering roles, including core infrastructure, distributed systems, web development, and networking.",
    "Collaborate with team members and partners in the autonomy domain to develop and deploy autonomous systems at scale.",
    "Build and integrate model/software/hardware-in-the-loop components using first and third-party technologies.",
    "Deliver novel software capabilities by working with customers."
  ],
  "skills": [
    "Proficiency in a variety of programming languages such as Rust, Go, C++, Java, Python, JavaScript/TypeScript.",
    "Experience with industry-standard cloud platforms (AWS, Azure), CI/CD tools, and software infrastructure fundamentals.",
    "Ability to quickly understand and navigate complex systems and established code bases.",
    "Experience building scalable backend software systems with various data storage and processing requirements.",
    "Familiarity with modern build and deployment tooling (e.g., NixOS, Terraform).",
    "Understanding of how computers and networks work, from a single desktop to a multi-cluster cloud node.",
    "Experience implementing robot or autonomous vehicle testing frameworks in a software-in-the-loop or hardware-in-the-loop environment.",
    "Familiarity with industry-standard monitoring, logging, and data management tools and best practices.",
    "A bias towards rapid delivery and iteration."
  ],
  "qualifications": [
    "At least 3+ years of experience working with a variety of programming languages.",
    "Experience working with customers to deliver novel software capabilities.",
    "U.S. Person status due to required access to U.S. export-controlled information.",
    "Previous experience working in an engineering setting, such as a startup or startup-like environment.",
    "Professional software development lifecycle experience using tools such as version control and CICD systems.",
    "Experience designing complex software systems and iterating upon designs via a technical design review process."
  ]
}