{
  "responsibilities": [
    "Drive quality engineering for software products.",
    "Build quality frameworks and develop test automation and tools.",
    "Lead quality engineering and testing for a portfolio of corporate systems products.",
    "Define and drive test approaches and test plans for assigned projects and functional test areas.",
    "Expand current test cases and execute required tests.",
    "Own quality for functional or application areas.",
    "Define qualification strategies and execute functional and nonfunctional testing.",
    "Coordinate testing efforts for complex client and server feature sets.",
    "Partner with development and other teams to plan and deliver quality software."
  ],
  "skills": [
    "Strong technical background with hands-on experience in software QA/QE.",
    "Experience in building test automation frameworks and business use-case testing.",
    "Proficiency in Java and scripting languages (Perl, PHP, Python, etc).",
    "Experience with Linux platforms and relational databases.",
    "Strong analytical problem-solving skills.",
    "Proven bug detection and regression skills.",
    "Experience testing on MacOS, iOS (mobile apps), and cloud-based technologies.",
    "Excellent written and verbal communication skills.",
    "Ability to work in a fast-paced environment.",
    "Experience with AI/ML in quality engineering, using tools like Selenium with ML add-ons.",
    "Familiarity with machine learning libraries (e.g., TensorFlow, PyTorch).",
    "Strong understanding of the ServiceNow platform, including modules like ITSM, ITOM, and custom workflows."
  ],
  "qualifications": [
    "7+ years of related hands-on experience in software QA/QE.",
    "4+ years driving quality focused on automation, building tools, and QA testing.",
    "4+ years experience building test automation frameworks and business use-case testing.",
    "4+ years experience in Java and scripting languages & Linux platforms and relational databases.",
    "Solid experience working with remote teams situated in different time zones.",
    "1+ years of software development experience is highly desirable.",
    "Experience with AI/ML in quality engineering is desirable.",
    "ServiceNow Application Developer certification is a plus.",
    "2+ years of experience in Quality Engineering, with a focus on ServiceNow applications."
  ]
}