{
  "responsibilities": [
    "Teach appropriate related courses at the bachelor's, master's, and doctoral levels, including selection and preparation of class materials.",
    "Achieve and maintain qualified status per AACSB Guidelines.",
    "Maintain academic proficiency in the teaching discipline by demonstrating scholarly interests.",
    "Supervise other instructional activities as requested.",
    "Write new courses and curricula, develop and/or enhance curricular innovations, and supervise doctoral dissertations, master's thesis, directed independent studies, projects, etc.",
    "Provide service to the Huizenga College and University, including preparing accreditation documents, reviewing journal articles, providing leadership in associations, assisting in recruitment, and serving on committees.",
    "Create a positive and conducive learning environment for students.",
    "Provide coaching, mentoring, and guidance to students.",
    "Submit annually a portfolio of accomplishments to the Dean.",
    "Adaptability to teach courses at the discretion of the Dean.",
    "Travel locally, nationally, or internationally for teaching and other academic activities."
  ],
  "skills": [
    "Ability to effectively present information in English to students, public groups, and professional organizations.",
    "Ability to teach in all modalities used by the Huizenga College, either on ground or online.",
    "Ability to work collegially and cooperatively with other faculty, administration, students, and others.",
    "Display behavior consistent with professional ethics and the NSU Employee Handbook.",
    "Ability to review, understand, and apply concepts from training programs, conferences, and professional literature.",
    "Demonstrated research, writing, and publication history or capability."
  ],
  "qualifications": [
    "Doctoral Degree.",
    "Teaching experience and academic qualifications commensurate with the rank of Assistant Professor.",
    "Membership in professional societies, organizations, and associations."
  ]
}