{
  "responsibilities": [
    "Collaborate with customers and partners on key engagements.",
    "Develop and deliver proof-of-concept projects and technical workshops.",
    "Support implementation projects focused on customer solutions such as Data and Analytics, AI, GenAI, ML, and HPC.",
    "Work with AWS offerings like Amazon Kinesis, AWS Glue, Amazon Redshift, Amazon EMR, Amazon Athena, Amazon SageMaker, Amazon Bedrock, Amazon Q, and Amazon Lex.",
    "Help customers and partners remove constraints to leverage data for business insights.",
    "Create white papers, write blogs, build demos, and other reusable collateral for customers.",
    "Work closely with Solution Architects, Data Scientists, and Service Engineering teams.",
    "Engage in a wide variety of projects for customers and partners.",
    "Collaborate across the AWS organization to deliver solutions and drive feature innovation."
  ],
  "skills": [
    "Extensive experience with design, development, and operations using modern data services.",
    "Knowledge in the use of technologies like DynamoDB, Amazon Kinesis, Apache Kafka, Apache Spark, Amazon Sagemaker, and Amazon RDS.",
    "Hands-on experience with building data or machine learning pipelines.",
    "Experience with tools like SQL, PostgreSQL, Data lake, DynamoDB, and Hadoop.",
    "Experience with implementation and performance tuning of Kinesis, Kafka, Spark, or similar technologies.",
    "Familiarity with machine learning concepts.",
    "Experience working on large-scale data science/data analytics projects.",
    "Experience implementing AWS services in distributed computing environments.",
    "Experience with distributed Machine Learning and Deep Learning frameworks like TensorFlow, PyTorch, MxNet, Caffe, and Keras.",
    "Experience building large-scale machine-learning infrastructure.",
    "Experience defining system architectures and exploring technical feasibility trade-offs.",
    "Experience developing cloud software services with a focus on scalability, performance, and reliability.",
    "Ability to prototype and evaluate applications and interaction methodologies.",
    "Experience with AWS technology stack.",
    "Written and verbal technical communication skills."
  ],
  "qualifications": [
    "Bachelor’s degree or higher in Computer Science, Engineering, Mathematics, or a related field with a conferral date within May 2023 to May 2025.",
    "1+ years of hands-on experience programming in languages such as Python, Ruby, Go, Swift, Java, .Net, C++, Node.js, or similar object-oriented language.",
    "1+ years of experience in Data platform implementation.",
    "Masters or PhD in Computer Science, Physics, Engineering, or Math (preferred).",
    "AWS Certification(s) such as Solutions Architect Associate, Data Analytics Specialty, and/or Machine Learning Specialty."
  ]
}