{
  "responsibilities": [
    "Establishes collaborative relationships with relevant product and business groups inside or outside of Microsoft and provides expertise or technology to create business impact.",
    "Takes initiative and drives activities such as technology transfers, standards organizations, filing patents, authoring white papers, developing or maintaining tools/services for internal Microsoft use, or consulting for product or business groups.",
    "Brings new technology and approaches into production by applying long-term research efforts to solve immediate product needs.",
    "Collaborates with and bridges the gap between researchers and development teams.",
    "Negotiates across teams to ensure cutting-edge technology is applied to products in a practical way that meets key business objectives.",
    "Independently works to create product impact by identifying approach and applying, improving, or creating a research-backed solution.",
    "Serves as an expert within the product domain, gaining deep knowledge in a complex or highly ambiguous service, platform, or domain.",
    "Shares knowledge of changes in industry trends and advances in applied technologies with engineers and product teams.",
    "Reviews business and product requirements and incorporates state-of-the-art research or previously tested solutions to formulate plans that will meet business goals.",
    "Identifies problems and develops strategy to resolve team or feature level problems.",
    "Provides strategic direction for the kinds of data used to solve problems."
  ],
  "skills": [
    "Ability to establish collaborative relationships and provide expertise or technology for business impact.",
    "Initiative in driving technology transfers, standards organizations, and other impactful activities.",
    "Ability to bring new technology and approaches into production.",
    "Collaboration skills to bridge the gap between researchers and development teams.",
    "Negotiation skills to ensure technology is applied practically to meet business objectives.",
    "Independent problem-solving skills to create product impact.",
    "Expertise in a complex or highly ambiguous service, platform, or domain.",
    "Knowledge sharing of industry trends and advances in applied technologies.",
    "Ability to review and incorporate state-of-the-art research into business and product requirements.",
    "Strategic direction skills for data usage in problem-solving."
  ],
  "qualifications": [
    "Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 4+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 3+ years related experience OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience OR equivalent experience.",
    "Ability to meet Microsoft, customer, and/or government security screening requirements, including passing the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.",
    "Preferred: Master's or Doctorate in relevant fields with related experience.",
    "Experience creating publications (e.g., patents, libraries, peer-reviewed academic papers).",
    "Experience presenting at conferences or other events as an invited speaker.",
    "Experience conducting research as part of a research program in academic or industry settings.",
    "Experience developing and deploying live production systems as part of a product team.",
    "Experience developing and deploying products or systems at multiple points in the product cycle from ideation to shipping."
  ]
}