{
  "responsibilities": [
    "Deploy and maintain CI/CD and software release pipelines across multiple environments and continuously improve testing frameworks, development tooling, and deployment best practices.",
    "Define and build deployment strategy for SaaS-hosted, on-prem, and managed service offerings.",
    "Build and maintain Snorkel’s production and staging infrastructure, own k8s and cloud strategy.",
    "Design, develop, and maintain observability, alarms, and monitoring tools.",
    "Participate in on-call responsibilities in rotation with the engineering team.",
    "Work a hybrid schedule with three days per week in the Redwood City HQ or the SF office and work remotely with \"No Meeting\" Tuesdays and Thursdays."
  ],
  "skills": [
    "Strong experience with cloud platforms and infrastructure as code (Terraform, CloudFormation, Helm).",
    "Deep expertise in building services on Kubernetes (EKS, GKE, etc.).",
    "Strong development experience in Python or other languages like Java, Golang, Scala, etc.",
    "Extremely well-versed in building and managing cloud infrastructure for enterprise platforms on AWS, GCP, Azure, and services like EC2, EKS, VPC, etc.",
    "Experience in one or more build tools like Bazel, Gradle, Make, etc.",
    "Designed and implemented developer-friendly APIs or tools to boost developer productivity.",
    "Familiarity with deployment, monitoring, and maintenance of large-scale enterprise software products.",
    "Experience working cross-functionally across teams including product, design, customer success, and support.",
    "Familiarity in developing and releasing infrastructure software for SaaS and on-prem platforms.",
    "Hands-on experience setting up and operating Kubernetes clusters in production at scale (Nice to have).",
    "Experience leading teams building large-scale distributed computing systems for ML Training or Serving, e.g., Ray, Spark, TensorFlow, etc. (Nice to have).",
    "Hands-on experience in creating and maintaining metrics and dashboards on observability platforms such as New Relic, DataDog, Chronosphere, or similar tools (Nice to have).",
    "Experience building services and infrastructure for Machine Learning and AI Systems (Nice to have)."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science or related field, or equivalent demonstrated experience.",
    "8+ years of experience in distributed systems and cloud-native applications.",
    "Proven ability to lead and mentor teams of engineers.",
    "Regularly follows the best software engineering practices and holds a high bar for the team by leading design, code review, and test plan reviews.",
    "Have a voracious and intrinsic desire to learn and fill in missing skills—and an equally strong talent for sharing learnings clearly and concisely with others."
  ]
}