{
  "responsibilities": [
    "Develop new and enhance current risk models and applications for Nationwide’s investment portfolios.",
    "Develop quantitative analytics and signals using advanced statistical, quantitative, or econometric techniques.",
    "Develop predictive models to inform asset allocation or security selection using machine learning and other quantitative techniques.",
    "Assist in implementation and delivery of analytics to different areas of investments.",
    "Work closely with portfolio managers and traders to perform advanced quantitative analyses and model development.",
    "Research the best industry practice in risk management and portfolio management.",
    "Conduct scenario analysis/Stress Test/Cycle Analysis/Factor Analysis/Performance Attribution.",
    "Understand and assess key business needs and proactively own the strategic development of quantitative modeling solutions.",
    "Collaborate with organizational departments or business functions to accomplish strategic goals.",
    "Build risk analytic strategies for business problems through collaboration and consultation.",
    "Lead in the understanding and analysis of models across the enterprise.",
    "Craft clear and concise summaries of findings and recommendations.",
    "Drive business value through crafting and communicating strategic business solutions to leaders.",
    "Lead all aspects of development, testing, implementation, and administration of quantitative modeling processes and tools.",
    "Evaluate and rank quantitative solutions to business problems.",
    "Lead communication of the key benefits and limitations of sophisticated modeling tools for business applications.",
    "Lead governance of modeling tools and ensure they are applied consistently."
  ],
  "skills": [
    "Proven analytical, mathematical, and problem-solving skills.",
    "Strong programming skills including Python, Spark, SQL, or similar programming languages.",
    "Expertise in data engineering with hands-on experience using tools such as Databricks, Azure, or AWS.",
    "Strong knowledge and understanding of fixed income, investments, and risk analytics.",
    "Strong knowledge of machine-learning and its applications.",
    "Ability to manipulate and work with large datasets.",
    "Excellent interpersonal and communication skills.",
    "Strong teamwork skills, attention to detail, and ability to multi-task.",
    "Sophisticated communication and presentation skills.",
    "Advanced proficiency with Excel and Powerpoint."
  ],
  "qualifications": [
    "5 years+ of investment/risk management/quantitative modeling experience.",
    "Graduate work may be substituted for work experience as appropriate.",
    "Undergraduate studies in finance, accounting, economics, statistics, mathematics, or related subject area required.",
    "Graduate-level studies in a related field with advanced degree highly desirable.",
    "Progress toward FCAS, FSA, CQF, CFA, or similar preferred.",
    "Proven knowledge of processes and functions spanning the insurance and risk management cycle.",
    "Understanding of machine learning, stochastic processes, Monte Carlo simulations, sampling methods, and other statistical techniques.",
    "Confirmed mathematical knowledge of specialized risk models.",
    "Advanced understanding of risk management operations such as asset-liability management, portfolio risk assessment, hedging, etc."
  ]
}