{
  "responsibilities": [
    "Partner with various NBCUniversal businesses, enterprise IT, and Cyber Security organization to ensure technology is designed and deployed securely.",
    "Function as a security subject matter expert with broad knowledge across various domains.",
    "Embed with engineering teams delivering solutions for NBCUniversal.",
    "Focus on security controls applicable to AI systems and other emerging technologies.",
    "Develop threat models and control strategies integrated into the design, development, and operation of new and evolving technology platforms.",
    "Collaborate across the Cyber organization and partner with business stakeholders to provide security guidance and/or mitigation requirements.",
    "Communicate the importance of key Cyber programs and services to obtain support, trust, and buy-in from business and technology teams."
  ],
  "skills": [
    "Ability to explain common threats to components including Network, Cloud, Web, and Application environments.",
    "Knowledge of best practices in the Cyber Security industry, including OWASP Top 10 and CWE/SANS Top 25.",
    "Advanced technical knowledge in one or more security domains.",
    "Strong written/verbal communication and presentation skills.",
    "Ability to give and receive constructive feedback in a team environment.",
    "Willingness to provide mentorship to more junior members of the team.",
    "Constant learner, actively experimenting and working with new technologies.",
    "Experience developing and documenting security guidelines or security best practices.",
    "Excellent time management skills to prioritize multiple concurrent projects."
  ],
  "qualifications": [
    "8+ years of experience partnering with business and technical teams to architect secure products.",
    "Some knowledge and awareness of ML and generative AI technologies, including common security concerns and mitigations.",
    "Experience performing Threat Analysis and modeling leveraging best in industry frameworks such as MITRE ATT&CK.",
    "Familiarity with security control frameworks such as Cloud Security Matrix, NIST CSF, CIS Critical Security Controls.",
    "In-depth knowledge of generative AI platforms such as Azure OpenAI services and various models including GPT-4, Llama, Midjourney.",
    "Understanding of various data and privacy regulations, including PCI DSS, SOX, HIPAA, GDPR, CCPA.",
    "In-depth knowledge of common Cloud services and platforms (IaaS, PaaS, SaaS).",
    "A firm understanding of Cybersecurity Engineering/Operations, Incident Response, and GRC functions.",
    "Empathy for engineering teams with the ability to balance security guidelines and policies with operational needs.",
    "Formal Degree is not required, relevant experience in the above-mentioned areas prioritized."
  ]
}