{
  "responsibilities": [
    "Write product or system development code.",
    "Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.",
    "Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).",
    "Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.",
    "Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality."
  ],
  "skills": [
    "Software development in one or more programming languages.",
    "Knowledge of data structures or algorithms.",
    "Experience with machine learning algorithms and tools (e.g., TensorFlow), artificial intelligence.",
    "Experience in Generative AI (Large Language Models, Multi-Modal, Large Vision Models).",
    "Programming with Python.",
    "Performance, large scale systems data analysis, visualization tools, or debugging.",
    "Developing accessible technologies.",
    "Code and system health, diagnosis and resolution, and software test engineering."
  ],
  "qualifications": [
    "Bachelor’s degree or equivalent practical experience.",
    "2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting.",
    "2 years of experience with data structures or algorithms in either an academic or industry setting.",
    "2 years of experience with machine learning algorithms and tools (e.g., TensorFlow), artificial intelligence.",
    "Experience in Generative AI (Large Language Models, Multi-Modal, Large Vision Models).",
    "Experience in programming with Python.",
    "Master’s degree or PhD in Computer Science or related technical field (preferred).",
    "2 years of experience with performance, large scale systems data analysis, visualization tools, or debugging (preferred).",
    "Experience developing accessible technologies (preferred).",
    "Experience in code and system health, diagnosis and resolution, and software test engineering (preferred)."
  ]
}