{
  "responsibilities": [
    "Drive customer outcomes, roadmap, and value realization for GenAI technology through hands-on delivery of ServiceNow’s GenAI capabilities and technical advisory activities.",
    "Lead complex, multi-disciplinary projects acting as an SME to solve complex customer issues related to AI solutions.",
    "Provide technical advice and guidance to customers on how to best utilize ServiceNow technologies to achieve their business objectives.",
    "Hands-on delivery of ServiceNow capabilities to customers to drive outcomes and value realization.",
    "Collaborate with cross-functional teams, including sales, marketing, and product development, to ensure the successful deployment of ServiceNow Now Assist.",
    "Stay up-to-date with industry trends and emerging technologies in the field of GenAI, and apply this knowledge to continuously improve and evolve ServiceNow GenAI offerings.",
    "Contribute to thought leadership and point-of-view documents, white papers, knowledge base articles, and other documentation to make information about ServiceNow GenAI capabilities more accessible to the broader organization, customers, and partners."
  ],
  "skills": [
    "Excellent communication and interpersonal skills, with the ability to effectively communicate technical concepts to non-technical audiences.",
    "Strong analytical and problem-solving skills.",
    "Ability to work effectively in a fast-paced, dynamic environment.",
    "Customer-focused mindset and commitment to delivering high-quality results."
  ],
  "qualifications": [
    "At least 5 years of experience in a technology advisory role, experience working directly with AI, machine learning technologies, statistical systems, or big data platforms.",
    "Preferred experience deploying GenAI solutions.",
    "8+ Years of experience in building solutions on complex cloud-native products, applications, and platforms.",
    "ServiceNow Certified System Administrator and other ServiceNow Certified Implementation Specialist certifications desired.",
    "3+ years of ServiceNow Platform experience preferred.",
    "Proven track record of driving business growth and customer satisfaction with emerging technology solutions.",
    "Must be able to travel up to 30% annually."
  ]
}