{
  "responsibilities": [
    "Prototype, evaluate, and iterate on solutions using real-world data and simulations to improve self-driving algorithms.",
    "Formulate problems and propose solutions based on research insights in deep learning, computer vision, and self-driving technologies.",
    "Support deploying solutions to production systems and collaborate with platform teams for seamless integration.",
    "Champion engineering excellence by ensuring high-quality, well-structured, and tested code.",
    "Collaborate in a multidisciplinary team to solve problems related to perception, motion forecasting, planning, traffic modeling, and sensor simulation.",
    "Stay up-to-date with advancements in AI, machine learning, computer vision, and self-driving technologies.",
    "Work with large datasets from various sources and Waabi World simulator.",
    "Contribute to the publication of research findings in conferences and Waabi's blog."
  ],
  "skills": [
    "Expertise in deep learning, computer vision, and self-driving technologies.",
    "Proficient in Python programming with a focus on high-quality, well-structured, and tested code.",
    "Comfortable working with large datasets for machine learning applications.",
    "Strong grasp of machine learning literature, including current trends and state-of-the-art techniques.",
    "Experience in working with platform teams and collaborating with research teams.",
    "Solid experience with concurrent, parallel, and distributed computing techniques.",
    "Proficiency in Pytorch, Rust, C++, and/or CUDA."
  ],
  "qualifications": [
    "Bachelor's degree in computer science, engineering, machine learning, or a related technical discipline.",
    "Experience working on applied research projects.",
    "Passion for turning research ideas into practical solutions for real-world applications.",
    "Solid understanding of computing fundamentals, including code efficiency.",
    "Master/PhD in machine learning, computer science, engineering, or a related field (bonus/nice to have).",
    "Experience in shipping machine learning features/models into production (bonus/nice to have).",
    "Previous experience in self-driving technology or related fields (bonus/nice to have).",
    "Publications in top-tier conferences or journals related to AI, machine learning, computer vision, or self-driving technology (bonus/nice to have)."
  ]
}