{
  "responsibilities": [
    "Conduct advanced research and engineering in reliable distributed systems using AI approaches.",
    "Enable Cloud and Edge powered Embodied AI solutions for AIoT business domains such as autonomous driving, industrial automation, and robotics.",
    "Collaborate with a global team to transfer research findings to Bosch's operational units.",
    "Collaborate with UC Berkeley on scalable and distributed autonomous systems research.",
    "Implement research results to solve real-world challenges and ensure high-quality system integration within Bosch's platforms.",
    "Stay updated on technological advancements and market trends by attending academic conferences, technical events, and seminars.",
    "Offer expert insights to the management team for strategic planning, R&D trajectory, and investment decisions.",
    "Document and disseminate research findings through publications and/or patent submissions."
  ],
  "skills": [
    "Proficiency in programming languages such as Rust, C++, and Python.",
    "In-depth experience with autonomous system architectures for autonomous driving or robotics.",
    "Hands-on experience with middleware frameworks like AUTOSAR, ROS2, Zenoh, or DDS.",
    "Familiarity with AI inferencing and training, and knowledge of machine learning frameworks like TensorFlow or PyTorch.",
    "Experience in reliable and safe distributed function design.",
    "Strong interpersonal, communication, and teamwork capabilities."
  ],
  "qualifications": [
    "Ph.D. in Computer Science, Robotics, or a related discipline, or a master’s degree with 2+ years of industry experience.",
    "A minimum of 3 years of R&D experience or equivalent graduate research background in AI-motivated distributed system technologies and architectures.",
    "Experience with real-world product development and deployment of autonomous systems.",
    "A strong portfolio of publications in computer systems, machine learning, deep learning, robotics, or computer vision journals and conferences.",
    "Experience developing and analyzing real-time and/or safety-critical systems.",
    "Experience with automotive safety standards (e.g., ISO 26262) and communication standards (e.g., V2X) is a plus.",
    "Experience with automotive architecture design is a plus.",
    "Experience with object detection, tracking, and mapping approaches for robotic or automotive applications is a plus.",
    "Strong background in math and statistics is a plus."
  ]
}