{
  "responsibilities": [
    "Collaborate with a team of AI engineers to design, build, and enhance front-end tooling/products for LLM data collection using Angular and similar frameworks.",
    "Focus on backend data engineering tasks involving curating, developing, and processing data samples essential for LLM training processes.",
    "Implement robust backend services and workflows for efficient management of LLM training data collection and processing.",
    "Oversee application deployment tasks utilizing Azure Kubernetes Service (AKS), Azure Machine Learning, and CI/CD pipelines with Jenkins.",
    "Maintain high-quality code adhering to business objectives, software quality standards, and development guidelines.",
    "Actively participate in code reviews and team discussions.",
    "Adapt to shifting priorities and challenges while maintaining focus on delivering results within established deadlines."
  ],
  "skills": [
    "Expertise in Angular or similar front-end frameworks.",
    "Strong foundation in back-end development, particularly in data engineering.",
    "Experience in building AI products and systems.",
    "Knowledge of developing data sets for LLMs.",
    "Proficiency in deployment processes in Azure environments, including Azure Kubernetes Service (AKS) and Azure ML.",
    "Knowledge of CI/CD practices using Jenkins.",
    "High proficiency in Docker for containerization.",
    "Strong Python programming skills for backend development.",
    "Multi-disciplinary approach to problem solving.",
    "Excellent interpersonal and communication skills."
  ],
  "qualifications": [
    "5+ years of experience in full-stack engineering with a focus on AI and/or Machine Learning Engineering, particularly related to LLMs.",
    "Proven expertise in Angular or similar front-end frameworks.",
    "Experience in building AI products and systems.",
    "Knowledge of and experience with developing data sets for LLMs.",
    "Experience defining system architectures and exploring technical feasibility tradeoffs.",
    "Solid experience with deployment processes in Azure environments.",
    "High proficiency in Docker for containerization.",
    "Strong Python programming skills.",
    "Experience in P&C insurance is a plus.",
    "Understanding the development lifecycle for LLMs.",
    "Hands-on LLM deployment experience."
  ]
}