{
  "responsibilities": [
    "Design, build, and scale data pipelines across a variety of source systems and streams (internal, third-party, and cloud-based), distributed/elastic environments, and downstream applications and self-service solutions.",
    "Implement appropriate design patterns while optimizing performance, cost, security, and scale and end-user experience.",
    "Collaborate with cross-functional teams to understand data requirements and develop efficient data acquisition and integration strategies.",
    "Interface with other technology teams to extract, load, and transform data from a wide variety of data sources using cloud-native data engineering principles.",
    "Become a subject matter expert for data engineering-related technologies and designs.",
    "Coach and guide others within the organization to build scalable pipelines based on foundational data engineering principles.",
    "Participate in development sprints, demos, and retrospectives alongside releases and deployment.",
    "Build and manage relationships with supporting engineering teams to deliver work products to production effectively.",
    "Collaborate with business leaders, engineers, and product managers to understand data needs.",
    "Create documentation for developers and business users to help them understand our products."
  ],
  "skills": [
    "Strong understanding of data modeling, warehousing, and architecture principles.",
    "Strong understanding of Machine Learning best practices and algorithms.",
    "Deep experience in building data pipelines using Python/SQL.",
    "Deep experience in Airflow or similar orchestration engines.",
    "Deep experience in applying CI/CD principles and processes to data engineering solutions.",
    "Strong understanding of cloud data engineering design patterns and use cases."
  ],
  "qualifications": [
    "5+ years of experience in a data engineering or related role.",
    "Direct experience designing and building data modeling, ETL/ELT development principles, or data warehousing concepts.",
    "Strong knowledge of data management fundamentals and data storage principles.",
    "Bachelor's degree in Computer Science, Data Science, Statistics, Informatics, Information Systems, Mathematics, Computer Engineering, or quantitative field.",
    "Fully Remote: This position has been designated as fully remote.",
    "Eligible for company-sponsored benefits, including medical, dental, and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks."
  ]
}