{
  "responsibilities": [
    "Independently conduct and oversee primary and secondary research studies from end-to-end, including client scoping, design, execution, analysis, reporting, and strategy implementation.",
    "Conduct Brand Lift research using Simulated and Natural Exposure methodologies, working with panel vendors and paid media on recruitment and survey fulfillment.",
    "Build and maintain marketing databases, ensuring data accuracy, integrity, and compliance with regulatory standards in collaboration with tech, product, and data engineering teams.",
    "Collaborate closely with client account and service teams to understand client objectives, reporting requirements, and preferences to develop best-in-class measurement.",
    "Contribute to the development and execution of team initiatives aimed at improving process, methodologies, and capabilities.",
    "Lead the development of proprietary measurement products including requirements gathering, documentation, methodology, socialization, and continuous improvement.",
    "Mentor and guide junior team members, providing support, knowledge sharing, and fostering a culture of continuous learning and development.",
    "Lead thought leadership initiatives by crafting engaging and well-researched white papers, articles, case studies, and other thought leadership content.",
    "Develop and democratize campaign and study insights by designing efficient data collection and reporting systems, structured databases, and custom designed dashboards and presentations.",
    "Stay updated on industry trends, emerging technologies, and best practices in marketing analytics and research methodologies."
  ],
  "skills": [
    "Proficiency in data analysis tools such as Python, R, SQL, or similar scripting languages.",
    "Experience with marketing analytics platforms such as Google Analytics, Adobe Analytics, or similar tools.",
    "Strong analytical skills with the ability to translate data into actionable insights and recommendations.",
    "Excellent communication and presentation skills, with the ability to convey complex ideas to non-technical audiences.",
    "Proven ability to manage multiple projects simultaneously and meet deadlines in a fast-paced environment.",
    "Strong attention to detail and a passion for problem-solving and continuous improvement."
  ],
  "qualifications": [
    "Bachelor's degree in Business Administration, Marketing, Statistics, Economics, Business Analytics, or a related field; Master's degree preferred.",
    "5+ years of experience in primary research, marketing analytics, data analysis, or related roles. Marketing agency work experience preferred.",
    "Experience with DSPs, Paid Media, and social media platforms preferred.",
    "Experience in executing brand tracking and Brand Lift research preferred.",
    "Experience in Google Cloud Platforms and BI tools such as Looker and Looker Studio preferred."
  ]
}