{
  "responsibilities": [
    "Maintain and enhance existing machine learning modules for autonomous vehicles.",
    "Design and implement new machine learning-based approaches based on existing frameworks.",
    "Keep up to speed with the state of the art of academic research and technology in the industry.",
    "Coordinate with engineers at the ICC and in Germany on the development of autonomous driving software.",
    "Transfer technologies and solutions to Volkswagen Group development divisions.",
    "Develop technical specifications and documentation.",
    "Represent Volkswagen Group in the technical community, such as at conferences."
  ],
  "skills": [
    "Proficiency in deep learning techniques and frameworks.",
    "Strong understanding of traditional machine learning algorithms and their applications.",
    "Expertise in computer vision, including object detection, image segmentation, and image recognition.",
    "Proficiency in NLP techniques, including sentiment analysis, text generation, and language understanding models.",
    "Deep understanding of various neural network architectures such as CNNs, RNNs, and Transformers.",
    "Familiarity with reinforcement learning algorithms and their applications in AI.",
    "Skills in data cleaning, feature engineering, and data augmentation.",
    "Experience in training, fine-tuning, and optimizing AI models.",
    "Knowledge of model deployment techniques, including containerization (Docker) and orchestration (Kubernetes).",
    "Strong documentation skills for model architecture, code, and processes.",
    "Awareness of ethical considerations in AI, including bias mitigation and fairness.",
    "Understanding of AI-related legal and regulatory considerations, including data privacy and intellectual property.",
    "Proficiency in data storage and management systems, including databases and data lakes.",
    "Familiarity with cloud platforms like AWS, Azure, or GCP, and their AI services."
  ],
  "qualifications": [
    "6 - 8 years of professional experience preferred.",
    "4+ years of deep learning experience preferred.",
    "Master’s Degree in Computer Science or equivalent.",
    "PhD strongly preferred."
  ]
}