{
  "responsibilities": [
    "Work with Linux computing environments, common databasing schemes, networking practices, messaging formats and strategies, and programming in multiple software languages.",
    "Support programs employing modern software development and test approaches and methods, including agile development, waterfall, prototyping, iterative and incremental development, spiral development, rapid application development, and quick-reaction capability (QRC) development efforts.",
    "Support full software lifecycle projects, including requirements definition, design, software development, implementation, and test & verification for programs supporting the U.S. Government.",
    "Develop software and algorithms, machine-learning algorithms, or artificial intelligence techniques and apply them to digital RF signal processing, RF engineering or spectrum theory, communication systems, electronic warfare, SIGINT processing, or related areas.",
    "Implement basic software/application security, information assurance, confidentiality, integrity, and availability requirements for software to be delivered to the U.S. Government.",
    "Take direction from more senior developers and work with minimal management oversight in small multi-disciplinary teams to achieve specific goals in mission-relevant timelines for the U.S. Government."
  ],
  "skills": [
    "Proficiency in multiple software languages, such as C/C++, Java, JavaScript, and Python.",
    "Experience with Unix/Linux programming environments.",
    "Knowledge of industry-standard databases such as PostgreSQL.",
    "Familiarity with common messaging formats such as Google Protocol Buffer and JSON and messaging brokers such as ActiveMQ and ZMQ.",
    "Experience using JavaScript Libraries such as Bokeh.js and Leaflet.js.",
    "Basic USRP knowledge.",
    "Familiarity with build tools such as Gradle and/or Maven.",
    "Comfortable with git and git branching/code review models.",
    "Comfortable with web servlets, web sockets, and web servers (e.g., Glassfish).",
    "Sound problem-solving, verbal and written communication, and organizational skills.",
    "Experience with Microsoft Office products (Word, PowerPoint, Excel, and Project).",
    "Self-starter with a willingness to work with others to conceptualize and develop innovative solutions to complex software challenges.",
    "Excellent verbal and written communication, organizational, and interpersonal skills."
  ],
  "qualifications": [
    "Bachelor’s or master’s degree in a relevant field such as computer science, electrical engineering, computer engineering, software engineering, applied mathematics, or other relevant area, or demonstrably equivalent work experience.",
    "Minimum of 5 (7 years preferred) of relevant work experience in software development as an individual and team contributor for efforts involving highly technical applications.",
    "Must be a U.S. Citizen.",
    "Eligibility to obtain and maintain a U.S. Government security clearance; candidates with an existing security clearance are preferred (TS SCI).",
    "Experience supporting software development efforts for U.S. Government clients and demonstrated performance as a developer within multi-disciplinary teams.",
    "Knowledge of software and algorithm development, machine-learning algorithm development, or artificial intelligence techniques applied to digital RF signal processing, RF engineering or spectrum theory, communication systems, electronic warfare, SIGINT processing, or related areas."
  ]
}