{
  "responsibilities": [
    "Lead the UX design process end-to-end for AI-enhanced products, collaborating closely with product managers, engineers, and other designers.",
    "Own the design vision for generative AI features and ensure consistency across platforms, adhering to design systems and standards.",
    "Apply UX best practices to translate complex AI functionalities into intuitive, user-friendly experiences.",
    "Conduct user research to understand target audiences, user journeys, and pain points for AI-driven interactions.",
    "Perform competitive analysis and evaluate generative AI trends to inform design solutions.",
    "Develop wireframes, storyboards, and high-fidelity prototypes to visualize AI-powered experiences.",
    "Create and iterate on generative AI designs based on usability tests and feedback loops with end users.",
    "Actively participate in brainstorming and ideation sessions, contributing insights on how AI can enhance the user experience.",
    "Partner with engineering teams to bring design ideas to life, ensuring that AI functionalities are implemented according to specifications.",
    "Advocate for human-centered design practices, ensuring that generative AI remains a tool for empowering users.",
    "Work within and expand existing design systems to accommodate new AI-based interactions and patterns.",
    "Document design specifications, interaction flows, and guidelines to standardize AI components across platforms.",
    "Contribute to building and managing reusable UI components for AI-driven experiences."
  ],
  "skills": [
    "Proficiency in design tools (e.g., Figma, Sketch) and prototyping tools (e.g., InVision, Adobe XD).",
    "Expertise in creating both low-fidelity and high-fidelity prototypes to communicate AI-driven features.",
    "Understanding of generative AI and its applications, including NLP, image generation, or predictive analytics.",
    "Strong collaboration skills and experience working with product managers, data scientists, and engineers.",
    "Knowledge of design systems, accessibility, and cross-platform usability."
  ],
  "qualifications": [
    "Bachelor’s or Master’s degree in User Experience, HCI, Interaction Design, Industrial Design, or related field.",
    "3+ years of experience in UX design, with demonstrated expertise in designing for generative AI or machine learning applications.",
    "Strong portfolio showcasing projects that involve AI/ML elements, emphasizing user-centered design solutions.",
    "Familiarity with Google Material Design or similar design frameworks (preferred).",
    "Experience working in enterprise SaaS environments, ideally in supply chain, analytics, or e-commerce (preferred).",
    "Demonstrated experience in designing scalable AI interfaces and cross-platform solutions (preferred).",
    "Experience in data visualization, intelligent UI, or analytics-focused UX (preferred)."
  ]
}