{
  "responsibilities": [
    "Design and implement Data Center build outs, including installation of cabinets, structured cabling, and provisioning of new hardware.",
    "Lead Data Center projects to ensure they meet customer requirements.",
    "Participate in planning, coordination, implementation, and execution of Data Center services.",
    "Collaborate with internal stakeholders to define project design criteria and develop a Basis of Design.",
    "Manage consultants to implement projects from design through construction with comprehensive documentation.",
    "Review and update Data Center \"as-built\" documentation, re-configurations, and updates as needed.",
    "Support and execute data center capacity management and inventory control for optics, cables, and hardware.",
    "Collaborate with internal teams and external vendors to propose industry best Datacenter solutions.",
    "Coordinate with System Architect team on container orchestration, cloud solutions, and services in a hybrid cloud environment.",
    "Lead data management, security, and migration initiatives.",
    "Examine current data management systems and identify opportunities for enhancement.",
    "Work with Systems and security organizations to develop policies for standardizing systems, tools, and security practices.",
    "Identify requirements, research options, design, and implement solutions for applications/systems/services.",
    "Perform technical planning, system integration, verification and validation, cost, and risk assessments.",
    "Conduct and review detailed technical design with technology experts; assist with implementation plan construction.",
    "Lead projects impacting infrastructure design, innovation, and implementation.",
    "Conduct and oversee the review of architectural design for next-generation data center designs."
  ],
  "skills": [
    "In-depth knowledge of data center technologies (compute, storage, virtualization, network, cloud, BCP, DR solutions).",
    "Expert level experience with public and private cloud services, microservices, and advanced cloud technologies.",
    "Understanding of legacy and modern data center architectural systems.",
    "Sophisticated knowledge in diagnosing servers, hardware repair, and component replacement.",
    "Strong troubleshooting and analytical skills.",
    "Knowledge of scripting and job creation.",
    "Knowledge of version control systems.",
    "Ability to create Linux scripts and manage cron jobs.",
    "Ability to develop detailed project plans including schedule, scope, communication plan, risk analysis, and resource estimates.",
    "Ability to produce operational documentation using industry best practices in technical writing.",
    "Ability to gather process requirements to automate into playbooks.",
    "Ability to develop and implement service request workflows for automating system operation and maintenance processes.",
    "Excellent interpersonal and communication skills.",
    "Proactive and flexible with the ability to work effectively as part of a team or individually.",
    "Strong attention to detail with the ability to operate effectively across multiple priorities."
  ],
  "qualifications": [
    "15+ years of Data Center architectural experience.",
    "10+ years of experience in mission-critical Data center design, implementation, and migration.",
    "Experience in building BCP, DR Architecture, and managing execution and operations.",
    "Experience with structured cabling, optical technologies, DC power management, and server/network hardware.",
    "Knowledge of industry standards, building codes, and safety standards.",
    "Strong cross-discipline knowledge of complete critical facility systems.",
    "Ability to provide solutions to complex projects under pressure.",
    "Experience working in a regulatory environment with an understanding of Change Control, Incident Management, and Problem Management processes and procedures.",
    "Expertise in the Linux command-line environment.",
    "Expert in Datacenter Compute and Network infrastructure.",
    "Hands-on experience in day-to-day Data Center operations.",
    "Demonstrated experience delivering technology solutions in a fast-paced, deadline-driven enterprise environment.",
    "Self-starter, highly motivated individual who adapts to a dynamic work environment."
  ]
}