{
  "responsibilities": [
    "Strategize and work closely with the Sales team to align on objectives of client meetings, prioritize opportunities, and provide technical solution leadership for sales opportunities.",
    "Build and deliver customized demos to clients, from practical users to senior management demonstrations.",
    "Present solution proposals, business benefits, competitive advantages, and how Forethought solutions can meet clients' current and future needs.",
    "Lead technical scoping sessions with clients to collect, analyze, clarify, and document business requirements. Provide clients with solution proposals, ROI, Mutual Success Plan, and Implementation timelines.",
    "Become a trusted advisor for client accounts and provide practical guidance in the business value of proposed solutions, set expectations with clients to ensure customer satisfaction.",
    "Demonstrate thought leadership and provide guidance to clients on adopting AI solutions to improve the efficiency of existing business processes.",
    "Work closely with the Implementation team, Engineering team, Product team, and other Sales Engineers to strategize on opportunities, cross-training, and knowledge transfer."
  ],
  "skills": [
    "Hands-on experience with Python, SQL, HTML, JavaScript, and bash script.",
    "Experienced in working with APIs.",
    "Experienced in working in a client-facing role, ideally in a pre-or post-sales support role.",
    "Familiarity with concepts and technologies used in building large-scale end-to-end machine learning infrastructures.",
    "Familiarity with NLP concepts and use cases, such as word embeddings, BERT, GPT, DPR, sentiment analysis, topic modeling, and Question/Answering.",
    "Good understanding of software sales cycle and strategies.",
    "Excellent communication skills, able to explain complex technical concepts to non-technical audiences.",
    "Good to have: Experience with Helpdesk technologies like Zendesk, Salesforce, ServiceNow, etc."
  ],
  "qualifications": [
    "5+ years experience working as either: Enterprise Sales Engineer, Data Analyst, Data Engineer, Data Scientist, AI/ML Engineer, or Big Data Consultant related role."
  ]
}