{
  "responsibilities": [
    "Performs accurate testing, recognizing abnormal or unusual results.",
    "Reports timely results accurately, in writing, verbally, by fax or computer.",
    "Notifies appropriate persons as necessary.",
    "Performs and records instrument checks, and quality control.",
    "Performs routine equipment maintenance and calibration.",
    "Identifies QC issues and initiates proper corrective action.",
    "Follows instruction for analyzer operation and reagent preparation.",
    "Documents and notifies lab leadership appropriately.",
    "Demonstrates current knowledge of computer functions and departmental policies and procedures.",
    "Actively engages in laboratory communications and staff meetings.",
    "Properly prepares samples for testing, including proper labeling, specimen preservation and transport, and safe handling techniques.",
    "Demonstrates and understands the appropriate handling and reporting of proficiency samples.",
    "Notifies appropriate caregiver by telephone of critical results and corrected results and documents notification in accordance with policy.",
    "Organizes and sets priorities in order to complete work assignments in a timely manner.",
    "Teaches procedures for which he/she is deemed competent and evaluates trainees using established forms or examinations.",
    "Understands and applies theory of disease process to testing and test results.",
    "Understands and is able to perform accuracy, precision, and correlation studies for new and/or existing assays.",
    "Provides assistance in areas such as work schedules, student and staff training, supply inventory, purchasing, performance improvement, and compliance plan.",
    "Performs other duties as assigned.",
    "Maintains as needed and annual competency prior to deadlines, required to perform lab testing."
  ],
  "skills": [
    "Ability to recognize abnormal or unusual test results.",
    "Proficiency in reporting results accurately through various communication methods.",
    "Competence in performing instrument checks, quality control, and routine equipment maintenance.",
    "Ability to identify and correct QC issues.",
    "Knowledge of analyzer operation and reagent preparation.",
    "Understanding of computer functions and departmental policies and procedures.",
    "Effective communication skills for laboratory communications and staff meetings.",
    "Skills in sample preparation, labeling, preservation, transport, and safe handling techniques.",
    "Ability to handle and report proficiency samples appropriately.",
    "Organizational skills to set priorities and complete work assignments timely.",
    "Teaching and evaluation skills for training procedures.",
    "Understanding of disease processes and their application to testing and test results.",
    "Ability to perform accuracy, precision, and correlation studies for assays.",
    "Assistance in work schedules, training, inventory, purchasing, performance improvement, and compliance."
  ],
  "qualifications": [
    "A baccalaureate degree from an accredited college/university including courses in biological science, chemistry, and mathematics AND successful completion of a NAACLS accredited Medical Laboratory Science program or BS/BA program in related science that meets requirements for certification.",
    "MT/MLS (ASCP) or MT/MLS (AMT) required or (ASCP) categorical certification and a BS or BA in related science.",
    "An associate degree from an accredited college/university in Medical Laboratory Science or a related science including 60 semester hours of academic credit including 6 semester hours of chemistry and 6 semester hours of biology or graduation from a military medical laboratory specialist program.",
    "MLT (ASCP) or MLT (AMT) Required.",
    "All students who will have completed a NAACLS accredited program within 6 months and would be eligible for national board exam would be considered.",
    "ASCP Certification preferred.",
    "MT/MLS or MLT considered for position; Shifts flexible at 8 or 10 hours, based on department need; weekends and holidays are included in rotation."
  ]
}