{
  "responsibilities": [
    "Support software design process based on functional requirements.",
    "Consult with project teams and end users to identify application requirements.",
    "Design and write detailed design specifications, develop, and implement new software features or modifications to existing software.",
    "Participate in code reviews and provide feedback on code quality correctness and style.",
    "Support CI/CD process for stability, efficiency, security, and quality of all shipped code.",
    "Support Runtime platform maintenance, integration of new features, and release fixes.",
    "Make recommendations for continuous improvement of SDLC and DevOps.",
    "Design, develop, and implement test automation to improve efficiency and enforce quality/security baselines.",
    "Support in creating and maintaining product documentation.",
    "Participate in advanced support escalation for live site management."
  ],
  "skills": [
    "Strong knowledge of Large Language Models (LLMs), including their architectures, training processes, and applications.",
    "Working knowledge of the Git Source Control System.",
    "Working knowledge of Agile software development principles.",
    "Proficiency in Python, SQL, NoSQL, CSS, JavaScript, and RESTful services.",
    "Excellent spoken and written communication and receptive listening skills, with the ability to present ideas in a clear, concise fashion to technical and non-technical audiences.",
    "Ability to conform to shifting priorities, demands, and timelines through analytical and problem-solving capabilities.",
    "Strong ability to work independently or in a team-oriented, collaborative environment.",
    "Ability to take initiative and prioritize tasks, manage time, problem prevention, and problem-solving skills.",
    "Proven experience as a hands-on engineer designing and delivering solutions to meet complex design and architectural challenges in a cloud services environment.",
    "Prior experience building services that run on Microsoft Azure and Amazon Web Services Infrastructure.",
    "Deep practical experience operating high-scale services in production environments.",
    "Experience and opinions on what great observability looks like, what safe deployments look like, and whether to push code on Fridays."
  ],
  "qualifications": [
    "Bachelor’s degree or equivalent experience required.",
    "Experience reading and writing technical specifications.",
    "5+ Years of experience with the following programming languages: Python, SQL, JavaScript.",
    "5+ years of experience writing high-performance, thread-safe code that allows for serving requests in sub-millisecond times.",
    "5+ years of experience debugging difficult live site problems and building automation to run a high-scale service distributed system.",
    "5+ years of experience developing applications in Azure or AWS."
  ]
}