{
  "responsibilities": [
    "Provide continuous proactive and reactive engineering support for business partners using AI products, ensuring high satisfaction.",
    "Apply AI and machine learning techniques to build and launch generative AI solutions using Meta’s Llama and other Large Language Models (LLM).",
    "Develop and maintain performance monitoring systems for infrastructure and operations to ensure high availability of partner integrations.",
    "Develop and troubleshoot large-scale distributed systems for business AI infrastructure and partner-specific integrations.",
    "Analyze complex datasets for distributed systems to troubleshoot and improve systems.",
    "Provide 24/7 on-call support coverage via rotation schedule, including weekends.",
    "Work with Platform and Infrastructure teams to investigate and assess reported issues, agreeing on fixes for continuous improvements.",
    "Proactively analyze information to identify trends/opportunities and recommend tactical improvements.",
    "Deliver constructive feedback to peers to strengthen relationships and advance projects.",
    "Create clear and concise documentation to communicate complex AI concepts to technical and non-technical stakeholders.",
    "Evaluate priorities and project direction, identifying where to pause, remove roadblocks, or reprioritize resources."
  ],
  "skills": [
    "Proficiency in AI and machine learning techniques.",
    "Experience with large-scale distributed systems.",
    "Ability to analyze complex datasets.",
    "Strong troubleshooting skills.",
    "Experience with the full web stack, REST API, Python, PHP/Hack, JavaScript/React development.",
    "Debugging and bug management support skills.",
    "Knowledge of fine-tuning and optimizations of PyTorch models and LLMs.",
    "Ability to communicate with technical and business audiences.",
    "Technical documentation creation skills."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.",
    "8+ years of experience in software engineering, support engineering, reliability engineering, or related fields.",
    "6+ years of experience in machine learning, recommendation systems, natural language processing, data mining, artificial intelligence, AI-Infrastructure, or related technical fields.",
    "Experience with at least one LLM such as Llama, GPT, Claude, Falcon, etc.",
    "Hands-on experience with large language models and AI agents (preferred).",
    "Experience building cloud solutions on any cloud (preferred).",
    "Experience with Open Source cloud stacks like Kubernetes, Kubeflow, Docker containers (preferred).",
    "Data science background and experience with data manipulation, model selection, training, optimization, and deployment at scale (preferred)."
  ]
}