{
  "responsibilities": [
    "Research and develop network-based prototypes including the creation of software, scripts, and documentation to demonstrate capabilities in new network technology areas.",
    "Research and develop state-of-the-art large-scale prototypes involving virtualized environments, including cloud infrastructure, containers, and network function virtualization (NFV).",
    "Provide technical leadership working with government PMs to help shape and guide their research program, explain technical details to customer stakeholders, and work alongside other contractors to create prototypes.",
    "Work in a fast-paced dynamic environment acquiring expertise as needed and demonstrating capabilities in software development, networking, data collection/monitoring, reverse engineering, etc."
  ],
  "skills": [
    "Software development skills in one or more languages (Python, Go, Java).",
    "DevOps experience for team development, CICD, and version management.",
    "Experience with network and system automation tools (e.g., Ansible, Helm, Puppet).",
    "Virtualization and container technologies (e.g., Docker, Kubernetes, Vagrant) experience.",
    "Ability to quickly acquire knowledge in new technologies, redirect research, quickly prototype solutions, suggest new lines of research, and help shape the customer’s research programs.",
    "Experience and understanding of network protocols, automation, and devices (e.g., routers, switches, firewalls).",
    "Experience with reverse engineering tools, such as Ghidra, IDA Pro, for system and malware analysis.",
    "Ability to clearly document and describe research to the government customer and their stakeholders.",
    "Experience working with members of the IC and related DOD customers.",
    "Desire to work at customer research sites collaborating with government PMs and contractors.",
    "Experience with embedded systems development, Linux kernel or device driver development.",
    "Familiarity with machine learning, neural networks, or advanced AI techniques."
  ],
  "qualifications": [
    "Requires BS with 12 years of experience, MS with 10 years of experience, or Ph.D. with 7 years of experience to satisfy government contractor requirements.",
    "Degree in Computer Science, Computer Engineering, Electrical Engineering, or related field is preferred.",
    "Current/Active TS/SCI with Poly required for this role."
  ]
}