{
  "responsibilities": [
    "Apply relevant AI and machine learning techniques to build and launch generative AI solutions using Meta’s Llama and other state-of-the-art LLMs.",
    "Define and execute on a strategy to drive adoption of Llama and other Meta’s AI/ML platform offerings.",
    "Work closely with cloud providers (e.g., AWS, Azure, GCP) and Meta’s partners on deep learning & Llama integrations.",
    "Be a subject matter technical expert and have strategic influence on partners and internal teams at Meta.",
    "Provide thought leadership, raising awareness of Llama & Generative AI services and share best practices through forums such as medium blogs, whitepapers, reference architectures, and public-speaking events.",
    "Develop reference architectures, samples, and other materials to share with the broader Meta developer community.",
    "Work with key partners and the Llama developer community to optimize existing generative AI models for improved performance, scalability, and efficiency.",
    "Lead technical strategy and roadmap for long-term strategic partners with high level of autonomy.",
    "Plan, lead, and execute on projects with minimal direction & oversight from leadership.",
    "Communicate feedback, updates, and status to direct team as well as relevant cross-functional teams.",
    "Create clear and concise documentation, including technical specifications, best practices guides, and presentations, to communicate complex AI concepts to both technical and non-technical stakeholders internally and externally."
  ],
  "skills": [
    "Proficiency in software development in languages like Python, Java, Go, Rust, C/C++.",
    "Experience with at least one LLM such as Llama, GPT, Claude, Falcon, etc.",
    "Experience with at least one Deep Learning framework such as PyTorch, TensorFlow, JAX, MXNet, Caffe.",
    "Experience building cloud solutions on any cloud and with Open Source cloud stacks like Kubernetes, Kubeflow, Docker containers.",
    "Ability to communicate and present to technical and business audiences.",
    "Understanding of Responsible AI and risk identification.",
    "Ability to develop technical accelerators, case studies, white papers, blogs, reference architectures, and/or presentations."
  ],
  "qualifications": [
    "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.",
    "Understanding of Meta’s AI, Llama architecture, frameworks, products, and their underlying implementation.",
    "5+ years of experience in one or more of the following areas: Deep Learning, LLMs, NLP, Conversational AI, Dialogue, AI-Infrastructure, Machine Learning, or artificial intelligence.",
    "8+ years of experience as a software engineer, technical consultant, or partner/sales engineer.",
    "Experience deploying production-grade machine learning solutions on public cloud platforms (like AWS).",
    "Experience in launching a product/service or application into the market is a plus.",
    "BS, MS, or Ph.D. degree in Computer Science or related quantitative field (preferred).",
    "Solid understanding of at least one Deep Learning framework (PyTorch, Tensorflow, or MXNet) (preferred).",
    "Experience building Deep Learning - Computer Vision or Natural Language Processing or Recommender Systems models using the frameworks (preferred).",
    "Experience working with or in support of diverse communities (preferred).",
    "Data science background and experience manipulating/transforming data, model selection, model training, model optimization, and deployment at scale (preferred).",
    "Contributed to an Open Source project, submitted PRs for features/fixed bugs, and/or created sample applications in OSS or participated in Kaggle competitions (preferred)."
  ]
}