{
  "responsibilities": [
    "Advise research teams on permissible data usage and partner with them on data sourcing strategy.",
    "Translate data needs between research teams and legal/policy stakeholders.",
    "Maintain and evolve guidelines, policies, and controls around data acquisition and use to address legal risks and regulatory requirements.",
    "Monitor regulatory developments related to AI training data and adapt internal policies and practices.",
    "Engage with academics, industry groups, and other stakeholders to develop norms and best practices around data governance for AI development."
  ],
  "skills": [
    "Creative, practical problem-solving skills with the ability to translate and apply legal requirements to technical concepts.",
    "Expertise in copyright, privacy, and related laws applicable to data used for machine learning.",
    "Experience advising on legal issues for AI products or services and knowledge of the machine learning development lifecycle.",
    "Excellent written communication skills for drafting clear policies, whitepapers, and other content.",
    "Ability to engage with stakeholders to evangelize best practices.",
    "Adaptability and ability to pivot in a fast-paced technology startup environment.",
    "Ability to identify and implement efficient processes and policies.",
    "Ability to work as a member of cross-functional teams building frontier technologies.",
    "Willingness to operate outside areas of expertise and in uncharted legal territory.",
    "Team player mentality with a proactive approach to problem-solving."
  ],
  "qualifications": [
    "JD and active membership in at least one U.S. state bar (California preferred).",
    "5-10 years of legal experience advising on copyright, privacy, data, and related issues for technology companies or AI/ML products (in-house experience preferred).",
    "Exceptional analytical skills, technical fluency, and ability to navigate ambiguous and uncharted legal territory.",
    "Thorough understanding of key legal issues in AI development, especially related to training data.",
    "Track record of educating internal stakeholders, translating complex concepts, and advising on risk mitigation strategies.",
    "Superior communication abilities, both written and verbal, with proven experience communicating and collaborating cross-functionally with technical teams.",
    "Motivated self-starter able to multi-task and juggle multiple priorities in a dynamic environment.",
    "Growth mindset with a passion for AI's potential to positively impact the world and realistic assessment of its risks and limitations.",
    "Authentic integrity and a deep understanding of the importance of ethics in business."
  ]
}