{
  "filename": "j05b0b",
  "responsibilities": [
    "Carry out cutting-edge research to advance the science and technology of machine learning systems.",
    "Perform research that enables learning the semantics of data (images, video, text, audio, and other modalities).",
    "Devise better data-driven models of AI system design and optimization.",
    "Contribute research that leads to innovations in scalable machine learning systems, resource-efficient AI data and algorithm scaling, and neural network architectures.",
    "Develop memory and energy-efficient AI systems and environmentally-sustainable AI system and hardware designs.",
    "Collaborate with researchers and cross-functional partners, including communicating research plans, progress, and results.",
    "Publish research results and contribute to research that impacts Meta product development."
  ],
  "qualifications": [
    "Experience with Python, C++, C, Rust, or other related languages.",
    "Proficiency with the PyTorch framework.",
    "Experience developing and optimizing systems for at-scale machine learning execution.",
    "Ability to devise data-driven models and conduct real-system experiments and design implementation for AI system optimization.",
    "Experience with scalable machine learning systems, resource-efficient AI data and algorithm scaling, or neural network architectures.",
    "Problem-solving skills, including comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward.",
    "Ability to work and communicate cross-functionally in a team environment."
  ],
  "analysis": "The job responsibilities focus on advancing machine learning systems, learning the semantics of various data modalities, and developing efficient AI systems. While these tasks are related to AI and machine learning, they do not explicitly mention Generative AI or language models. The skills required include proficiency in programming languages and frameworks like Python and PyTorch, experience with scalable machine learning systems, and system optimization. These skills are relevant to AI and machine learning in general but do not specifically indicate work with Generative AI or language models. The job description emphasizes system design, optimization, and efficiency rather than the creation or use of generative models or language models.",
  "is_genai_role": false
}