{
  "filename": "j08d7f",
  "responsibilities": [
    "Perform research and develop solutions to computer software and computer hardware problems.",
    "Research, design, and develop new optimization algorithms and techniques to improve the efficiency and performance of Meta’s platforms.",
    "Design and implement large-scale distributed software systems to serve large numbers of complex requests simultaneously and without failure.",
    "Utilize technical research background, train new ranking models, and run experiments.",
    "Create tools for migrating large bodies of user data across systems for new products, scalability efforts, and development of new core infrastructure.",
    "Use machine learning, statistics, or other data techniques to build algorithms.",
    "Suggest, collect, and synthesize system requirements from stakeholders and create effective feature roadmaps.",
    "Analyze and resolve computer challenges from a system engineering standpoint.",
    "Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors.",
    "Demonstrate good judgment in selecting methods and techniques for obtaining solutions."
  ],
  "skills": [
    "Technical research background",
    "Training new ranking models",
    "Running experiments",
    "Creating tools for data migration",
    "Building algorithms using machine learning, statistics, or other data techniques",
    "Synthesizing system requirements and creating feature roadmaps",
    "Analyzing and resolving computer challenges",
    "Evaluating data and identifiable factors",
    "Demonstrating good judgment in selecting methods and techniques"
  ],
  "analysis": "The job responsibilities and skills focus on research, development, and optimization of algorithms and software systems. Key tasks include developing optimization algorithms, designing distributed software systems, training ranking models, and building algorithms using machine learning and statistics. While these tasks involve advanced computing and data techniques, there is no explicit mention of working with Generative AI or language models. The focus seems to be on optimization, system design, and data analysis rather than on creating or working with generative models or LLMs. The mention of \"training new ranking models\" could potentially involve some aspects of machine learning, but it does not specifically indicate the use of GenAI or LLMs.",
  "is_genai_role": false
}