{
  "filename": "j0ad17",
  "responsibilities": [
    "Understand structure and rules of enterprise data to translate into database design.",
    "Develop and maintain ETL Data Flows using Azure Synapse.",
    "Develop and maintain SparkSQL, PySpark code within notebooks in Azure Synapse workspace.",
    "Develop and maintain Physical and Logical data Marts in Azure Synapse and SQL Server.",
    "Maintain Data Dictionary, Data Mapping and Design Documents.",
    "Work on Version control tools like Azure DevOps.",
    "Establish best practices for a growing team.",
    "Work and collaborate with Power BI and AI Automation resources.",
    "Collaborate with various Business Application Teams to understand the Source Data.",
    "Work in Agile framework/methodology."
  ],
  "qualifications": [
    "Proficient in PySpark, SparkSQL, Python, SQL.",
    "Experience with Data Lakes, Data warehousing, Data Mart concepts and Cloud Technologies.",
    "Excellent grasp of Data Modeling & Data Transformation concepts.",
    "Familiarity working with programming languages like R, and Java.",
    "Exceptional problem-solving and communication skills.",
    "Team Player, Reliable, flexible and dedicated."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on data management, database design, ETL processes, and data warehousing using Azure Synapse, SparkSQL, PySpark, and SQL Server. The responsibilities include developing and maintaining data flows, data marts, and collaborating with business application teams to understand source data. The skills required include proficiency in PySpark, SparkSQL, Python, SQL, and familiarity with data modeling and transformation concepts.\n\nThere is a mention of collaborating with \"AI Automation resources,\" which could imply some interaction with AI technologies. However, there is no explicit mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is more on data engineering and data management rather than on developing or working with GenAI or LLMs.\n\nOverall, the job seems to be centered around data engineering and analytics rather than directly involving Generative AI or language models.",
  "is_genai_role": false
}