{
  "filename": "j0c719",
  "responsibilities": [
    "Conduct groundbreaking research and development on AI/ML algorithms that underpin the core functionalities of our robotic solutions.",
    "Collaborate with cross-functional teams to integrate AI models and data pipelines into real-world robotic applications, ensuring robust and scalable outcomes.",
    "Publish and present research findings in top-tier journals and conferences, contributing to the broader academic and professional communities."
  ],
  "qualifications": [
    "Understanding of multimodal modeling, modern ML architectures (transformers, diffusion models, etc.), and imitation and/or reinforcement learning.",
    "Experience with deep learning frameworks such as PyTorch, JAX, TensorFlow, or similar.",
    "Demonstrated ability to design and execute on applied research agendas.",
    "Excellent written and verbal communication skills, with a proven track record of publishing research.",
    "Practical experience with coding best practices, experiment tooling, data pipelines, and workflow automation.",
    "Knowledge of robotics software and simulation stacks.",
    "Familiarity with large-scale, distributed model training.",
    "Creative thinker with a passion for problem-solving and innovation.",
    "Ability to work in a dynamic and collaborative team environment."
  ],
  "analysis": "The job involves conducting research and development on AI/ML algorithms for robotic solutions, which suggests a focus on AI technologies. The responsibilities mention integrating AI models into robotic applications, which could involve various types of AI models, including those used in Generative AI or language models. However, the responsibilities do not explicitly mention Generative AI or language models.\n\nThe skills section lists an understanding of modern ML architectures such as transformers and diffusion models. Transformers are a key architecture used in language models and Generative AI, indicating potential involvement with these technologies. Additionally, familiarity with large-scale, distributed model training could be relevant to working with large language models or generative models, which often require such training techniques.\n\nOverall, while the job does not explicitly state working with Generative AI or language models, the mention of transformers and large-scale model training suggests that there could be some involvement with these technologies, especially in the context of integrating AI models into applications.",
  "is_genai_role": true
}