{
  "filename": "j11028",
  "responsibilities": [
    "Develop and support big data processing pipelines including ingestion, transformation, and end-customer delivery",
    "Build out cloud-based infrastructure using distributed techniques for data engineers, data scientists, and researchers",
    "Conduct proof of concepts evaluations of new technologies for handling and processing big data",
    "Build and support visualization and exploration capabilities around big data sets",
    "Set technical direction and work closely with investment professionals, researchers, and data scientists",
    "Design, build, and launch robust end-to-end data pipelines and tools"
  ],
  "qualifications": [
    "Technical leadership through hands-on development",
    "Ability to transform large unstructured data sets into valuable investment research inputs",
    "Experience with industry-leading cloud-computing technologies",
    "Ability to collaborate and build relationships across multiple business units",
    "Excellent attention to detail, organization, and project management skills",
    "Superb business intuition and a solution-oriented, methodological approach to problem solving"
  ],
  "analysis": "The job responsibilities focus on developing and supporting big data processing pipelines, building cloud-based infrastructure, conducting proof of concepts for new technologies, and building visualization and exploration capabilities around big data sets. The skills required include technical leadership, transforming large unstructured data sets, experience with cloud-computing technologies, collaboration, attention to detail, and business intuition.\n\nThere is no explicit mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is primarily on big data processing, cloud infrastructure, and data pipelines, which are related to data engineering and data science but do not specifically indicate involvement with GenAI or LLMs. While transforming large unstructured data sets could potentially involve language models, it is not explicitly stated or implied in the context of this job description.",
  "is_genai_role": false
}