{
  "filename": "j13dc6",
  "responsibilities": [
    "Develop and train state-of-the-art production-level Machine Translation models for LILT customers and translators.",
    "Develop and maintain services (Python, Java) to query and transform customer data for adaptation experiments.",
    "Contribute to engineering and product planning meetings to suggest and discuss improvements to the LILT machine-learning ecosystem.",
    "Develop automated systems for production-level deployment of Machine Learning models (Kubernetes and Helm).",
    "Identify performance bottlenecks and propose improvements in the research and development infrastructure.",
    "Keep up to date with libraries and technologies in data caching, messaging systems, databases, and continuous improvement.",
    "Keep up to date on the latest research in Machine Translation, Large Language Models, and similar fields.",
    "Identify and develop proof of concept solutions for large-scale Natural Language processing systems.",
    "Iterate and develop architecture for Multilingual Machine Translation and Creation models for deployment.",
    "Identify and experiment with methods to improve large-scale data processing for ML model training.",
    "Demonstrate good judgment in driving applied research initiatives within LILT.",
    "Keep up to date with libraries and frameworks for neural networks.",
    "Submit research projects to peer-reviewed conferences and publications.",
    "Serve as Machine Translation Spokesperson and train non-technical teams on complex research ideas.",
    "Develop graphical tools and methods to explain observed phenomena in Language models to customers."
  ],
  "qualifications": [
    "Proficiency in developing and training Machine Translation models.",
    "Experience with Python and Java for data transformation and querying.",
    "Ability to contribute to engineering and product planning.",
    "Skills in developing automated systems for ML model deployment.",
    "Ability to identify and address performance bottlenecks.",
    "Knowledge of data caching, messaging systems, databases, and continuous improvement technologies.",
    "Familiarity with the latest research in Machine Translation and Large Language Models.",
    "Ability to develop proof of concept solutions for NLP systems.",
    "Skills in iterating and developing architecture for ML models.",
    "Experience in improving large-scale data processing for ML training.",
    "Ability to drive applied research initiatives.",
    "Proficiency with neural network libraries and frameworks.",
    "Experience in submitting research to peer-reviewed conferences.",
    "Ability to train non-technical teams on research ideas.",
    "Skills in developing graphical tools for customer-facing explanations."
  ],
  "analysis": "The job involves developing and training Machine Translation models, which are a type of language model. The responsibilities include keeping up to date with the latest research in Machine Translation and Large Language Models, indicating a focus on language models. Additionally, the job requires developing graphical tools to explain phenomena in Language models, which further suggests involvement with language models. The skills section also mentions familiarity with Large Language Models, reinforcing the idea that the job involves working with language models. While the job does not explicitly mention Generative AI, the focus on language models and Machine Translation suggests that it could involve aspects of Generative AI, as these fields often overlap.",
  "is_genai_role": true
}