{
  "filename": "j24fbb",
  "responsibilities": [
    "Develop, optimize, and execute high-quality research processes in computational imaging and artificial intelligence.",
    "Lead large-scale data analysis for collaborative projects.",
    "Work independently to design and plan projects, oversee collaborations, and supervise students and interns.",
    "Carry out research activities of assigned projects to completion.",
    "Keep the team and principal investigator informed of research project progress and provide recommendations on experimental design and conduct.",
    "Analyze large radiographic imaging or digital pathology datasets and manage complex databases.",
    "Conduct advanced data analytics, map and generate result summaries, and document methodologies.",
    "Test and develop novel computational approaches for medical imaging AI research.",
    "Contribute to dissemination efforts, including presenting data and findings at meetings, preparing manuscripts, and contributing to grant proposals.",
    "Design research projects, including hypotheses and analytical processes, with a high degree of independence.",
    "Oversee data analytics and statistical analysis for various research projects.",
    "Prepare result summaries and generate reports, applying appropriate statistical methods.",
    "Develop and implement tools and workflows for processing and analyzing high throughput imaging data.",
    "Maintain and update pipelines for large, complex datasets.",
    "Design, code, test, debug, modify, and document complex systems for database maintenance.",
    "Provide supervision, technical guidance, and training to staff and students in methodological and statistical approaches.",
    "Provide data visualization for academic publication and research presentations."
  ],
  "skills": [
    "High-level proficiency in software packages, including Python and MATLAB.",
    "Mastery of computational imaging data formats (e.g., MHA, NIFTI).",
    "Experience with public databases (e.g., TCGA, TCIA, IDC) and familiarity with APIs, database querying, and data management.",
    "Experience with computational imaging software packages (e.g., ITK Snap, 3D Slicer, PyTorch, PyRadiomics).",
    "Skills in quality control/quality assurance in laboratory and interdisciplinary programs.",
    "Demonstrated skills in analytics, integration, and visualization.",
    "Knowledge in biostatistics.",
    "Expertise in working with complex data and performing complex analytic tasks.",
    "Effective leadership skills and ability to collaborate with team members.",
    "Ability to work independently and within a team.",
    "Effective problem-solving skills and innovation.",
    "Excellent analytical skills and strong programming abilities.",
    "Strong organization skills and ability to multi-task and prioritize.",
    "Excellent oral and written communication skills and interpersonal skills."
  ],
  "analysis": "The job responsibilities and skills focus primarily on computational imaging, data analysis, and artificial intelligence in the context of medical imaging. The responsibilities include developing research processes in computational imaging, analyzing large datasets, and developing novel computational approaches for medical imaging AI research. The skills required include proficiency in software packages like Python and MATLAB, experience with computational imaging software, and expertise in data analytics and biostatistics.\n\nThere is no explicit mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is more on imaging data, statistical analysis, and computational approaches specific to medical imaging rather than natural language processing or generative tasks typically associated with GenAI or LLMs.\n\nTherefore, based on the provided responsibilities and skills, the job does not appear to involve working with Generative AI or language models.",
  "is_genai_role": false
}