{
  "filename": "j2707c",
  "responsibilities": [
    "Design, implement, and support scalable data infrastructure solutions.",
    "Integrate diverse data sources and aggregate, curate data for reporting, analysis, machine learning models, and ad-hoc data requests.",
    "Work with business owners and Tech leaders to gather infrastructure requirements.",
    "Build data pipelines and data-sets to meet business needs.",
    "Design scalable architecture for building robust applications and pipelines.",
    "Stay abreast of emerging technologies and implement them where appropriate.",
    "Drive both business and technical related discussions and make key decisions contributing to the success of Selling Partner Operations and Business teams."
  ],
  "skills": [
    "Excellent business and communication skills.",
    "Ability to work with business owners and Tech leaders.",
    "Proficiency in data modeling, warehousing, and building ETL pipelines.",
    "Experience with query languages such as SQL, PL/SQL, DDL, MDX, HiveQL, SparkSQL, Scala.",
    "Experience with scripting languages such as Python, KornShell.",
    "Familiarity with AWS big data technologies."
  ],
  "analysis": "The job responsibilities focus on designing, implementing, and supporting scalable data infrastructure solutions, integrating diverse data sources, and building data pipelines. The responsibilities also include working with business owners and tech leaders to gather infrastructure requirements and staying abreast of emerging technologies. The skills required include proficiency in data modeling, warehousing, building ETL pipelines, and experience with query and scripting languages such as SQL, Python, and familiarity with AWS big data technologies.\n\nThere is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is primarily on data infrastructure, data integration, and data pipeline development, which are more aligned with data engineering and data management rather than AI or language model development or deployment.",
  "is_genai_role": false
}