{
  "filename": "j2e691",
  "responsibilities": [
    "Participate in the design and development of complex, scalable software solutions across the full manufacturing test framework stack.",
    "Design and implement robust front-end interfaces using Angular.",
    "Develop and maintain highly available back-end services and APIs using Python and Java.",
    "Design and manage relational databases, primarily MySQL.",
    "Design, implement, and maintain DevOps pipelines to automate the build, test, and deployment processes.",
    "Use Ansible to automate deployment of full stack configurations.",
    "Implement and manage Docker container services.",
    "Configure and maintain Linux-based virtual machines and environments.",
    "Optimize application performance and scalability in a manufacturing context.",
    "Maintain clear and comprehensive documentation for software, systems, and processes.",
    "Work closely with cross-functional teams, including hardware engineers, manufacturing engineers, and quality assurance personnel, to ensure alignment on testing requirements and quality standards.",
    "Stay updated on the latest advancements in testing technologies, methodologies, and industry best practices.",
    "Contribute to the end-to-end architecture, definition, development, and production deployment of production software applications and infrastructure.",
    "Interface with internal engineering, manufacturing, and quality teams and end customers to ensure software deliverables meet rigorous standards."
  ],
  "qualifications": [
    "Expertise in one of the following programming languages: Python, Java, TypeScript.",
    "Familiarity with MySQL or PostgreSQL for database design, optimization, and management.",
    "Expertise in DevOps pipeline development and tools, including Azure DevOps, Docker, and Ansible.",
    "Strong knowledge of front-end frameworks such as Angular and React with expertise in TypeScript, HTML, CSS.",
    "Linux development expertise with a solid understanding of its fundamentals: Ubuntu/CentOS and Bash scripting.",
    "Experience with virtualization technologies such as Docker, Docker Swarm, and VMWare.",
    "Strong knowledge of REST API design and implementation.",
    "Experience with code versioning tools (Git preferred).",
    "Ability to work in an Agile/Scrum environment and collaborate with cross-functional teams.",
    "Strong knowledge of professional software engineering practices for the complete software development life cycle."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on software development, DevOps, and system management within a manufacturing context. The responsibilities include designing and developing software solutions, implementing front-end interfaces, maintaining back-end services, managing databases, and optimizing application performance. The skills required include expertise in programming languages like Python, Java, and TypeScript, familiarity with database management, DevOps pipeline development, and front-end frameworks.\n\nThere is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on traditional software engineering practices, DevOps, and system management rather than AI or machine learning technologies. The job does not involve tasks typically associated with GenAI or LLMs, such as natural language processing, AI model training, or AI-driven content generation.\n\nTherefore, based on the provided information, the job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}