{
  "filename": "j36acd",
  "responsibilities": [
    "Independently lead research projects while collaborating with team members on larger initiatives",
    "Design, run, and analyze scientific experiments to advance understanding of large language models",
    "Synthesize biosecurity research to establish thresholds of concern for AI capabilities",
    "Work with external partners to develop novel evaluations to assess biosecurity implications of models",
    "Partner closely with researchers, data scientists, policy experts, and other cross-functional partners to advance Anthropic’s safety mission",
    "Communicate findings to external stakeholders, such as policymakers"
  ],
  "qualifications": [
    "Ability to write clean, well-documented code in Python",
    "Experience interfacing effectively with machine learning models",
    "Familiarity with prompting and engineering large language models",
    "Strong problem-solving skills and a results-oriented mindset",
    "Excellent communication skills and ability to work in a collaborative environment",
    "Ability to balance research goals with practical engineering constraints",
    "Willingness to pick up slack, even if it goes outside the job description",
    "Preference for fast-moving collaborative projects over extensive solo efforts",
    "Concern for the societal impacts of AI"
  ],
  "analysis": "The job responsibilities include designing, running, and analyzing scientific experiments to advance the understanding of large language models, which directly indicates involvement with language models. Additionally, the responsibility of synthesizing biosecurity research to establish thresholds of concern for AI capabilities suggests a focus on AI technologies, potentially including Generative AI. The skills section further supports this, as it mentions familiarity with prompting and engineering large language models, which is a clear indication of working with LLMs. The ability to interface effectively with machine learning models also suggests involvement with AI technologies. Overall, both the responsibilities and skills strongly indicate that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}