{
  "filename": "j36ca6",
  "responsibilities": [
    "Apply appropriate qualitative and quantitative research methods to evaluate customer experiences and identify opportunities to improve Zillow’s customer experiences",
    "Lead research activities like user interviews, long-form surveys, site-intercept surveys, diary studies, co-design sessions, concept evaluation, and usability testing",
    "Synthesize and frame customer needs to guide product strategy and innovation",
    "Lead multiple projects independently, prioritize research efforts based on business objectives, and drive a research roadmap for a multi-disciplinary team within our AI organization",
    "Uphold responsible AI development practices to ensure ethical, transparent, and fair usage of AI technologies",
    "Present research insights and regularly engage with designers, design technologists, product managers, data scientists, applied scientists, engineers, and other researchers",
    "Travel to in-person collaboration sessions and team building events ~6-8 weeks per year",
    "Contribute, learn, grow, and have fun"
  ],
  "skills": [
    "Expertise designing and executing evaluative research studies to assess digital experiences",
    "Experience moderating remote/virtual research with research participants (e.g., interviews, usability testing)",
    "Expertise in survey design",
    "Expertise in descriptive and inferential statistics",
    "Expertise with data analysis using R or Python and familiarity with SQL",
    "Proven track record thriving in a fast-paced, collaborative environment exploring ambiguous opportunity areas",
    "Adept prioritizing research activities to deliver practical insights and direction quickly",
    "Programmatic thinker able to stand-up and execute multi-phased efforts and research programs",
    "Interest in exploring new experimental methodologies and tools",
    "Hands-on experience experimenting with AI tools in research workflow and curiosity about AI industry trends and AI consumer experiences",
    "Strong product sense"
  ],
  "analysis": "The job responsibilities and skills listed are primarily focused on research and evaluation of customer experiences, with a strong emphasis on qualitative and quantitative research methods, user interviews, surveys, and usability testing. The responsibilities mention leading research activities, synthesizing customer needs, and driving a research roadmap within an AI organization. There is a specific mention of upholding responsible AI development practices, which indicates involvement with AI technologies. However, there is no explicit mention of working with Generative AI or language models (LLMs) in the responsibilities.\n\nIn the skills section, there is a mention of \"hands-on experience experimenting with AI tools in research workflow and curiosity about AI industry trends and AI consumer experiences.\" This suggests some level of interaction with AI tools, but it does not specifically indicate working with Generative AI or LLMs. The skills focus more on research methodologies, data analysis, and statistical expertise.\n\nOverall, while the job is within an AI organization and involves AI tools, there is no direct indication that it specifically involves working with Generative AI or language models. The focus is more on research and evaluation rather than development or application of GenAI or LLMs.",
  "is_genai_role": false
}