{
  "filename": "j38f39",
  "responsibilities": [
    "Develop AI and automation technologies for self-driving labs (SDLs).",
    "Manage SDLs and design research programs leveraging SDL platforms.",
    "Work independently and collaboratively with a diverse team of experts.",
    "Report to the Academic Director and Executive Director of the Acceleration Consortium.",
    "Determine required capabilities of SDLs and develop plans to meet user requirements.",
    "Design novel instruments for automated material synthesis and characterization.",
    "Develop customized hardware and Python software packages for SDLs.",
    "Select, procure, and install equipment required for SDLs.",
    "Develop research programs to support AC faculty and industry partners.",
    "Synthesize and characterize large quantities of candidate molecules using SDLs.",
    "Calibrate theoretical models with experimental data and predict promising candidates.",
    "Elucidate structure-property relationships of emerging molecules and materials.",
    "Implement research and development projects for AC’s industry partners.",
    "Develop plans for research collaborations and estimate financial resources.",
    "Work with Product Managers to ensure research outcomes meet partner requirements.",
    "Promote AC’s research capacity and deliver presentations at conferences.",
    "Collaborate in the preparation and submission of research proposals and progress reports.",
    "Prepare manuscripts for submission to peer-reviewed publications/journals.",
    "Support consulting services related to SDLs for materials discovery.",
    "Support research-focused events such as the Annual Symposium."
  ],
  "qualifications": [
    "Strong and effective communicator in oral and written English.",
    "Collegial in working with team members and collaborators.",
    "Ability to work independently.",
    "Strong publication record.",
    "Success in writing and preparing manuscripts, presentations, reports, briefs, and scientific abstracts for peer-reviewed journals."
  ],
  "analysis": "The job involves developing AI and automation technologies for self-driving labs (SDLs), managing SDLs, and designing research programs. The responsibilities focus on developing customized hardware and Python software packages, synthesizing and characterizing molecules, and calibrating theoretical models with experimental data. The job also involves promoting research capacity, preparing manuscripts, and supporting consulting services related to SDLs for materials discovery.\n\nThe skills required include strong communication, the ability to work independently, and a strong publication record. There is no explicit mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is more on AI and automation technologies for laboratory settings, rather than on natural language processing or generation tasks typically associated with GenAI or LLMs.\n\nOverall, the job seems to be more focused on AI applications in scientific research and laboratory automation rather than on language models or generative AI technologies.",
  "is_genai_role": false
}