{
  "filename": "j3c904",
  "responsibilities": [
    "Lead all on-device AI optimization efforts and collaborate with HQ and other AI Labs for product-level technical implementation.",
    "Define and lead the execution of model compression, distillation, and integration into the full on-device AI user experiences.",
    "Grow and maintain relationships with internal and external stakeholders to develop innovative Edge-centric AI applications and platforms.",
    "Publish novel research at top ML conferences.",
    "Initiate and oversee the development, implementation, administration, monitoring, and improvement of security, policies, programs, and protocols.",
    "Work with leading academic or third-party company researchers to expedite edge-centric AI platform development.",
    "Execute the full software development life cycle (SDLC)."
  ],
  "skills": [
    "Expert-level knowledge of on-device AI model optimization and accelerators.",
    "Familiarity with model compression algorithms including quantization, pruning, and distillation.",
    "Experience optimizing large diffusion models or language models.",
    "Continued experience researching the latest Generative AI trends.",
    "Good understanding of System Architecture for energy-efficient edge AI.",
    "Experience in hybrid architecture design to maximize edge processing and cloud computation.",
    "Collaboration experience with internal and external technical partners.",
    "Excellent communication skills.",
    "Experience working in agile environments with cross-functional delivery teams.",
    "Detailed knowledge of system design and software development methodology and its application to overall system design."
  ],
  "analysis": "The job responsibilities and skills indicate a strong focus on AI model optimization, particularly for on-device applications. The responsibilities include leading AI optimization efforts, model compression, and working with edge-centric AI applications. The skills required include expert-level knowledge of on-device AI model optimization, familiarity with model compression algorithms, and experience optimizing large diffusion models or language models. Additionally, there is a mention of researching the latest Generative AI trends. These points suggest that the job involves working with Generative AI and language models, as it requires experience with large diffusion models or language models and staying updated with Generative AI trends.",
  "is_genai_role": true
}