{
  "filename": "j3cc91",
  "responsibilities": [
    "Enable and scale the efforts of the Acquisition and Growth Marketing channels through analytics engineering skills.",
    "Support growth marketing and ensure tracked data is accurate and trustworthy.",
    "Own cookie compliance, partnering closely with legal, security, consent manager, and teams that track and collect user data.",
    "Drive innovation leveraging AI/ML to improve and scale growth efforts and drive efficiencies.",
    "Track and measure data to inform marketing strategies, optimize campaigns, and drive scalable growth.",
    "Implement and maintain enterprise-level Google Tag Manager (GTM) setups across multiple properties.",
    "Design and deploy custom GTM tags, triggers, and variables to track user interactions.",
    "Optimize GTM for scalability and performance.",
    "Collaborate with marketing teams to define and implement custom tracking for various initiatives.",
    "Build and document robust event schemas for consistent data tracking.",
    "Work with BI and D&A teams to ensure events feed correctly into analytics, CRM, and attribution systems.",
    "Implement and maintain Custom Events, Audiences, and/or Segments for Growth Marketing.",
    "Monitor and audit custom events daily.",
    "Own the Cookie Consent Management Platform and ensure compliance with privacy regulations.",
    "Integrate cookie consent solutions with GTM.",
    "Regularly audit data collection processes for compliance.",
    "Partner with Legal and Security to maintain a compliant process for using cookies.",
    "Design and maintain scalable analytics pipelines with engineering teams.",
    "Ensure proper integration of GTM with analytics platforms.",
    "Collaborate with data engineers for clean and accurate data flows.",
    "Work with CRO & Engineering partners on A/B and multivariate tests.",
    "Provide guidance on analytics implementation strategy.",
    "Strategize with team members to measure new data for growth.",
    "Troubleshoot data discrepancies and recommend solutions."
  ],
  "qualifications": [
    "Strong knowledge of event-driven analytics and marketing performance tracking.",
    "Strong aptitude for learning new frameworks and platforms.",
    "Experience with Google and Bing Ads API.",
    "Familiarity with cookie consent tools and privacy regulations.",
    "Proficiency with analytics platforms like GA4 & Amplitude.",
    "Experience with debugging tools like Tag Assistant, Charles Proxy, or Fiddler.",
    "Strong SQL skills and familiarity with modern data stack tools.",
    "Expertise with Javascript Frameworks/Next.js and connecting to REST/APIs services.",
    "Knowledge of scripting languages such as JavaScript or Python.",
    "Experience with server-side tagging and first-party data strategies.",
    "Experience managing 3rd Party Cookies.",
    "Familiarity with marketing attribution models and tools.",
    "Hands-on experience in CRO, A/B testing frameworks, and data visualization tools.",
    "Strong communication and stakeholder management skills.",
    "Analytical mindset with a passion for solving complex growth problems.",
    "Ability to translate technical insights into actionable recommendations for non-technical stakeholders.",
    "Proactive and collaborative approach to cross-functional teamwork."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on analytics engineering, growth marketing, data tracking, and compliance with privacy regulations. The responsibilities include tasks such as enabling marketing efforts through analytics, driving innovation with AI/ML, implementing Google Tag Manager setups, and ensuring data compliance. The skills required include knowledge of event-driven analytics, proficiency with analytics platforms, experience with debugging tools, and strong SQL skills.\n\nWhile there is a mention of leveraging AI/ML to improve and scale growth efforts, there is no specific mention of working with Generative AI (GenAI) or language models (LLMs). The focus seems to be more on data analytics, marketing performance tracking, and compliance rather than on developing or utilizing GenAI or LLMs.\n\nTherefore, based on the provided responsibilities and skills, it does not appear that the job involves working directly with Generative AI or language models.",
  "is_genai_role": false
}