{
  "filename": "j3d2af",
  "responsibilities": [
    "Work closely with engineers, researchers, and product managers to implement ML solutions that promote globalization and culturalization.",
    "Work across organizational boundaries to align on priorities and drive projects forward.",
    "Contribute to designing and developing Machine Learning technologies for text, image, audio, and video, focusing on Generative AI.",
    "Collaborate with cross-functional teams, including machine learning engineers, research engineers, and product management, to contribute to new ML features.",
    "Engage in the product lifecycle, design, deployment, and production operations.",
    "Be comfortable with prompt engineering and building models leveraging large data.",
    "Preprocess, clean, organize, and evaluate datasets as needed for model training and evaluation.",
    "Evaluate model performance and improve accuracy.",
    "Stay up-to-date with the latest machine learning and AI technologies, bringing innovative solutions to the team and advocating for new tools, frameworks, and methodologies.",
    "Create and maintain detailed documentation for data processing, model development, testing, and integration ensuring clear communication across teams and stakeholders."
  ],
  "qualifications": [
    "Proficient in multiple programming languages (preferably Typescript/Javascript, Python), web components and ML frameworks.",
    "Knowledge and experience with the entire ML training pipeline (data collection, training and evaluation).",
    "Good verbal and written communication skills.",
    "Self-motivated, self-starter, quick learner, independent."
  ],
  "analysis": "The job responsibilities include contributing to designing and developing Machine Learning technologies for text, image, audio, and video, with a specific focus on Generative AI. This clearly indicates that the job involves working with Generative AI. Additionally, the responsibilities mention being comfortable with prompt engineering and building models leveraging large data, which is often associated with working with language models or Large Language Models (LLMs). The skills required, such as proficiency in programming languages and ML frameworks, support the development and implementation of such AI technologies. Overall, the job involves working with both Generative AI and language models.",
  "is_genai_role": true
}