{
  "filename": "j3f1cb",
  "responsibilities": [
    "Develop scalable, robust, and automated reporting systems to handle high-volume data needs and power data-driven decision-making.",
    "Create analytics reports that provide actionable insights and meet diverse business and customer requirements.",
    "Model and design modern data structures in SQL/NoSQL databases, ensuring optimal performance and scalability.",
    "Develop and maintain dashboards using tools like Looker, Looker Studio, and other BI platforms to visualize high-volume data effectively.",
    "Write robust, performant, and maintainable code for data processing and analytics.",
    "Craft and optimize complex SQL queries to handle high-volume data efficiently.",
    "Collaborate with internal business teams and external stakeholders to define requirements and deliver impactful reporting solutions.",
    "Document and maintain workflows to support the scalability and reliability of reporting and analytics systems."
  ],
  "skills": [
    "Expertise in Java and Python for building reporting jobs and data processing.",
    "Deep understanding of data modeling and working with relational and NoSQL databases.",
    "Ability to create highly performant, scalable, and maintainable codebases.",
    "Hands-on experience with reporting tools or frameworks (e.g., Tableau, Looker, or custom solutions).",
    "Knowledge of ETL/ELT pipelines and transforming raw data into business-ready formats.",
    "Experience with data visualization best practices to design impactful dashboards."
  ],
  "analysis": "The job responsibilities and skills focus primarily on data processing, analytics, and reporting. The responsibilities include developing reporting systems, creating analytics reports, modeling data structures, and maintaining dashboards. The skills required are expertise in Java and Python, data modeling, working with databases, and experience with reporting tools and data visualization.\n\nThere is no mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The job is centered around data analytics, reporting, and visualization, which are distinct from the tasks typically associated with GenAI or LLMs, such as natural language processing, text generation, or working with AI models.\n\nTherefore, based on the provided information, the job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}