{
  "filename": "j40145",
  "responsibilities": [
    "Collect external data and create actionable fraud and financial crime intelligence for enterprise control owners.",
    "Conduct internal threat hunting and analytical research to detect active attacks and emerging trends.",
    "Perform control validation testing to identify and remediate control and data visibility gaps.",
    "Enhance the organization's ability to detect and prevent cyber-enabled financial crimes.",
    "Develop new signals and rapid prototypes to mitigate fraud losses and cybercrime exposure.",
    "Assess criminal enablement tools/services and develop new fingerprint and detection capabilities.",
    "Conduct advanced threat simulations and perform control tests.",
    "Collaborate and consult with peers, colleagues, and managers to resolve issues and achieve goals.",
    "Mitigate fraud losses and operational expenses by improving mean-time-to-detect (MTD).",
    "Partner with Engineering on deploying production-ready/scalable capabilities.",
    "Drive efficiency, automation, and collaboration across relevant horizontal processes.",
    "Detect account patterns and features linked to Crime-as-a-Service enablers and cybercriminal tactics, techniques, and procedures (TTPs).",
    "Develop a deep understanding of internal systems that could be exploited by financially motivated criminals."
  ],
  "skills": [
    "Cyber security threat detection and response",
    "Offensive cybercrime security research",
    "Complex financial crime investigations (fraud, Anti-Money Laundering)",
    "Fraud strategies",
    "Data science and advanced analytical threat detection",
    "Log analysis, Splunk, pen testing, mobile and/or cloud security",
    "Reverse engineering",
    "Security architecture",
    "Financial crime detection management",
    "BOT mitigation platforms and edge security controls",
    "Incident response lifecycle management",
    "Proficient operational security",
    "Knowledge of FinCEN's financial crime priorities, including BSA/AML",
    "Python programming (a plus)"
  ],
  "analysis": "The job responsibilities and skills focus primarily on cybersecurity, fraud detection, and financial crime prevention. The responsibilities include tasks such as threat hunting, control validation, developing detection capabilities, and conducting threat simulations. The skills required include cyber security threat detection, offensive cybercrime research, financial crime investigations, and data science for threat detection. While data science and advanced analytics are mentioned, there is no specific mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is more on cybersecurity, fraud strategies, and financial crime detection rather than on developing or working with GenAI or LLMs.",
  "is_genai_role": false
}