{
  "filename": "j44b89",
  "responsibilities": [
    "Catalyze interdisciplinary collaboration in applied artificial intelligence and advanced applications of AI.",
    "Attract significant external research funding.",
    "Enrich undergraduate and graduate students’ experience.",
    "Develop and apply novel AI and advanced data science integrated with strategically important research areas.",
    "Conduct applied research and tool development in areas such as physics-informed neural networks, digital twins, and uncertainty quantification in machine learning.",
    "Teach at the undergraduate level in one or more of the departments/units at the university.",
    "Work in a team environment to develop new undergraduate offerings.",
    "Collaborate with external stakeholders, such as industry, K-12, community colleges, innovation hubs, government, and non-profit organizations.",
    "Mentor students in computing at the undergraduate and graduate level."
  ],
  "qualifications": [
    "Ability to conduct interdisciplinary, multidisciplinary, or transdisciplinary research.",
    "Ability to develop a high-profile computing-focused research program in AI.",
    "Ability to collaborate with external stakeholders.",
    "Potential for excellence in teaching, training, and mentoring students.",
    "Experience in applied, use-inspired computing focusing on innovative use or development of AI methods."
  ],
  "analysis": "The job involves conducting applied research and tool development in areas such as physics-informed neural networks, digital twins, and uncertainty quantification in machine learning. These areas are related to advanced applications of AI but do not specifically mention Generative AI or language models. The responsibilities also include developing and applying novel AI and advanced data science, which could potentially involve GenAI or LLMs, but it is not explicitly stated. The skills required include experience in applied, use-inspired computing focusing on innovative use or development of AI methods, which again could involve GenAI or LLMs, but there is no direct mention of these technologies. Overall, while the job is heavily focused on AI, there is no explicit indication that it involves working with Generative AI or language models.",
  "is_genai_role": false
}