{
  "filename": "j45612",
  "responsibilities": [
    "Design and build Outschool's AI-powered educational assistant from the ground up, iterating rapidly on core features.",
    "Create scalable systems that effectively utilize rich educational content across video, text, and user interaction data.",
    "Lead technical implementation of AI features while maintaining a strong user-centric focus.",
    "Establish patterns for responsible AI development, testing, and monitoring.",
    "Guide and mentor engineers in building AI-powered features.",
    "Partner closely with product leadership to evolve AI strategy and roadmap."
  ],
  "qualifications": [
    "Strong technical breadth across full stack development, data processing, and AI systems.",
    "Ability to lead 0->1 product development in fast-paced environments.",
    "Experience building consumer-facing AI features, particularly with LLMs and conversational interfaces.",
    "Strong product intuition and user-centric approach to development.",
    "Ability to think from first principles in new domains.",
    "Clear judgment in balancing rapid iteration with scalable foundations."
  ],
  "analysis": "The job involves designing and building an AI-powered educational assistant, which suggests the use of AI technologies. The responsibilities include creating scalable systems that utilize educational content across various formats, leading technical implementation of AI features, and establishing patterns for responsible AI development. These tasks indicate a focus on AI-driven solutions.\n\nThe skills required for the job include experience in building consumer-facing AI features, particularly with LLMs and conversational interfaces. This explicitly mentions Large Language Models (LLMs), which are a type of Generative AI. Additionally, the ability to lead product development in fast-paced environments and a strong user-centric approach further support the involvement of AI technologies.\n\nOverall, both the responsibilities and skills clearly indicate that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}