{
  "filename": "j46beb",
  "responsibilities": [
    "Train state-of-the-art models and improve core capabilities like coding and creative reasoning.",
    "Design challenging evaluations for novel capabilities and construct RL environments.",
    "Develop scalable synthetic data techniques in RL and study them.",
    "Train models and run scientific experiments.",
    "Iterate on research experiments and clearly communicate insights to the team.",
    "Integrate core behaviors into the next generation frontier models (e.g., o-series).",
    "Co-create novel product surfaces and interaction paradigms.",
    "Collaborate with product, design, and engineering teams to bring conceptual prototypes from the research phase into production."
  ],
  "qualifications": [
    "Highly skilled in Python.",
    "Capable of leading ambitious projects with clear communication skills.",
    "Familiarity with designing quality research experiments and evaluations with rapid iterations.",
    "Familiarity with Machine Learning, Deep Learning, and Large Language Models and related infrastructure (e.g., PyTorch).",
    "Familiarity with working in complex technical environments and/or improving research velocity.",
    "Bonus: Experience with large scale data systems such as Beam or Spark.",
    "Bonus: Experience in design engineering, autonomous and capable of rapid prototyping."
  ],
  "analysis": "The job responsibilities include training state-of-the-art models, improving core capabilities like coding and creative reasoning, and integrating core behaviors into next-generation frontier models. These tasks suggest involvement with advanced AI models, potentially including Generative AI. The responsibilities also mention developing scalable synthetic data techniques in RL (Reinforcement Learning) and running scientific experiments, which are common in AI research and development.\n\nThe skills section explicitly mentions familiarity with Machine Learning, Deep Learning, and Large Language Models (LLMs), which directly indicates that the job involves working with language models. Additionally, the mention of related infrastructure such as PyTorch, which is commonly used for developing and training AI models, further supports this.\n\nOverall, both the responsibilities and skills strongly suggest that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}