{
  "filename": "j46d52",
  "responsibilities": [
    "Develop sophisticated Search & Knowledge Graph solutions.",
    "Build and optimize high-performance search and retrieval solutions for enterprise-scale environments.",
    "Contribute to intelligent retrieval pipelines by implementing hybrid retrieval techniques.",
    "Participate in automating capacity planning, configuration, and supervising for real-time optimization.",
    "Lead technical epics, ensuring alignment across teams and timely delivery of high-quality solutions.",
    "Collaborate with Product Managers, ML Engineers, and Knowledge Graph experts to deliver scalable AI-driven solutions.",
    "Drive innovation in Search and Knowledge Graphs by staying updated on emerging technologies."
  ],
  "skills": [
    "Strong experience with search optimization, Knowledge Graphs, and innovative retrieval techniques.",
    "Proficiency in semantic and vector-based search.",
    "Experience with vector databases (e.g., FAISS, Pinecone, Milvus) and ANN search algorithms.",
    "Hands-on NLP and LLMs expertise for enterprise-scale applications.",
    "Experience with graph databases (e.g., Neo4j, Amazon Neptune) and graph embedding techniques.",
    "Strong programming skills in Python and ML frameworks (TensorFlow, PyTorch).",
    "Experience in building multi-stage retrieval workflows.",
    "Familiarity with re-ranking, hybrid search, and knowledge-augmented retrieval techniques.",
    "Experience in implementing graph-based search and context expansion methods.",
    "Knowledge of schema design, ontology management, and Knowledge Graph curation.",
    "Experience incorporating user feedback and relevance signals for continuous improvement.",
    "Strong collaboration skills across engineering, research, and product teams."
  ],
  "analysis": "The job responsibilities and skills indicate a strong focus on search optimization, Knowledge Graphs, and retrieval techniques. The responsibilities include developing sophisticated search solutions, optimizing search and retrieval for enterprise environments, and collaborating with ML Engineers and Knowledge Graph experts. The skills required include proficiency in semantic and vector-based search, experience with vector databases, and hands-on NLP and LLMs expertise for enterprise-scale applications. The mention of \"LLMs expertise\" directly indicates that the job involves working with language models. Additionally, the focus on NLP (Natural Language Processing) and the use of ML frameworks like TensorFlow and PyTorch further suggest involvement with language models. While the primary focus is on search and Knowledge Graphs, the explicit mention of LLMs expertise confirms that the job involves working with language models.",
  "is_genai_role": true
}