{
  "filename": "j483f3",
  "responsibilities": [
    "Design and build reusable components, frameworks, and libraries at scale to support analytics products.",
    "Identify and solve issues concerning data management to improve data quality.",
    "Clean, prepare, and optimize data for ingestion and consumption.",
    "Build continuous integration, test-driven development, and production deployment frameworks.",
    "Work with Data Engineering teammates to review, design, code, and test plans.",
    "Collaborate with business and Technology partners to build well-defined components that support the implementation of product features.",
    "Establish database management system standards, guidelines, and quality assurance for database deliverables."
  ],
  "skills": [
    "Cloud Computing & Engineering (AWS)",
    "Database Engineering [SQL] (Snowflake)",
    "Programming & Scripting (Python, Shell)",
    "Data Warehousing & ETL",
    "Data Architecture",
    "Data Modelling",
    "Data Analysis",
    "Data visualization (Tableau)",
    "Marketing Technology Systems & Application",
    "API Engineering & Management"
  ],
  "analysis": "The job responsibilities focus on designing and building components, frameworks, and libraries to support analytics products, improving data quality, and optimizing data for ingestion and consumption. It also involves building continuous integration and deployment frameworks, collaborating with business and technology partners, and establishing database management standards. The skills required include cloud computing, database engineering, programming, data warehousing, data architecture, data modeling, data analysis, data visualization, marketing technology systems, and API engineering.\n\nThere is no mention of working with Generative AI or language models in the responsibilities or skills. The focus is primarily on data engineering, data management, and analytics, with an emphasis on cloud computing, database systems, and data processing technologies. While these skills and responsibilities are crucial for data-driven roles, they do not specifically indicate involvement with GenAI or LLMs.",
  "is_genai_role": false
}