{
  "filename": "j4a498",
  "responsibilities": [
    "Design, run, and analyze scientific experiments to advance understanding of large language models and their application to cybersecurity tasks",
    "Lead technical design discussions to ensure infrastructure can support both current needs and future research directions",
    "Collaborate with other engineers to maintain evaluations codebase",
    "Work with external partners to develop novel evaluations to accurately assess the cybersecurity implications of models",
    "Partner closely with researchers, data scientists, policy experts, and other cross-functional partners to advance Anthropic’s safety mission"
  ],
  "qualifications": [
    "Strong software engineering or AI/ML research experience",
    "Strong interest or experience in offensive cybersecurity",
    "Ability to write clean, well-documented code in Python",
    "Experience using technical infrastructure to interface effectively with machine learning models",
    "Familiarity with prompting and engineering large language models",
    "Strong problem-solving skills and a results-oriented mindset",
    "Excellent communication skills and ability to work in a collaborative environment",
    "Ability to balance research goals with practical engineering constraints"
  ],
  "analysis": "The job responsibilities include designing, running, and analyzing scientific experiments to advance the understanding of large language models and their application to cybersecurity tasks. This directly indicates involvement with large language models (LLMs). Additionally, the responsibility to work with external partners to develop novel evaluations to assess the cybersecurity implications of models further suggests working with LLMs.\n\nIn the skills section, there is a specific mention of familiarity with prompting and engineering large language models, which is a clear indication of working with LLMs. The requirement for experience using technical infrastructure to interface effectively with machine learning models also supports the involvement with LLMs.\n\nOverall, both the responsibilities and skills sections strongly indicate that the job involves working with large language models, which are a type of Generative AI.",
  "is_genai_role": true
}