{
  "filename": "j4ae09",
  "responsibilities": [
    "Conduct and lead novel research in applied machine learning and artificial intelligence.",
    "Work with and lead interdisciplinary teams to turn research results into prototype operational capabilities for government customers and stakeholders.",
    "Plan, develop, and carry out an overall research strategy, and influence the national research agenda regarding future technology.",
    "Actively participate on teams of software developers, researchers, designers, and technical leads.",
    "Build relationships and collaborate with researchers, government customers, and other stakeholders to understand challenges, needs, possible solutions, and research directions.",
    "Contribute to improving the overall technical capabilities of the Center by mentoring and teaching others, participating in design sessions, and sharing insights and wisdom across the SEI AI Division.",
    "Identify and investigate emerging AI and AI-adjacent technologies.",
    "Perform and publish impactful original research in the field of adversarial machine learning.",
    "Adapt and apply existing research in the field to solve real-world problems.",
    "Transition and provide guidance on AI capabilities to government sponsors."
  ],
  "qualifications": [
    "Comprehensive knowledge of machine learning.",
    "A track record of conducting research and applying scientific methods to solve difficult problems.",
    "Experience leading research projects in novel areas with limited previous work to build upon.",
    "Ability to work with leadership to plan, develop, and deliver an overall research strategy.",
    "Strong written and verbal communication skills; ability to convey complex technical ideas in layperson’s terms.",
    "Proficiency in writing funding proposals or pitching ideas for new research projects.",
    "Ample experience with publishing written or technical artifacts showcasing your work.",
    "Strong collaboration skills for working with colleagues and sponsors.",
    "Willingness to guide and mentor junior team members."
  ],
  "analysis": "The job involves conducting and leading research in applied machine learning and artificial intelligence, which could potentially include Generative AI (GenAI) and language models (LLMs). However, the responsibilities and skills listed do not explicitly mention working with GenAI or LLMs. The focus seems to be on general AI and machine learning research, including adversarial machine learning, which is a broader field. The responsibilities include leading interdisciplinary teams, developing research strategies, and collaborating with various stakeholders, which are common in AI research roles but do not specifically indicate a focus on GenAI or LLMs. The skills required, such as comprehensive knowledge of machine learning and experience in research, are also applicable to a wide range of AI research areas, not specifically GenAI or LLMs. Therefore, while the job could potentially involve GenAI or LLMs, there is no direct evidence from the responsibilities and skills that it specifically focuses on these technologies.",
  "is_genai_role": false
}