{
  "filename": "j4b7a2",
  "responsibilities": [
    "Design, build, and test circuits (PCBs)",
    "Work on prototype boards for automotive, aerospace, and personal computers",
    "Build and maintain the EE test lab, including sourcing and setting up testing equipment",
    "Run maintenance and calibration tasks for oscilloscopes, DAQs, power sources, sensors, load simulators, and digital communication interfaces",
    "Design and build automatic test execution scripts/software and integrate them into the ATLAS product platform",
    "Design and execute experiments to test, debug, and root cause PCB failures",
    "Expand the test lab to improve controls and measurement for common failure modes",
    "Serve as the domain expert and primary collaborator with software engineering and ML teams",
    "Travel domestically and internationally (up to 25% of the time)",
    "Work in person at Arena's NYC headquarters when not traveling"
  ],
  "qualifications": [
    "Ability to design, build, and test circuits",
    "Experience with prototype boards and commercial PCBs",
    "Proficiency in setting up and maintaining testing equipment",
    "Skills in designing and building automatic test execution scripts/software",
    "Ability to test, debug, and root cause PCB failures",
    "Familiarity with standard EDA and simulation tools (Cadence, Synopsys, Ansys)",
    "Knowledge of SPICE, PDN, and Verilog-AMS",
    "Familiarity with debugging and root causing EMI/EM parasitics",
    "Programming/scripting skills in Python, NI LabView, Matlab",
    "Strong communication and collaboration skills",
    "Hands-on and eager to build things from 0 to 1"
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on electrical engineering tasks, such as designing, building, and testing circuits (PCBs), working with prototype boards, maintaining testing equipment, and debugging PCB failures. The role also involves designing and building automatic test execution scripts/software, which suggests some level of software development, but it is specifically related to testing and hardware integration.\n\nThe skills required include proficiency in setting up and maintaining testing equipment, knowledge of EDA and simulation tools, and programming/scripting skills in Python, NI LabView, and Matlab. These skills are relevant to electrical engineering and testing but do not specifically indicate work with Generative AI or language models.\n\nThe mention of collaboration with software engineering and ML teams could imply some interaction with machine learning, but there is no direct reference to Generative AI or language models in the responsibilities or skills. The focus is more on hardware and testing rather than AI model development or deployment.\n\nOverall, the job does not explicitly involve working with Generative AI or language models, as the primary focus is on electrical engineering and testing tasks.",
  "is_genai_role": false
}