{
  "filename": "j4dfb0",
  "responsibilities": [
    "Work as part of a team to support late-stage assay development by performing mass spectrometry to characterize molecules, degradation pathways, and define critical quality attributes in a phase-appropriate context.",
    "Contribute to analytical method development and qualification to support protein characterization activities.",
    "Support comparability and stability studies by mass spectrometry.",
    "Operate, maintain, and troubleshoot Waters and Bruker QTOFs and Thermo Orbitrap mass spectrometers.",
    "Work on moderately complex problems where analysis of situations or data requires evaluation of intangible variables requiring regular use of intelligence, logic, ingenuity, and creativity.",
    "Collaborate with junior and senior team members to advance the development of state-of-the-art techniques to characterize substances, assays, and tools.",
    "Represent the Structure Characterization group in cross-functional project teams.",
    "Participate in technology transfer of assays from analytical development to QC and external CRO/CMOs.",
    "Participate in process comparability studies and coordinate analysis of in-process and product-related impurities as needed.",
    "Conduct scientific research for the development of drug candidates or research support of marketed drugs.",
    "Advise project teams on the planning and execution of laboratory experiments, considering economic, regulatory, and safety factors.",
    "Present results of work, interpret data, and draw conclusions regarding presented material and nature of work.",
    "Maintain familiarity with state-of-the-art scientific principles and literature and apply such knowledge appropriately to projects and in support of the Company’s interests.",
    "Represent the company at national/international conferences."
  ],
  "qualifications": [
    "Strong knowledge in mass spectrometry, experimental design, and assay development.",
    "Familiarity with peptide mapping by LC-MS/MS, intact mass analysis, MS/MS for protein and carbohydrate structural elucidation/quantification, kinetic analyses, ultra-performance chromatography, and proteolytic/chemical processing.",
    "Knowledge of ICH guidelines and GMP is a plus.",
    "Expertise in mass spectrometry analysis software (Protein Metrics, Thermo BioPharma Finder, and Skyline) and data analysis/visualization tools (Python, R, JMP, and Spotfire).",
    "Excellent communication skills (both verbal and technical) and interpersonal skills.",
    "Ability to participate in highly effective teams.",
    "Ability to think critically and creatively and work independently.",
    "Strong organizational and planning skills.",
    "Ability to work in a matrixed environment and effectively communicate ideas, assay results, and issues."
  ],
  "analysis": "The job responsibilities and skills listed are primarily focused on mass spectrometry, assay development, protein characterization, and analytical method development. The tasks involve operating and troubleshooting mass spectrometers, conducting scientific research for drug development, and participating in technology transfer and process comparability studies. The skills required include knowledge of mass spectrometry, peptide mapping, and data analysis/visualization tools like Python and R. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on scientific research and analytical techniques related to mass spectrometry and protein characterization, rather than AI or language models.",
  "is_genai_role": false
}