{
  "filename": "j4f7cf",
  "responsibilities": [
    "Develop software aligned with specifications & designs, ensuring code is well-tested, maintainable, and documented.",
    "Work autonomously with minimal oversight, delivering production-ready solutions that prioritize long-term maintainability and supportability.",
    "Act as a Subject Matter Expert for your team's product, contributing to complex algorithmic tasks, feature designs, and broader technical standards.",
    "Create, communicate, and defend design decisions to your team and the broader engineering organization through demo sessions, chapter meetings, and architecture reviews.",
    "Take ownership of Jira epics or large tasks, driving them to completion and demonstrating work to ensure requirements are met.",
    "Manage builds, releases, and change log creation while adapting development efforts to align with the team's SDLC.",
    "Oversee engineering briefs, review architectural design documents, and maintain a customer-centric approach while supporting team members through regular check-ins and feedback.",
    "Mentor engineers through facilitating pull-request reviews for your team, paired programming sessions, and technical guidance on design & best practices.",
    "Collaborate with Product to refine Jira tasks, estimate effort for development activities, and align Pod priorities with roadmap timelines.",
    "Oversee Jira standards for the team’s work, ensuring work is scoped properly with clear & tangible acceptance criteria.",
    "Identify and document technical debt, translating it into actionable tickets for review.",
    "Oversee and review Pod technical work, ensuring feature stability and adherence to the application’s architecture."
  ],
  "skills": [
    "Mastery in Typescript/Javascript or a similar functional programming language which isn’t strongly typed, including understanding threading or multi-processing for the given language.",
    "Working knowledge of AWS Lambdas or AWS Fargate.",
    "Mastery of a standard IDE for code development.",
    "Familiarity with a standard code repository (e.g., git).",
    "Familiarity with the standard package manager used by Node.",
    "Demonstrated proficiency on how to deploy the framework.",
    "Familiarity with one CI/CD framework.",
    "Experience designing and developing product features from design to production deployment.",
    "Previous experience supporting a production environment.",
    "Ability to demonstrate good communication skills, including the ability to clearly and adequately define a position and defend it (in writing or verbally).",
    "Ability to document a design, component, or workflow they have working knowledge of.",
    "Ability to create and design technical workflows and break that larger project into smaller workable components."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention working with Generative AI (GenAI) or language models (LLMs). The responsibilities focus on software development, code maintenance, design decisions, and team collaboration. The skills required include proficiency in programming languages like Typescript/Javascript, AWS services, IDEs, code repositories, CI/CD frameworks, and communication skills. There is no mention of tasks or skills related to developing, deploying, or working with GenAI or LLMs, such as natural language processing, machine learning, or AI model training and deployment. The focus is more on general software engineering and development practices rather than AI-specific tasks.",
  "is_genai_role": false
}