{
  "filename": "j4ff54",
  "responsibilities": [
    "Collaborate with customer stakeholders and internal teams to design end-to-end technical architectures for seamless integration of Parloa into complex enterprise environments.",
    "Serve as the bridge and voice between customer requirements and internal engineering, translating business needs into actionable technical specifications and scalable solutions.",
    "Lead strategic customer projects to build bespoke features and extensions, iterating quickly to address evolving customer needs.",
    "Advise customers and non-technical colleagues on technical topics, including conversational AI, backend integrations, telephony systems, and voice bot logic design.",
    "Collaborate on data analytics projects, enabling clear and actionable reporting on customers’ voice bots using Python, SQL, and KQL.",
    "Build serverless web services using TypeScript to extend the product and provide custom functionality for strategic accounts.",
    "Continuously evaluate customer feedback and product performance to propose improvements and collaborate with the product team to shape Parloa’s roadmap."
  ],
  "qualifications": [
    "Strong understanding of TypeScript and Python.",
    "Familiarity with distributed systems, APIs, and microservice architectures.",
    "Knowledge of telephony communication.",
    "Excellent communication and presentation skills in English.",
    "Strong interest in generative and conversational AI.",
    "Ability to work autonomously and take ownership of tasks from inception to completion."
  ],
  "analysis": "The job involves several responsibilities and skills that suggest a focus on conversational AI and potentially generative AI. The responsibilities mention advising on conversational AI and voice bot logic design, which are areas where generative AI and language models are often applied. Additionally, the skills section explicitly mentions a \"strong interest in generative and conversational AI,\" indicating that the job likely involves working with these technologies. While the responsibilities do not explicitly mention generative AI or language models, the context of conversational AI and the skills required strongly suggest that the job involves working with these technologies.",
  "is_genai_role": true
}