{
  "filename": "j5020b",
  "responsibilities": [
    "Coordinate within development teams to automate and develop tools and technology to streamline deployment and contribute to product roadmap",
    "Improve smart building global deployment tools, templates, and processes automation related to project scalability deployment",
    "Write efficient, scalable, and maintainable code to ensure high-performance and reliable backend functionality and API",
    "Work as part of a team to develop custom web-based monitoring, data-driven analysis, and control systems, meeting both internal and client requirements",
    "Create sustainable systems and services through automation and uplifts",
    "Participate cross-functionally with teams for testing and implementation",
    "Document work processes and procedures",
    "Manage weekly time allocations to multiple assigned projects for on-time weekly submission of the individual’s timesheet",
    "Other tasks as assigned"
  ],
  "skills": [
    "Strong understanding of software engineering principles, including writing reusable, testable, and efficient Python applications, with a solid grasp of Object-Oriented Programming concepts",
    "Proficiency in backend development, including designing, developing, and deploying microservices and RESTful APIs using Python FastAPI framework",
    "Experience in working with both relational databases (e.g., MySQL) and NoSQL databases (e.g., MongoDB)",
    "Hands-on experience with containerization tools (Docker) and CI/CD tooling such as Terraform and GitLab",
    "Proven experience in deployment in AWS environments",
    "Strong organizational and communication skills, able to work in Agile framework",
    "Experience with frontend technologies such as HTML, CSS, and JavaScript, and one web application development framework (React, Vue.js) (Nice to have)",
    "Knowledge of Smart Building, Building Automation Systems (BAS), and HVAC operation (Nice to have)",
    "Good understanding of data-driven systems/solutions and IT network (Nice to have)"
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on software engineering, backend development, automation, and deployment in smart building environments. The responsibilities include tasks such as developing tools for deployment, writing scalable code, and creating web-based monitoring systems. The skills required include proficiency in Python, backend development, containerization, and deployment in AWS environments. There is no mention of Generative AI, language models, or any specific tasks related to working with AI models or LLMs. The focus is more on software development, automation, and smart building technologies rather than AI or language models.",
  "is_genai_role": false
}