{
  "filename": "j50a9f",
  "responsibilities": [
    "Define, develop, and deliver novel solutions to a broad range of problems including applications in target detection and tracking, deep learning, machine learning, autonomous system control and decision systems, computer vision, signal analysis, and brain-computer interfaces for the Government and commercial industry.",
    "Lead development and implement advanced algorithms on PC, GPU, and SoC architectures in collaboration with other colleagues (~50%).",
    "Assist with software design, architecture, and implementation across a diverse set of projects including advanced research, mobile applications, and platform technologies (~45%).",
    "Travel occasionally (less than 5% time)."
  ],
  "skills": [
    "5-10 years of experience.",
    "Experience with CUDA and GPU programming.",
    "Familiarity with scientific programming in Python.",
    "Experience with C or C++.",
    "Familiarity with standard math libraries (e.g., BLAS/LAPACK/ScaLAPack).",
    "Familiarity with software development practices (revision control/compiler tricks/debugger) under Windows/Linux/Unix.",
    "Knowledge of computer architecture (GPU/FPGA/distributed computing), operating systems, networking, storage systems, Unix/Linux, MATLAB.",
    "Excellent interpersonal and communication (presentation & writing) skills.",
    "Coursework in software development and computer architecture.",
    "Coursework in algorithms is strongly desired."
  ],
  "analysis": "The job responsibilities include defining, developing, and delivering novel solutions in areas such as target detection, tracking, deep learning, machine learning, autonomous systems, computer vision, signal analysis, and brain-computer interfaces. These areas are related to advanced computational techniques and AI but do not specifically mention Generative AI or language models. The focus seems to be on algorithm development, software design, and implementation across various platforms, including PC, GPU, and SoC architectures.\n\nThe skills required include experience with CUDA and GPU programming, scientific programming in Python, C or C++, and familiarity with standard math libraries and software development practices. There is also a focus on computer architecture, operating systems, and networking. While these skills are relevant to AI and machine learning, they do not specifically indicate work with Generative AI or language models.\n\nOverall, the job description emphasizes algorithm development, software design, and implementation in a broad range of AI-related fields but does not explicitly mention Generative AI or language models. Therefore, it is unlikely that the job involves working specifically with Generative AI or language models.",
  "is_genai_role": false
}