{
  "filename": "j57b6d",
  "responsibilities": [
    "Plan, design, maintain, and execute test cases with minimal direction",
    "Free test without scripts and tools",
    "Report bugs with outstanding isolation and regression techniques",
    "Manage priorities and communicate progress and risks effectively and systematically",
    "Coordinate multi-functional test efforts with other team members",
    "Engage in continual dialogue with Engineering and Design as products evolve",
    "Advocate on behalf of users with compassion",
    "Streamline processes for data collection and systematically parse large data sets"
  ],
  "qualifications": [
    "Strong creative, technical, and analytic skills",
    "Passion for new technologies related to computer vision/on-device machine learning",
    "Ability to balance multiple efforts simultaneously and meet strict deadlines",
    "Proven bug detection, isolation, and regression skills",
    "Outstanding interpersonal and communication skills (oral and written)",
    "Ability to abstract technical details and effectively communicate to audiences at different levels",
    "iOS and macOS familiarity",
    "Scripting knowledge (Swift, Python, Javascript, etc.) is a plus",
    "Expert level knowledge of color editing, color grading, and similar core photography skills",
    "Skills in retouching skin, removing imperfections, and enhancing textures",
    "Ability to repair old or damaged photos"
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on testing, bug reporting, and coordination with engineering and design teams. The skills emphasize technical and analytic abilities, familiarity with iOS and macOS, scripting knowledge, and expertise in photography-related tasks such as color editing and retouching. There is a mention of a passion for new technologies related to computer vision/on-device machine learning, but this does not specifically indicate working with GenAI or LLMs. Overall, the job seems to be more focused on software testing and photography-related tasks rather than working with generative AI or language models.",
  "is_genai_role": false
}