{
  "filename": "j58d7e",
  "responsibilities": [
    "Investigate algorithms utilizing physical models and machine learning methods for electrical and physical defect inspection and metrology with e-beam systems.",
    "Research, investigate and develop image quality metrics for SEM images obtained from Ebeam tools and integrate them into SEM defect inspection and metrology products.",
    "Develop accurate and robust metrology algorithms for EBeam tools as well as algorithms for the calibration of the imaging systems.",
    "Collaborate with HW, SW, and application teams."
  ],
  "skills": [
    "Rich experience in image processing and deep understanding of computer vision algorithms, deep learning tools, tracking, detection, and calibration.",
    "Solid understanding of physics (e.g., optics, electron-optics, etc.).",
    "Ability to understand customer problems, define technical directions, and conduct independent research to provide high-quality solutions within time and cost constraints.",
    "Strong communication skills.",
    "At least 5 years of C/C++, Python programming experience, familiar with software engineering practices, standard library, Python and related packages.",
    "Systematic software prototyping, analysis, design, optimization, and testing.",
    "Fast learner with strong self-motivation to grow technically.",
    "Ability to perform job at high standard with minimum supervision.",
    "Demonstrated ability to thrive in a high-pressure and fast-paced environment.",
    "Good team player to drive product development with stakeholders."
  ],
  "analysis": "The job responsibilities focus on developing algorithms for electrical and physical defect inspection and metrology using e-beam systems, as well as image quality metrics for SEM images. The skills required include experience in image processing, computer vision algorithms, deep learning tools, and a solid understanding of physics. There is no mention of working with Generative AI or language models (LLMs) in the responsibilities or skills. The focus is more on image processing, computer vision, and metrology rather than natural language processing or generation, which are typically associated with GenAI and LLMs.",
  "is_genai_role": false
}