{
  "filename": "j5c2e1",
  "responsibilities": [
    "Design and build development and production platforms that power our systems.",
    "Partner with researchers, engineers, product managers, and designers to bring new features and research capabilities to the world.",
    "Accelerate engineering productivity by empowering fellow engineers with excellent tooling and systems.",
    "Help create a diverse, equitable, and inclusive culture that makes everyone feel welcome while enabling radical candor and challenging groupthink.",
    "Build and provide operational support for globally deployed systems, including participating in an on-call rotation to respond to critical incidents as needed."
  ],
  "qualifications": [
    "Experience with full-stack development.",
    "Experience with Real-Time Communication (RTC) systems.",
    "Experience with scaled real-time communication systems in production.",
    "Experience with audio and video calling, WebRTC or competing protocols, encoding/decoding, signaling, lip sync, etc.",
    "Ability to build products that solve customer needs and enhance user experience.",
    "Ability to own problems end-to-end and willingness to acquire necessary knowledge to complete tasks."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on designing and building development and production platforms, partnering with various teams to bring new features and research capabilities, and providing operational support for globally deployed systems. The skills required include full-stack development, real-time communication systems, audio and video calling, and the ability to build products that solve customer needs. These responsibilities and skills are more aligned with general software engineering, real-time communication systems, and product development rather than specifically working with GenAI or LLMs. There is no mention of natural language processing, machine learning, or AI model development, which are typically associated with GenAI or LLMs.",
  "is_genai_role": false
}