{
  "filename": "j61676",
  "responsibilities": [
    "Architect and lead implementation of new features and identify quality improvements for RHOAI",
    "Innovate in the MLOps domain by participating in upstream communities",
    "Provide technical vision and leadership on critical and high-impact projects",
    "Ensure non-functional requirements including security, resiliency, and maintainability are met",
    "Write unit and integration tests and work with engineers to ensure product quality",
    "Use CI/CD best practices to deliver solutions as productization efforts into RHOAI",
    "Ensure that quality of Data Science Pipelines is maintained across integrations with various portions of the RHOAI stack",
    "Contribute to a culture of continuous improvement by sharing recommendations and technical knowledge with team members",
    "Collaborate with product management, other engineering, and cross-functional teams to analyze and clarify business requirements",
    "Communicate effectively to stakeholders and team members to ensure proper visibility of development efforts",
    "Give thoughtful and prompt code reviews",
    "Represent RHOAI in external engagements including industry events, customer meetings, and open-source communities",
    "Mentor, influence, and coach a distributed team of engineers"
  ],
  "skills": [
    "Development experience in Golang and/or Python",
    "Advanced experience testing applications in Golang and/or Python",
    "Advanced experience in Kubernetes, OpenShift, or other cloud-native technologies",
    "Experience with source code management tools such as Git",
    "Excellent system understanding and troubleshooting capabilities",
    "Technical leadership acumen in a global team environment",
    "Excellent written and verbal communication skills"
  ],
  "analysis": "The job responsibilities focus on leading the implementation of new features, innovating in the MLOps domain, and ensuring the quality of data science pipelines. The mention of \"MLOps\" suggests a focus on machine learning operations, which could involve various types of AI, but there is no explicit mention of Generative AI or language models. The responsibilities also include technical leadership, collaboration with cross-functional teams, and representing the organization in external engagements, which are typical for senior engineering roles.\n\nThe skills required include development experience in Golang and Python, experience with cloud-native technologies like Kubernetes and OpenShift, and excellent system understanding and troubleshooting capabilities. These skills are relevant to software development and cloud infrastructure but do not specifically indicate work with Generative AI or language models.\n\nOverall, while the job involves working with AI and data science pipelines, there is no direct indication that it specifically involves Generative AI or language models.",
  "is_genai_role": false
}