{
  "filename": "j6497f",
  "responsibilities": [
    "Contribute to EvolutionIQ's unified claims platform by working closely with data science & analytics, machine learning, and frontend data engineering teams to build robust, scalable, and high-quality data pipelines.",
    "Own the entire lifecycle of designing, building, and launching enterprise systems.",
    "Play a key role and take ownership in shaping the future of Evolution IQ’s products, including technology choices and building the roadmap.",
    "Provide crucial technical expertise, introduce new best practices to the team, drive consistency across all teams, and help prioritize features to increase client impact.",
    "Continue to grow and learn in the engineering space with a focus on business problems that use large-scale structured and unstructured datasets."
  ],
  "qualifications": [
    "Extensive experience with the full feature development life cycle, including working with product managers, deciding scope, designing data models, and pipeline architectures.",
    "Expert in Python and SQL Development.",
    "Experience designing, building, and launching backend architectures that support multi-tenant, multi-user scenarios through pipeline performance and data quality checks.",
    "Ability to remain agile and move between rapid prototyping and stable production development.",
    "Ability to write technical design documents, perform code reviews, and maintain state-of-the-art engineering practices.",
    "Ability to understand a client’s business problem and demonstrate the business impact of technical solutions through data.",
    "Team player who is solutions-oriented and embodies ambitious, collaborative, and empathetic values.",
    "Crisp written and verbal communication skills with the ability to effectively correspond between technical and non-technical audiences.",
    "Self-starter mindset with an eagerness to solve previously unsolved problems.",
    "Excellent collaboration skills and openness to giving and receiving critical feedback across teams.",
    "An eye towards analytics and helping to enable data-driven decision making."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The focus is on building data pipelines, enterprise systems, and backend architectures, as well as working with large-scale structured and unstructured datasets. The skills required include expertise in Python and SQL, designing data models, and pipeline architectures, which are common in data engineering and analytics roles. There is no mention of natural language processing, language model development, or generative AI tasks such as text generation, which would indicate working with GenAI or LLMs. The emphasis is more on data engineering, analytics, and enterprise system development rather than on AI model development or deployment.",
  "is_genai_role": false
}