{
  "filename": "j66f2c",
  "responsibilities": [
    "Work with internal teams to understand user requirements.",
    "Create data center electrical designs and collaborate with other disciplines to create a construction document set.",
    "Ensure designs meet or exceed quality requirements and fall within budgetary requirements.",
    "Specify appropriate electrical equipment with regional vendors and manufacturers.",
    "Define site utility requirements in collaboration with local utilities.",
    "Ensure compliance with federal, state, and municipal requirements and building codes by working with local agencies.",
    "Review and approve equipment submittals.",
    "Define project scope and provide technical support for information requests prior to and during construction phases.",
    "Work with commissioning teams to test and validate installation, operation, and performance of electrical systems.",
    "Manage concurrent projects in multiple geographical regions.",
    "Travel to sites for site review and work with onsite field engineers, as well as provide engineering evaluations, electrical systems audits, and startup as needed.",
    "Offer creative, out-of-the-box solutions."
  ],
  "qualifications": [
    "Hands-on electrical design experience.",
    "Understanding of critical equipment needs for a data center.",
    "Knowledge of constructability of varying designs.",
    "Ability to define critical equipment specifications and approve equipment submittals.",
    "Capability to work on concurrent projects in multiple geographical regions.",
    "Excellent communication skills.",
    "Attention to detail and ability to maintain high quality standards.",
    "Ability to think outside of the box to find creative and innovative solutions."
  ],
  "analysis": "The job described in the Responsibilities and Skills sections is focused on electrical design and engineering for data centers. The responsibilities include creating electrical designs, collaborating with other disciplines, ensuring compliance with building codes, and managing projects across multiple regions. The skills required include hands-on electrical design experience, understanding critical equipment needs for data centers, and the ability to work on concurrent projects. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The job is centered around electrical engineering and project management rather than AI or language model technologies.",
  "is_genai_role": false
}