{
  "filename": "j66f9f",
  "responsibilities": [
    "Support the Principal Investigators (PIs) in the implementation of development economics research, including randomized control trials in South Asia.",
    "Collaborate with research teams on the university campus and abroad.",
    "Handle the cleaning and management of complex data collected from various sources.",
    "Maintain a high standard of data quality through rigorous application of high-frequency checks on the incoming data.",
    "Apply advanced statistical techniques and coding skills to interpret data and analyze results.",
    "Deliver insightful and timely reports to support decision-making regarding the ongoing projects.",
    "Manage Institutional Review Board (IRB) submissions and modifications, ensuring adherence to ethical and regulatory standards.",
    "Prepare, develop, and code survey instruments, ensuring alignment with research objectives.",
    "Maintain technical and administrative support for a research project.",
    "Analyze and maintain data and/or specimens.",
    "Conduct literature reviews.",
    "Assist with preparation of reports, manuscripts, and other documents.",
    "Install, set up, and perform experiments, interacting with students and other laboratory staff under the direction of the principal investigator.",
    "Perform other related work as needed."
  ],
  "skills": [
    "Proficiency in statistical analysis packages such as Stata, R, or Python.",
    "Strong written and verbal communication skills, including the ability to produce clear and compelling written materials for both technical and non-technical audiences.",
    "Ability to work both independently and as a team member.",
    "Excellent organizational skills and high attention to detail.",
    "Ability to balance multiple tasks and prioritize effectively in a fast-paced working environment.",
    "Strong interest in development economics."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on supporting development economics research, managing and analyzing data, and collaborating with research teams. The responsibilities include tasks such as implementing research projects, handling data management, applying statistical techniques, and preparing reports. The skills required include proficiency in statistical analysis software, strong communication skills, and organizational abilities. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on traditional data analysis and research support rather than on developing or utilizing AI models or language processing technologies.",
  "is_genai_role": false
}