{
  "filename": "j67766",
  "responsibilities": [
    "Work with the Shopping Assistant team to build, optimize, and scale new & existing GenAI product features.",
    "Continuously research and implement new AI technologies and methodologies to improve system functionality and efficiency.",
    "Collaborate with cross-functional teams in product engineering to develop AI solutions that enhance user experience.",
    "Conduct regular system tests and troubleshoot issues to ensure smooth and effective prompt system operation.",
    "Work closely with Software Engineers and Test Engineers to implement and optimize AI models based on information architecture and member experience requirements.",
    "Collaborate with Member Success, Data Science, Legal, AI Safety, and GenAI platform teams on AI evaluation standards and practices.",
    "Document all processes, designs, and updates related to the prompt system for future reference and development.",
    "Provide guidance and support to team members, fostering an environment of learning and continuous improvement.",
    "Contribute to the design and evolution of prompt architectures to enhance system efficiency, responsiveness, and adaptability.",
    "Ensure all AI systems comply with data privacy regulations and company policies.",
    "Participate in regular team meetings, providing updates on progress and collaborating on future developments.",
    "Stay up-to-date with industry trends and advancements in AI technology, applying this knowledge to the ongoing development of the prompt system."
  ],
  "skills": [
    "Strong analytical and critical thinking skills for evaluating prompt strategies and making data-driven decisions.",
    "Excellent problem-solving skills for troubleshooting complex issues.",
    "Experience working in cross-functional teams and collaborating effectively with different stakeholders.",
    "Progress mindset with iterative working and optimizing for desired member experience through feedback loops.",
    "Proactive approach to work, driving innovation and improvements in processes and systems.",
    "Excellent communication skills, with the ability to synthesize and communicate ideas visually, verbally, and in writing.",
    "Ability to convey complex prompt strategies to diverse stakeholders.",
    "Adaptability and willingness to learn and grow in a rapidly evolving field.",
    "Comfort in distinguishing knowns from unknowns."
  ],
  "analysis": "The job responsibilities explicitly mention working with the \"Shopping Assistant team to build, optimize, and scale new  existing GenAI product features,\" which directly indicates involvement with Generative AI. Additionally, the responsibilities include collaborating with GenAI platform teams, which further supports the involvement with Generative AI. The mention of \"prompt system\" and \"prompt architectures\" suggests working with language models, as prompts are commonly associated with interacting with LLMs. The skills required, such as evaluating prompt strategies and conveying complex prompt strategies to stakeholders, also align with working with language models. Overall, the job clearly involves working with Generative AI and language models.",
  "is_genai_role": true
}