{
  "filename": "j6976a",
  "responsibilities": [
    "Provide production support and enhancements for existing operations research applications.",
    "Design new mathematical or machine learning models and implement them in programming languages such as C/C++, Java, and Python.",
    "Evaluate the accuracy and quality of data sources and develop appropriate remedies for data gaps.",
    "Collaborate with business partners in various departments to identify opportunities for process improvement.",
    "Work with application development teams to integrate developed models into a production environment.",
    "Perform a leadership role and supervise a group of people to achieve goals by creating an environment that promotes positive communication, encourages bonding of team members, and demonstrates flexibility.",
    "Ensure work efforts are compliant with approved corporate policies, departmental standards, and procedures.",
    "Apply understanding of industry best practices, optimization, methodologies, and emerging technologies in operations research.",
    "Provide leadership to various groups to achieve goals by creating an environment that promotes positive communication, encourages bonding of team members, and demonstrates flexibility."
  ],
  "skills": [
    "Minimum of five (5) years of experience with operations research modeling, simulation, and advanced analytics in the transportation or railroad industry.",
    "Developing decision support systems using operations research models.",
    "Managing projects and providing hands-on leadership in the design and development of operations research models and decision support systems.",
    "Utilizing operations research techniques and engineering skills in delivering decision support systems.",
    "Analyzing existing operations research applications and providing production support and enhancements.",
    "Designing new mathematical and machine learning models and implementing them in programming languages such as C/C++, Java, and/or Python.",
    "Evaluating the accuracy and quality of data sources and developing appropriate remedies for data gaps.",
    "Collaborating with business partners in various departments to identify opportunities for process improvements utilizing decision tools to develop project proposals and manage projects.",
    "Working with application development teams to integrate developed models into a production environment.",
    "Identifying complex problems and reviewing related information to develop and evaluate options and implement solutions.",
    "Railroad business knowledge for general service design principles, including railroad blocking, train scheduling, and routing algorithms.",
    "Railroad business knowledge for how to measure and analyze train performance.",
    "Demonstrated knowledge of software development methodology.",
    "Familiarity with Gurobi, CPLEX, or other optimization solvers.",
    "Experience with LINUX or UNIX platforms.",
    "Proficiency in programming languages for software development such as C/C++, Java, or Python.",
    "Knowledge of database programming languages such as SQL."
  ],
  "analysis": "The job responsibilities and skills focus primarily on operations research, mathematical modeling, machine learning, and optimization techniques. The responsibilities include designing new mathematical or machine learning models, providing production support for operations research applications, and collaborating with business partners for process improvement. The skills required include experience with operations research modeling, decision support systems, and programming languages such as C/C++, Java, and Python. There is no mention of Generative AI (GenAI) or language models (LLMs) specifically. The focus is more on traditional operations research and optimization techniques rather than on generative or language models.",
  "is_genai_role": false
}