{
  "filename": "j6c74b",
  "responsibilities": [
    "Initiate, lead, and perform independent and impactful analyses on the local and regional economic and employment impacts of future policies and market actions in scenarios achieving carbon neutrality nationally and globally.",
    "Deliver innovative solutions to sponsors.",
    "Craft successful proposals and scientific presentations and publications.",
    "Engage regularly with the academic and practitioner communities.",
    "Develop and implement a cohesive research strategy to ensure the success of new and ongoing research projects.",
    "Deliver ORNL’s mission by aligning behaviors, priorities, and interactions with core values of Impact, Integrity, Teamwork, Safety, and Service.",
    "Promote diversity, equity, inclusion, and accessibility by fostering a respectful workplace."
  ],
  "skills": [
    "Strong written and oral communication skills.",
    "Excellent interpersonal skills with a demonstrated leadership ability.",
    "Strong computer programming skills (e.g., R, Python, GAMS, MATLAB, etc.).",
    "Familiarity with leading economic and employment models and datasets (e.g., IMPLAN, WiNDC, WIRED/JEDI, EMPLOY, SLiDE, JOBS).",
    "Ability to function well in a fast-paced research environment.",
    "Ability to set priorities to accomplish multiple tasks within deadlines.",
    "Ability to adapt to ever-changing needs."
  ],
  "analysis": "The job responsibilities focus on economic and employment impact analyses, delivering innovative solutions, crafting proposals and presentations, engaging with academic and practitioner communities, and developing research strategies. The skills required include strong communication, leadership, programming skills, familiarity with economic models and datasets, and the ability to work in a fast-paced environment. There is no explicit mention of working with Generative AI or language models. The focus is more on economic modeling and analysis rather than AI or LLMs.",
  "is_genai_role": false
}