{
  "filename": "j762a3",
  "responsibilities": [
    "Serve as Technical Lead / Staff Engineer on one of our Product Engineering teams",
    "Contribute to the unified claims platform, working closely with data science and data engineering teams",
    "Build and maintain the backend REST server for machine learning and BI data",
    "Own the entire lifecycle of designing, building, and launching enterprise applications",
    "Work on greenfield projects with high levels of ownership",
    "Collaborate with the head of product, data science team, UX designers, and end users",
    "Shape the future of EvolutionIQ’s products, including technology choices and roadmap building",
    "Provide technical expertise, introduce best practices, drive consistency, and prioritize features",
    "Continue to grow and learn in the engineering space, focusing on business problems with large-scale datasets"
  ],
  "qualifications": [
    "Expert in Python Development",
    "Strong experience with NodeJS and Typescript",
    "Strong Relational Database design skills",
    "Experience with Dagster and/or Airflow",
    "Ability to remain agile and move between rapid prototyping and stable production development",
    "Ability to write technical design documents and perform code reviews",
    "Ability to maintain state-of-the-art engineering practices",
    "Ability to understand a client’s business problem and show the business impact of technical solutions",
    "Solutions-oriented team player with collaborative and empathetic values",
    "Crisp written and verbal communication skills",
    "Ability to correspond effectively between technical and non-technical audiences",
    "Self-starter mindset with eagerness to solve unsolved problems",
    "Excellent collaboration skills and openness to giving and receiving critical feedback"
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on technical leadership, backend development, collaboration with data science teams, and working on enterprise applications. While there is mention of working closely with data science and data engineering teams, and building a backend REST server for machine learning and BI data, there is no direct reference to GenAI or LLMs.\n\nThe skills required include expertise in Python, NodeJS, Typescript, relational database design, and experience with tools like Dagster and Airflow. These skills are relevant to software engineering and data engineering but do not specifically indicate work with GenAI or LLMs.\n\nOverall, while the job involves working with data science and machine learning, there is no clear indication that it specifically involves Generative AI or language models.",
  "is_genai_role": false
}