{
  "filename": "j76c8c",
  "responsibilities": [
    "Design and build the platform that enables teams at Discord to send delightful notifications while delivering maximum value to users.",
    "Partner with Product, Marketing, Machine Learning, and Infrastructure teams to ship impactful capabilities for the notifications platform.",
    "Build delightful products with a high bar for quality, performance, and focus on impact.",
    "Collaborate with staff engineers and partners across the organization to ensure technical agreement with other systems, products, and vision.",
    "Use technical expertise to constantly improve and ensure the team achieves extraordinary results at a high technical level.",
    "Advise the leadership team on essential technical considerations related to ensuring engineering excellence and successful high-impact key initiatives."
  ],
  "skills": [
    "Strong product sense and understanding of metrics and scale.",
    "Fearlessness in tackling large problems.",
    "Ability to work with highly experienced engineering peers and cross-functional partners.",
    "Technical expertise in development frameworks and fundamentals of one or more platforms: web (React, TypeScript), Android (React Native, Kotlin), iOS (React Native, Objective-C, Swift), and backend (Python and some Elixir).",
    "Holistic approach to problem-solving and learning from mistakes.",
    "Empathetic feedback to help team members succeed and grow."
  ],
  "analysis": "The job responsibilities focus on designing and building a platform for sending notifications, partnering with various teams including Machine Learning, and ensuring high-quality product delivery. The skills required include technical expertise in development frameworks, problem-solving, and collaboration with engineering peers. There is no explicit mention of working with Generative AI or language models in the responsibilities or skills. The mention of partnering with the Machine Learning team could imply some involvement with AI technologies, but it is not specific enough to conclude that the job involves working with GenAI or LLMs.",
  "is_genai_role": false
}