{
  "filename": "j79924",
  "responsibilities": [
    "Application of object-oriented patterns for the design of concurrent and networked software components",
    "Use of C and C++ and associated compilers, linkers, debuggers, and visual design environments to produce robust, high-performance applications and libraries across multiple platforms",
    "Creation and maintenance of succinct design documentation",
    "Debug and maintenance of existing software products",
    "Estimation and tracking of time required to complete assigned tasks",
    "Participate in the integration of new computer vision and video analytics algorithms and features on camera and appliance platforms"
  ],
  "skills": [
    "Strong Object Oriented design and programming and debugging ability (C++, Python)",
    "Exposure and interest in developing embedded Linux software for camera and appliance platforms",
    "Experience with image processing and open source video packages including OpenCV",
    "Experience with scripting languages, build systems, and version control systems",
    "Understanding of modern memory, storage, I/O bus, processor, operating system, networking, and database architectures"
  ],
  "analysis": "The job responsibilities and skills focus on software development, particularly in the areas of object-oriented programming, concurrent and networked software components, and embedded Linux software for camera and appliance platforms. The responsibilities include using C and C++ for developing high-performance applications, debugging existing software, and integrating computer vision and video analytics algorithms. The skills required include strong object-oriented design and programming abilities, experience with image processing and video packages like OpenCV, and understanding of modern computing architectures.\n\nThere is no mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is more on traditional software development, embedded systems, and computer vision, rather than on AI or language model technologies.",
  "is_genai_role": false
}