{
  "filename": "j7dc0b",
  "responsibilities": [
    "Write code that is clear, well tested, optimized, and thoroughly documented",
    "Collaborate with geographically dispersed team on feature implementation, code reviews, and testing",
    "Learn and be a champion for industry standard best practices",
    "Be proactive in understanding and meeting product and engineering requirements",
    "Strive to fully understand the team’s domain-specific services and data pipeline beyond the feature work being implemented",
    "Complete onboarding with HR and get environment set up",
    "Take on tickets, bugs, and resolve tech debt or bugs from backlog",
    "Perform code reviews and provide feedback",
    "Participate in technical design and grooming sessions with the team",
    "Shadow and participate in the on-call rotation",
    "Present work at feature demos and contribute to team documentation",
    "Contribute significantly to sprint goals and uphold PR code review quality",
    "Participate in owning tech design documents and leading cross-team involvement",
    "Participate in customer and professional services calls"
  ],
  "qualifications": [
    "Ability to write or refactor code to be scalable and performant",
    "Ability to work independently on well-defined tasks",
    "Familiarity with containerization (Docker) and orchestration (Kubernetes)",
    "Passion for writing simple, clean, and efficient code",
    "Commitment to unit/functional/integration testing to ensure maintainable, high-quality software",
    "Ability to document and demonstrate solutions using flowcharts, diagrams, and white-boarding",
    "Experience with AWS, Snowflake, Python/PySpark, and GoLang"
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on general software development tasks such as writing code, collaborating with teams, understanding product requirements, and participating in technical design and code reviews. The skills required include writing scalable and performant code, familiarity with containerization and orchestration tools, and experience with specific technologies like AWS, Snowflake, Python/PySpark, and GoLang. There is no mention of working with AI models, natural language processing, or any specific tasks related to GenAI or LLMs. The focus is more on software engineering and development practices rather than AI or machine learning.",
  "is_genai_role": false
}