{
  "filename": "j801aa",
  "responsibilities": [
    "Design and conduct research within a specified field.",
    "Receive advanced training from a designated Principal Investigator.",
    "Design and evaluate experiments.",
    "Develop new ideas that promote current research.",
    "Prepare and publish scientific manuscripts under the direction of the Principal Investigator.",
    "Operate specific equipment as needed.",
    "Teach techniques to others, train, and supervise research staff.",
    "Engage in analysis of high-dimensional temporal data.",
    "Participate in major research projects related to brain monitoring, data integration, and modeling/analysis of neurophysiological signals.",
    "Collaborate with domain experts across multiple institutions and disciplines.",
    "Develop and validate foundation models for physiological signals."
  ],
  "qualifications": [
    "Signal processing/time series analysis.",
    "Machine learning and deep learning.",
    "Mathematical modeling and system identification.",
    "Optimization techniques.",
    "Digital/mobile health applications.",
    "Natural language processing.",
    "Data visualization.",
    "Excellent scientific writing ability.",
    "Strong oral communication skills.",
    "Ability to work effectively and collegially with colleagues."
  ],
  "analysis": "The job involves research and development in the field of physiological signals, with a focus on brain monitoring and neurophysiological signals. The responsibilities include designing experiments, developing new ideas, and collaborating with domain experts. One of the key responsibilities is to \"develop and validate foundation models for physiological signals,\" which suggests the use of advanced modeling techniques. The skills required include machine learning, deep learning, and natural language processing (NLP). While NLP is a component of language models, the job does not explicitly mention working with Generative AI or Large Language Models. The focus seems to be more on signal processing, data analysis, and modeling physiological signals rather than on language generation or understanding tasks typically associated with GenAI or LLMs.",
  "is_genai_role": false
}