{
  "filename": "j80c0b",
  "responsibilities": [
    "Design and develop creative, learner-centered training content for on-demand, instructor-led, and blended training.",
    "Build associated assets including labs, videos, facilitator guides, and other resources.",
    "Collaborate effectively with Engineers, Portfolio Managers, and other partners to support initiatives.",
    "Ensure and drive best practices standardization across all projects, content, and curricula.",
    "Perform needs and task analysis, scope projects, and evaluate existing documentation to identify the most appropriate training approach and content to meet the learning needs of each audience across global audiences."
  ],
  "qualifications": [
    "Deep knowledge in Cloud computing technologies.",
    "Proficiency with Learning and development tools and technologies (i.e., authoring tools, learning platforms, and other relevant technologies).",
    "Ability to translate technical content into effective learning solutions.",
    "Experience coding in Python, SQL, and TensorFlow.",
    "Experience building and managing data pipelines.",
    "Familiarity with R and data visualization tools.",
    "Ability to collaborate with highly technical subject matter experts and stakeholders."
  ],
  "analysis": "The job responsibilities focus on designing and developing training content, collaborating with various partners, and ensuring best practices in training projects. The skills required include deep knowledge in cloud computing, proficiency with learning and development tools, coding experience in Python, SQL, and TensorFlow, and familiarity with data visualization tools. While these skills and responsibilities suggest a technical and educational role, there is no explicit mention of working with Generative AI or language models. The skills related to coding and data pipelines could be relevant to AI, but without specific mention of GenAI or LLMs, it is not clear that this job involves working with them.",
  "is_genai_role": false
}