{
  "filename": "j80edf",
  "responsibilities": [
    "Embed with the GTM team as a trusted partner, identifying high-impact analytics problems and pioneering data-driven solutions.",
    "Establish a data-driven culture by driving the definition, tracking, and operationalizing of metrics.",
    "Manage cross-functional data projects about revenue, pricing, usage, and other topics core to the business.",
    "Create scalable pipelines for data collection, cleaning, and analysis from multiple sources, and manage the lifecycle of metrics and models from prototyping to production.",
    "Develop and refine tools such as dashboards and reports that empower the team to extract and analyze data independently.",
    "Conduct analyses to uncover insights and inform key decisions.",
    "Use presentations, memos, and tools to communicate complex data insights clearly and persuasively across the organization."
  ],
  "qualifications": [
    "Highly skilled in SQL, with extensive experience extracting large datasets and designing ETL workflows.",
    "Proficient in quantitative programming languages, Python preferred.",
    "Experienced in using business intelligence tools, such as Tableau and Looker, to communicate insights and enable self-serve.",
    "Familiar with advanced custom visualizations, such as streamlit and plotly dash.",
    "Adept at crafting clear data stories using decks, memos, and dashboards to drive decision-making at every level.",
    "Best-in-class attention to detail and unwavering commitment to accuracy.",
    "Demonstrated ability to build effective partnerships across diverse teams and influence decision making with data."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on data analytics, data-driven decision-making, and managing data projects related to revenue, pricing, and usage. The skills required include proficiency in SQL, Python, and business intelligence tools like Tableau and Looker, which are commonly used in data analytics and business intelligence roles. There is no mention of working with AI models, natural language processing, or any specific tasks related to GenAI or LLMs. The focus is on data collection, analysis, and visualization rather than developing or working with AI models.",
  "is_genai_role": false
}