{
  "filename": "j84b2a",
  "responsibilities": [
    "Conduct research on GenAI and Foundation models (FM) to address academic and industrial challenges.",
    "Work with an international team of experts to transfer and apply Bosch in-house GenAI / FM innovations and 3rd-party solutions to Bosch AI products and services, such as ADAS, AI agents, etc.",
    "Stay abreast of the latest technological advancements and market trends by attending academic conferences, technical events, and seminars.",
    "Offer expert insights to the management team in relevant technology sectors, aiding in strategic planning, R&D trajectory, and investment decisions.",
    "Document and disseminate research findings through high-caliber publications and/or patent submissions."
  ],
  "qualifications": [
    "In-depth experiences in deep learning, with work in at least two of the following areas: AI agent, RAG, multimodal transformers, multimodal language models, diffusion models, autonomous driving, time-series data analysis.",
    "Proficiency in one or more programming languages commonly used in systems research (e.g., Python, C++).",
    "Hands-on experience with AI / NLP / CV libraries.",
    "Strong interpersonal, communication, and teamwork capabilities.",
    "Strong background in math and statistics.",
    "Leadership skills with excellent English communication & teamwork skills."
  ],
  "analysis": "The job responsibilities explicitly mention conducting research on Generative AI (GenAI) and Foundation models (FM), which are closely related to language models and large language models (LLMs). The responsibilities also include transferring and applying GenAI/FM innovations to Bosch AI products and services, indicating a direct involvement with these technologies.\n\nThe skills required for the job further support this involvement. The mention of \"multimodal transformers\" and \"multimodal language models\" directly relates to language models and LLMs. Additionally, the requirement for experience in AI/NLP/CV libraries suggests a focus on natural language processing, which is a key component of working with language models.\n\nOverall, both the responsibilities and skills indicate that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}