{
  "filename": "j8505b",
  "responsibilities": [
    "Work with architects and product management to define requirements for various OCI storage products and infrastructure services.",
    "Make substantial contributions towards design and architecture.",
    "Implement proof of concepts.",
    "Mentor and demonstrate core values for junior engineers.",
    "Write code and review code written by peers.",
    "Write test automations.",
    "Operate services at scale."
  ],
  "qualifications": [
    "Strong proficiency with C/C++ or Java and Python.",
    "Expertise in one or more Public Cloud offerings (OCI, AWS, GCP, Azure) is a plus.",
    "Strong knowledge of data structures, algorithms, operating systems, and distributed systems fundamentals.",
    "Strong troubleshooting and performance tuning skills.",
    "Self-motivation to thrive in a fast-paced environment.",
    "Familiarity with AI/ML frameworks (Tensorflow/Keras, PyTorch, Scikit-Learn, XGBoost, Caffe) as well as MLOps and Kubernetes is a plus.",
    "Background in RMDA and high-performance networking (SmartNICs, NVMe/TCP, RoCEv2) is a plus."
  ],
  "analysis": "The job responsibilities focus on working with architects and product management to define requirements for storage products and infrastructure services, contributing to design and architecture, implementing proof of concepts, mentoring junior engineers, writing and reviewing code, writing test automations, and operating services at scale. These responsibilities do not explicitly mention working with Generative AI or language models.\n\nThe skills required include proficiency in programming languages like C/C++ or Java and Python, expertise in public cloud offerings, knowledge of data structures, algorithms, operating systems, and distributed systems, troubleshooting and performance tuning skills, and familiarity with AI/ML frameworks and MLOps. While there is a mention of AI/ML frameworks, it is in the context of general machine learning and not specifically related to Generative AI or language models. The job does not explicitly require skills in working with Generative AI or language models.\n\nOverall, the job seems to be more focused on infrastructure, storage products, and general AI/ML frameworks rather than specifically on Generative AI or language models.",
  "is_genai_role": false
}