{
  "filename": "j8e3a3",
  "responsibilities": [
    "Drive the architecture, design, and implementation of foundational platforms and systems.",
    "Work closely with stakeholders and internal customers to understand and refine requirements.",
    "Collaborate with cross-functional teams to define, design, and deliver new features.",
    "Proactively identify opportunities for improvements to current programming practices, including process enhancements and tool upgrades.",
    "Present technical information to teams and stakeholders, providing guidance and insight on development processes and technologies."
  ],
  "qualifications": [
    "Extensive experience in software development.",
    "Deep understanding of Distributed Systems, Cloud Platforms, and Data Science.",
    "Excellent communication and collaboration skills.",
    "Ability to translate complex technical concepts to non-technical stakeholders.",
    "Experience with standard containerization & deployment technologies like Kubernetes, Terraform, Docker, etc.",
    "Strong experience with orchestration platforms, such as Temporal and AWS Step Functions.",
    "Experience with document (MongoDB), relational (Postgres), and highly distributed databases (TiDB, ScyllaDB).",
    "Strong knowledge of software engineering best practices and CI/CD tooling (CircleCI).",
    "Experience with data warehouses (Snowflake, Firebolt) and data pipeline/ETL tools (Dagster, dbt).",
    "Experience with authentication/authorization systems (Zanzibar, Authz, etc.)",
    "Excitement to work with AI technologies."
  ],
  "analysis": "The job responsibilities focus on driving architecture, design, and implementation of foundational platforms and systems, collaborating with stakeholders, and improving programming practices. These responsibilities do not explicitly mention working with Generative AI or language models.\n\nThe skills required include extensive experience in software development, distributed systems, cloud platforms, data science, and various technologies like Kubernetes, Docker, and databases. There is a mention of excitement to work with AI technologies, but it does not specify Generative AI or language models. The skills focus more on software engineering, orchestration platforms, and data management rather than specific AI or language model expertise.\n\nOverall, while there is a general interest in AI technologies, there is no direct indication that the job involves working specifically with Generative AI or language models.",
  "is_genai_role": false
}