{
  "filename": "j90d44",
  "responsibilities": [
    "Use deep understanding of CV, ML, NLP, and AI to tackle meaningful technical problems.",
    "Collaborate with the product development team to transfer ideas into solutions for Huawei products.",
    "Conceive, plan, develop, and implement scientific research projects in business-relevant areas.",
    "Conduct academic and applied research by developing core algorithms and platforms of computer vision.",
    "Generate high-quality patents and/or academic publications in applied ML, computer vision, and graphics.",
    "Guide and manage processes including data collection, processing, model training, and testing.",
    "Develop highly-optimized, compact models for real-time processing."
  ],
  "skills": [
    "Deep understanding of computer vision, machine learning, natural language processing, and artificial intelligence.",
    "Solid programming skills with C++, Java, and/or Python.",
    "Familiarity with Pytorch.",
    "Ability to create innovative techniques and make them robust and scalable for real-world scenarios.",
    "Self-motivated and able to adapt to new problem domains quickly."
  ],
  "analysis": "The job responsibilities and skills focus heavily on computer vision (CV), machine learning (ML), natural language processing (NLP), and artificial intelligence (AI). While NLP is a field that can involve language models, the job description does not explicitly mention working with Generative AI or Large Language Models (LLMs). The responsibilities include developing core algorithms and platforms for computer vision, generating patents and publications in applied ML, and creating optimized models for real-time processing. The skills required include a deep understanding of CV, ML, NLP, and AI, along with programming skills and familiarity with Pytorch. Although NLP is mentioned, there is no specific mention of tasks or skills directly related to GenAI or LLMs, such as text generation, language model fine-tuning, or working with specific LLM frameworks. The focus seems to be more on computer vision and applied machine learning rather than generative language models.",
  "is_genai_role": false
}