{
  "filename": "j94b38",
  "responsibilities": [
    "Design and implement technical computing strategies including hardware installation, operating system, and software application deployments.",
    "Implement and deploy automation (CI/CD) and orchestration solutions.",
    "Write scripts and containerize on-premises and cloud systems.",
    "Assist users to install, configure, and/or script informatics tools and applications.",
    "Read and adapt literature and publicly available information to accomplish assignments.",
    "Design and develop data, software, and technology solutions as assigned.",
    "Work with developers and data scientists to train and/or implement DevOps tools and strategies in new and/or legacy projects.",
    "Work with scientists to analyze issues and to prototype, test, tune, document, and deploy processing and data acquisition pipelines.",
    "Troubleshoot and/or perform Linux/UNIX Systems Administration tasks as needed.",
    "Implement and manage orchestration and automation tools or platforms such as Jenkins and/or Git Flow.",
    "Utilize tools, technologies, and methodologies such as Docker, Kubernetes, Bash, Python, Linux, RHEL, Ubuntu, Amazon Web Services (AWS).",
    "Implement and deploy Infrastructure as Code including Ansible, JIRA, CloudFormation, and/or Terraform.",
    "Implement multiple storage platforms and diverse fit-to-purpose storage strategies.",
    "Support and develop informatics systems and pipelines.",
    "Utilize C#, .Net Framework, and/or Angular development.",
    "Use statistics and/or machine learning approaches such as Regression, Clustering, Neural Networks, and/or SVM.",
    "Conduct database management using Oracle, MS SQL Server, and/or PostgreSQL."
  ],
  "skills": [
    "Technical computing strategy design and implementation",
    "Automation (CI/CD) and orchestration solutions deployment",
    "Scripting and containerization of systems",
    "Informatics tools and applications configuration",
    "Data, software, and technology solutions development",
    "DevOps tools and strategies implementation",
    "Linux/UNIX Systems Administration",
    "Orchestration and automation tools management (e.g., Jenkins, Git Flow)",
    "Use of Docker, Kubernetes, Bash, Python, Linux, RHEL, Ubuntu, AWS",
    "Infrastructure as Code implementation (e.g., Ansible, JIRA, CloudFormation, Terraform)",
    "Storage platform implementation and strategy development",
    "Informatics systems and pipelines support",
    "C#, .Net Framework, and Angular development",
    "Statistics and machine learning approaches (e.g., Regression, Clustering, Neural Networks, SVM)",
    "Database management (e.g., Oracle, MS SQL Server, PostgreSQL)"
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on technical computing strategies, automation, orchestration, scripting, containerization, and systems administration. The responsibilities include tasks such as designing and implementing technical computing strategies, deploying automation and orchestration solutions, and working with various tools and technologies like Docker, Kubernetes, and AWS. The skills required include technical computing strategy design, automation deployment, scripting, and machine learning approaches like regression and neural networks.\n\nWhile machine learning is mentioned, there is no specific mention of Generative AI or language models (LLMs) such as GPT, BERT, or similar technologies. The focus is more on infrastructure, DevOps, and general machine learning techniques rather than on developing or working with GenAI or LLMs.\n\nTherefore, based on the provided responsibilities and skills, the job does not explicitly involve working with Generative AI or language models.",
  "is_genai_role": false
}