{
  "filename": "j9543a",
  "responsibilities": [
    "Work on the diffusion simulation engine, MRI protocols, and ground truth pipeline.",
    "Contribute to the development of imaging-based alternatives for virtual biopsy procedures.",
    "Optimize MRI protocols with a focus on diffusion imaging to support algorithm development.",
    "Collaborate with an interdisciplinary team to bring meaningful change to cancer assessment."
  ],
  "qualifications": [
    "Deep theoretical understanding of and practical experience with statistical inference in complex, high-dimensional systems.",
    "Experience in Bayesian inference.",
    "Practical experience with machine learning for probabilistic modeling (e.g., density estimation, generative modeling).",
    "Strong coding skills in Python.",
    "Familiarity with a modern software development stack (e.g., git, containerization).",
    "Experience with Monte-Carlo methods or other sampling methods.",
    "Experience with large, real-world data sets.",
    "Complete proficiency in English."
  ],
  "analysis": "The job responsibilities focus on working with MRI protocols, diffusion simulation engines, and imaging-based alternatives for virtual biopsy procedures. These tasks are related to medical imaging and cancer assessment, which do not directly indicate the use of Generative AI or language models.\n\nThe skills required include a deep understanding of statistical inference, Bayesian inference, and machine learning for probabilistic modeling, such as density estimation and generative modeling. While \"generative modeling\" is mentioned, it is a broad term that can apply to various types of generative models, not specifically Generative AI or language models. The skills also include experience with Monte-Carlo methods, large data sets, and proficiency in Python, which are common in data science and machine learning roles but do not specifically point to working with Generative AI or LLMs.\n\nOverall, while the job involves advanced statistical and machine learning techniques, there is no explicit mention or indication of working with Generative AI or language models.",
  "is_genai_role": false
}