{
  "filename": "j96cd1",
  "responsibilities": [
    "Architect and develop simulation tools to understand subsea product performance in various scenarios",
    "Develop and implement hydrodynamic modeling and simulation capabilities for data capture during testing",
    "Rapidly iterate on modeling and simulation capabilities during test periods",
    "Collaborate with the GNC team to maximize field test outcomes",
    "Simulate and analyze test data using appropriate tools and processes",
    "Create test and simulation fixtures for software- and hardware-in-the-loop operations",
    "Work with multi-disciplinary experts to model sub-system, system, and system of system dynamics",
    "Collaborate with internal and external customers to understand simulation requirements and develop solutions"
  ],
  "qualifications": [
    "Proficiency with scientific computing systems (e.g., MATLAB, Simulink) and scientific Python (e.g., NumPy, SciPy)",
    "Familiarity with C++ and/or Python",
    "Experience with subsea vehicles and/or aerospace/aeronautical systems",
    "Experience with developing sub-system and system level models",
    "Experience with model development for Guidance, Navigation, and Control algorithm development",
    "Ability to liaise with other engineering functions to diagnose and remediate design issues",
    "Experience building computational meshes for CFD analysis"
  ],
  "analysis": "The job responsibilities and skills listed are focused on developing simulation tools, hydrodynamic modeling, and working with subsea and aerospace systems. The responsibilities include tasks such as developing simulation capabilities, analyzing test data, and collaborating with teams to model system dynamics. The skills required include proficiency with scientific computing systems like MATLAB and Simulink, familiarity with programming languages like C++ and Python, and experience with subsea vehicles and aerospace systems.\n\nThere is no mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on scientific computing, simulation, and modeling in the context of engineering and physical systems, rather than on natural language processing or AI model development.\n\nTherefore, this job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}