{
  "filename": "j98af4",
  "responsibilities": [
    "Conduct applied research and development of deep neural networks for end-to-end solutions.",
    "Own and deliver state-of-the-art Imaging Radar hardware and machine learning to push performance boundaries for next-generation Autonomous Vehicles.",
    "Develop core deep learning codebase for efficient training and testing pipelines.",
    "Conduct deep learning experiments, write reports/publications, and file patents.",
    "Work cross-functionally with high-performance compute, systems, vehicle engineering, autonomy, and suppliers as the end-to-end Radar owner and domain expert to architect and define an optimal sub-system.",
    "Inspire others to develop better practices and principles using top-notch development expertise.",
    "Mentor junior researchers by providing guidance on research projects and design document reviews."
  ],
  "skills": [
    "Deep understanding of Radar hardware, Radar DSP, Radar machine learning, and Radar testing/performance.",
    "Experience developing low-level data pipelines to enable industry-leading machine learning performance.",
    "Understanding of computer architecture principles and how data pipelines and machine learning algorithms map onto hardware.",
    "In-depth understanding of common machine learning and deep learning algorithms (e.g., classification, regression, clustering).",
    "Experience designing, training, and analyzing neural networks for applications such as object detection, image segmentation, sensor fusion, multitask learning, motion prediction, and/or tracking.",
    "Significant experience with software engineering principles including software design, source control management, build processes, code reviews, testing methods.",
    "Fluency in Python, including standard scientific computing libraries and Python bindings development experience.",
    "Experience with PyTorch or other deep learning frameworks.",
    "Experience defining data collection, data curation, and working with large data sets.",
    "Leadership and mentoring experience."
  ],
  "analysis": "The job responsibilities and skills focus primarily on the development and application of deep neural networks for imaging radar and machine learning in the context of autonomous vehicles. The responsibilities include conducting applied research, developing deep learning codebases, and working with radar hardware and machine learning to enhance performance. The skills required include a deep understanding of radar hardware, machine learning algorithms, neural networks, and experience with deep learning frameworks like PyTorch. There is no mention of Generative AI or language models (LLMs) such as those used for natural language processing or text generation. The focus is on radar systems, sensor fusion, and machine learning for object detection and tracking, which are not directly related to GenAI or LLMs.",
  "is_genai_role": false
}