{
  "filename": "j9d50d",
  "responsibilities": [
    "Own reporting tools, pipelines, and dashboards to ensure consistent availability and accuracy of mission-critical data",
    "Partner with key stakeholders on KPI development and tracking across the revenue organization",
    "Build datasets and reports that represent the source of truth for our key metrics",
    "Keep data sources fresh even while requirements and definitions change; address data quality issues and build in alerting",
    "Partner with data science, finance & strategy, marketing, sales, product, and engineering on analytics engineering strategy to enable data-driven decision making across the company",
    "Set expectations and SLAs on data availability, and own communications around SLA performance to the business",
    "Drive self-service and data literacy for business users on our data platform by creating and documenting data structures and sets, SQL and data tools training, and dashboard development",
    "Care deeply about data quality and empowering employees to leverage data to help them succeed in their careers and help Nextdoor grow and succeed",
    "Participate in in-person Nextdoor events, trainings, off-sites, volunteer days, and other team building exercises",
    "Build in-person relationships with team members and contribute to the KIND culture that Nextdoor values"
  ],
  "qualifications": [
    "Advanced knowledge of SQL, including writing and optimizing queries in multiple dialects",
    "Experience with Looker (preferred) or another BI/visualization tool",
    "Experience working with or strong familiarity with ETL/ELT pipelines",
    "Strong communication skills both written and verbal",
    "Ability to understand, tackle, and solve problems from both technical and business perspectives",
    "Experience effectively presenting insights and summarizing complex data to diverse audiences through visualizations and other means",
    "Demonstrated experience working with and delivering to cross-functional stakeholders from multiple parts of the company (Finance, Engineering, etc.)",
    "Ability to work independently with minimal supervision and have a strong sense of ownership"
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on data management, analytics, and business intelligence. The responsibilities include owning reporting tools, building datasets, ensuring data quality, and driving data literacy. The skills required include advanced SQL knowledge, experience with BI tools like Looker, and familiarity with ETL/ELT pipelines. There is a strong emphasis on data-driven decision-making, communication, and collaboration with cross-functional teams.\n\nThere is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on data analytics, reporting, and business intelligence rather than on developing or utilizing AI models or language models.\n\nTherefore, based on the provided information, the job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}