{
  "filename": "j9fef4",
  "responsibilities": [
    "Develop end-to-end Machine Learning and Deep Learning solutions for enterprise use cases.",
    "Help customers adopt NVIDIA AI SDKs and APIs by offering deep technical expertise.",
    "Design GPU-accelerated data processing pipelines to optimize compute resource utilization and improve workload performance.",
    "Provide feedback from first-time implementations to improve software products.",
    "Educate vertical teams and build communities on NVIDIA AI software products."
  ],
  "qualifications": [
    "Strong software engineering and debugging skills.",
    "Experience with Python, C/C++, and Linux.",
    "Expertise in using deep learning frameworks such as TensorFlow or PyTorch.",
    "Real-world development of agentic RAG systems with frameworks like LangGraph, LlamaIndex, CrewAI.",
    "Strong background with vector databases and advanced indexing techniques.",
    "Ability to multitask effectively in a dynamic environment.",
    "Clear written and oral communication skills.",
    "Ability to collaborate effectively with executives and engineering teams."
  ],
  "analysis": "The job involves developing end-to-end Machine Learning and Deep Learning solutions, which are broad fields that can include Generative AI and language models. The mention of \"agentic RAG systems\" and frameworks like \"LangGraph, LlamaIndex, CrewAI\" in the skills section suggests a focus on retrieval-augmented generation (RAG) systems, which are often used in conjunction with language models to enhance their capabilities. This indicates a direct involvement with language models. Additionally, the expertise in deep learning frameworks such as TensorFlow or PyTorch is relevant, as these frameworks are commonly used to develop and train language models and other AI systems. The job also involves educating teams on NVIDIA AI software products, which could include tools and libraries for working with Generative AI and language models. Overall, the combination of responsibilities and skills strongly suggests that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}