{
  "filename": "ja26af",
  "responsibilities": [
    "Design, develop and maintain scaled, automated, user-friendly systems, reports, APIs, dashboards, etc. to support business needs.",
    "Partner with operations/business/science/tech teams to develop and implement KPIs, automated reporting/process solutions, and data infrastructure improvements.",
    "Drive new initiatives and data integration projects, extracting meaningful insights from large and complicated data sets.",
    "Serve as liaison between business and product/science teams to prototype new marketing solutions and perform ad hoc investigations.",
    "Own development and maintenance of datasets, ongoing metrics, analyses, and dashboards to drive key business decisions.",
    "Develop queries and visualizations for ad-hoc requests and projects, as well as ongoing reporting.",
    "Continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for customers.",
    "Use analytical and statistical rigor to identify performance gaps and opportunities for optimization.",
    "Build data infrastructure in collaboration with partner tech-teams to facilitate scaling-up various marketing initiatives.",
    "Support central BI team in reporting on global marketing efforts."
  ],
  "qualifications": [
    "Technical expertise in data infrastructure and analytics.",
    "Ability to design, develop, and maintain automated systems and reports.",
    "Strong partnership and collaboration skills with various teams.",
    "Analytical and statistical skills to extract insights and drive decisions.",
    "Proficiency in data visualization tools like Tableau, Quicksight, or similar.",
    "Experience in data modeling, warehousing, and building ETL pipelines.",
    "Proficiency in SQL and scripting languages like Python.",
    "Ability to recognize and adopt best practices in reporting and analysis."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on data infrastructure, analytics, and reporting. The responsibilities include designing and maintaining automated systems, developing KPIs, data integration, and building data infrastructure. The skills required include technical expertise in data infrastructure, analytics, data visualization, data modeling, and proficiency in SQL and scripting languages like Python. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on data analysis, reporting, and infrastructure rather than on developing or working with AI models or language models.",
  "is_genai_role": false
}