{
  "filename": "jb2eb9",
  "responsibilities": [
    "Own the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key decisions and process improvements.",
    "Work closely with the Marketing teams in areas including Performance Marketing, Brand Marketing, Healthcare, and CRM to provide online reporting and analysis using business intelligence tools.",
    "Gather business and functional requirements and translate these requirements into robust, scalable, operable solutions.",
    "Produce comprehensive, usable data set documentation, metadata, BI reports, Dashboards, and insights.",
    "Collaborate with other technology teams to extract, transform, and load data from a wide variety of data sources using SQL and various technological platforms.",
    "Recognize and embrace best practices in reporting and analysis: data integrity, test design, analysis, validation, and documentation.",
    "Respond to high-priority requests from senior business leaders.",
    "Continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for secondary data sets."
  ],
  "skills": [
    "Advanced knowledge of SQL and data modeling.",
    "Intermediate knowledge in Python and advanced data visualization tools such as Plotly/Dash/React/D3Js.",
    "Advanced ability to draw insights from data and communicate them to collaborators and senior management.",
    "Knowledge of data management fundamentals and data storage principles.",
    "Ability and interest in working in a fast-paced and rapidly changing environment.",
    "Excellent communication skills, both written and verbal."
  ],
  "analysis": "The job responsibilities focus on data analysis, reporting, and collaboration with various teams to provide insights and improve processes. The tasks involve designing and maintaining metrics, reports, and dashboards, as well as extracting and transforming data using SQL and other technological platforms. The skills required include advanced knowledge of SQL, data modeling, data visualization, and the ability to draw insights from data. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is primarily on data management, analysis, and visualization rather than on AI or language model development or application.",
  "is_genai_role": false
}