{
  "filename": "jb3354",
  "responsibilities": [
    "Building AI Agents within and outside of the Unit21 platform to gather data and provide insights on potential financial crimes",
    "Working closely with Product to understand customer needs and workflows for better automation",
    "Defining and crafting a rich architecture of AI toolsets to create Agentic workflows that enhance customer productivity",
    "Driving continuous improvement of agentic workflows through data-driven insights and measurable outcomes",
    "Exploring research papers to prototype and implement innovative techniques for enhancing AI agents",
    "Gaining a deep understanding of the system and integrating Agentic actions at different levels of auditable automation",
    "Mentoring other engineers on best practices and architectural principles when developing with LLMs",
    "Helping to hire, train, and build Unit21’s AI Agent engineering team along with adoption and growth of the product"
  ],
  "qualifications": [
    "In-depth knowledge of machine learning data structures and modeling",
    "Understanding of software architecture, libraries, and frameworks for model creation and usage",
    "Deep understanding of successful prompt engineering techniques (e.g., Chain of Thought, Zero Shot, Negative Prompting)",
    "Experience with RAG and Multi-Agency design",
    "Experience fine-tuning LLMs",
    "Commitment to data sensitivity and security",
    "Proficiency in programming languages such as Python, GoLang, Rust, etc.",
    "Keen eye for emergent UX patterns with generative AI interactions",
    "Comfortability interacting directly with customers and understanding their needs"
  ],
  "analysis": "The job responsibilities and skills clearly indicate involvement with Generative AI and language models. The responsibilities mention \"Building AI Agents\" and \"Mentoring other engineers on best practices and architectural principles when developing with LLMs,\" which directly points to working with language models. Additionally, the skills section includes \"Deep understanding of successful prompt engineering techniques,\" \"Experience fine-tuning LLMs,\" and \"Keen eye for emergent UX patterns with generative AI interactions,\" all of which are specific to working with Generative AI and language models. The mention of \"Experience with RAG and Multi-Agency design\" and \"Proficiency in programming languages such as Python, GoLang, Rust, etc.\" further supports the involvement with AI technologies, particularly those related to language models.",
  "is_genai_role": true
}