{
  "filename": "jb4f0d",
  "responsibilities": [
    "Deliver complex code solutions.",
    "Support the build and deployment pipeline.",
    "Diagnose and solve production support or on-call issues.",
    "Contribute to overall system design, architecture, security, scalability, reliability, and application performance.",
    "Provide end-to-end support.",
    "Develop and implement computer vision algorithms for tasks such as object detection, image segmentation, feature extraction, and tracking.",
    "Work with large-scale image and video datasets to train, test, and refine models.",
    "Optimize models for performance, accuracy, and efficiency, particularly in real-time applications.",
    "Collaborate with software engineers to integrate computer vision solutions into product pipelines.",
    "Deploy computer vision models into low powered edge environments.",
    "Troubleshoot and debug models and systems to ensure robustness and reliability in production."
  ],
  "qualifications": [
    "Proficiency in programming languages such as Python, C++, Java or similar.",
    "Hands-on experience with machine learning frameworks and libraries (e.g., TensorFlow, PyTorch, OpenCV, etc.).",
    "Expertise with image processing techniques and tools.",
    "Proficiency with deep learning models and GPU acceleration.",
    "Proficiency with deploying computer vision models into edge environments.",
    "Proficiency with Cloud Technologies such as AWS, GCP, or Azure.",
    "Experience working with large datasets and creating integrations to access or share these datasets.",
    "Excellent problem-solving skills.",
    "Ability to work in a fast-paced, collaborative environment.",
    "Ability to organize multiple engineers, negotiate solutions, and provide upward communication.",
    "Consistency in demonstrating and upholding standards of coding, infrastructure, and process.",
    "Capable of high-velocity contributions.",
    "Ability to work on tasks which span multiple domains, requiring cross-team collaboration.",
    "Ability to deliver clear, concise, effective messages across different levels.",
    "Fosters a culture of mentoring and coaching across multiple technical teams and other stakeholders.",
    "Encourages sharing of opinions and contributes to discussions in a respectful manner."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on computer vision tasks, such as developing and implementing algorithms for object detection, image segmentation, and feature extraction. The responsibilities also include working with large-scale image and video datasets, optimizing models for performance, and deploying models into edge environments. The skills required include proficiency in programming languages, machine learning frameworks, image processing techniques, and deep learning models, particularly in the context of computer vision.\n\nThere is no mention of working with Generative AI (GenAI) or language models (LLMs) specifically. The focus is on computer vision, which is a different domain within artificial intelligence. While some techniques and tools may overlap between computer vision and language models, the job description does not explicitly indicate involvement with GenAI or LLMs.",
  "is_genai_role": false
}