{
  "filename": "jb6e7d",
  "responsibilities": [
    "Design embedded electronics from concept to functional prototype, including hardware selection, schematic & PCB design, board bring-up, and system level integration",
    "Troubleshoot issues that span the electrical and software boundaries using lab equipment and software debugging tools",
    "Work with modern SoCs and networking hardware to build Anduril platforms",
    "Collaborate closely with firmware/software engineers for processor/peripheral selection, board bring up, and troubleshooting",
    "Work closely with other electrical, mechanical, software, firmware, and test engineers to deliver fully functional products",
    "Operate in a fast-paced environment supporting new developments, active deployments, and customer operated hardware",
    "Manage involvement in multiple projects at various stages concurrently"
  ],
  "skills": [
    "Proficiency in using lab equipment such as oscilloscopes, DMM, logic analyzers, debuggers, and current-probes",
    "Competence in automation of tests",
    "Knowledge of embedded software development, including use of timers, interrupts, and hardware peripherals",
    "Familiarity with embedded Linux development, including device trees, hardware drivers, bootloaders, and basic Unix/Linux tools",
    "Exceptional organization and communication skills (both written and oral)",
    "Proficiency with Altium Designer or equivalent electronic design tools",
    "Familiarity with common programming languages like Python for test automation"
  ],
  "analysis": "The job responsibilities and skills listed are focused on embedded electronics design and development. The responsibilities include designing embedded electronics, troubleshooting hardware and software issues, working with system-on-chips (SoCs) and networking hardware, and collaborating with various engineering teams. The skills required include proficiency in using lab equipment, knowledge of embedded software development, familiarity with embedded Linux development, and proficiency with electronic design tools.\n\nThere is no mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on hardware design, embedded systems, and software development related to electronics, which are not directly related to GenAI or LLMs.\n\nTherefore, based on the provided information, the job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}