{
  "filename": "jb7803",
  "responsibilities": [
    "Develop and implement new AI models to solve high-value business problems.",
    "Utilize familiarity with state-of-the-art AI methods and tools to perform applied research.",
    "Adapt AI methods to new business problems and invent new methods for solving them, including machine learning, deep learning, reinforcement learning, natural language processing, computer vision, timeseries prediction, tabular data modeling, or pattern finding.",
    "Complete the full research cycle from academic literature survey, through performing the research, developing a proof of concept, and providing a production-ready model."
  ],
  "skills": [
    "Familiarity with state-of-the-art AI methods and tools.",
    "Ability to perform applied research and adapt AI methods to new business problems.",
    "Experience in machine learning, deep learning, reinforcement learning, natural language processing, computer vision, timeseries prediction, tabular data modeling, or pattern finding.",
    "Proficiency in developing algorithms for Reinforcement learning (Model-based or Model-free), Control for Gaussian Models, Neural-based control, Extremum Seeking adaptive methods, Identification in Nonlinear Systems (Parametric or Non-parametric), or Neural Ordinary Differential Equations.",
    "Experience in robotics in the manufacturing automation research domain.",
    "Proficiency in developing in Python and/or C++ languages and Linux.",
    "Intermediate to Advanced English Level."
  ],
  "analysis": "The job responsibilities and skills focus on developing and implementing AI models to solve business problems, with an emphasis on applied research and adapting AI methods. The responsibilities mention natural language processing (NLP), which is a field related to language models, but there is no explicit mention of working with Generative AI or Large Language Models (LLMs) specifically. The skills required include experience in machine learning, deep learning, reinforcement learning, and other AI-related fields, but again, there is no direct reference to Generative AI or LLMs. The focus seems to be more on a broad range of AI techniques and applications, including computer vision, timeseries prediction, and robotics, rather than specifically on generative or language models.",
  "is_genai_role": false
}