{
  "filename": "jbd813",
  "responsibilities": [
    "Build production-grade data pipelines for AI models to solve complex problems in global supply chain and manufacturing.",
    "Collaborate with cross-functional teams including Engineering, Design, Product Management, and industry experts to build high-quality product features.",
    "Take on new challenges and responsibilities as needed, and be an enthusiastic team player in a dynamic startup environment.",
    "Help shape the company by participating in hiring decisions and contributing to a culture of continuous learning and growth."
  ],
  "qualifications": [
    "Strong CS fundamentals with extensive background in architecting scalable and robust production-grade pipelines.",
    "Expertise with modern data technologies, such as Airflow, Spark (Scala preferred), Trino, Flink, and BigQuery.",
    "Proficient with SQL and skilled in Python; Scala expertise is a big plus.",
    "Excellent written and verbal communication skills, capable of articulating complex technical concepts to diverse audiences.",
    "A strong desire to learn, grow, and drive impact on real global problems.",
    "Experience with AI libraries, frameworks, and pipelines is preferred."
  ],
  "analysis": "The job involves building production-grade data pipelines for AI models, which suggests a focus on data engineering and infrastructure for AI applications. The responsibilities include collaborating with cross-functional teams to build product features, which may or may not involve GenAI or LLMs directly. The skills required emphasize strong computer science fundamentals, expertise in modern data technologies, and proficiency in SQL and Python, which are common in data engineering roles. The mention of experience with AI libraries, frameworks, and pipelines indicates a general AI focus but does not specifically point to GenAI or LLMs. There is no explicit mention of working with Generative AI or language models in the responsibilities or skills listed.",
  "is_genai_role": false
}