{
  "filename": "jc9ffb",
  "responsibilities": [
    "Collaborate with researchers, including faculty, staff, and students, to support their scholarly work.",
    "Offer technical expertise in research design, survey methodology, coding, and automation.",
    "Provide tailored solutions using Qualtrics, REDCap, and other data collection tools as necessary.",
    "Work within a team that supports all phases of the data lifecycle for quantitative, qualitative, and geospatial research.",
    "Partner closely with Data Services, Research Technology Services, NYU Libraries, faculty members, and researchers.",
    "Handle referrals, develop services, implement technology, and establish standards.",
    "Collect and present usage and resource health metrics.",
    "Manage resources and oversee projects."
  ],
  "qualifications": [
    "Excellent verbal and written communication, organizational, and interpersonal skills.",
    "Ability to work courteously and effectively with users and colleagues in a collaborative team environment.",
    "Proficiency with commonly used survey research methods.",
    "Aptitude for detail, with a commitment to accuracy and follow-through.",
    "Ability to work on independent projects, manage multiple priorities, and meet deadlines.",
    "Proficiency in a database-related coding language, such as SQL, Java, Python, or another relevant language.",
    "Experience with API programming for automation and integration tasks.",
    "Familiarity with cloud services, preferably AWS.",
    "Understanding of data privacy principles, data security practices, and compliance regulations."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on supporting research, offering technical expertise in research design, survey methodology, and automation, and providing solutions using data collection tools like Qualtrics and REDCap. The skills required include proficiency in survey research methods, database-related coding languages, API programming, and familiarity with cloud services and data privacy principles. While there is a mention of coding languages such as Python, which can be used in AI and machine learning contexts, there is no direct indication that the job involves working with GenAI or LLMs. The focus seems to be more on data collection, research support, and automation rather than on developing or working with language models or generative AI technologies.",
  "is_genai_role": false
}