{
  "filename": "jce10d",
  "responsibilities": [
    "Understand and translate business problems into working solutions.",
    "Engage directly with portfolio managers to address their development needs.",
    "Develop research and trading applications using Python (Django, Flask, Tornado, or FastAPI), front-end development (React/Angular), and AWS technologies (S3, SQS, AWS Batch, etc.).",
    "Develop software solutions in an agile fashion using modern software development practices e.g. comprehensive testing, version control practices, CI/CD (Jenkins), scheduling/orchestration (Airflow, VisualCron) etc.",
    "Ensure DevOps style management and operation of DEV/UAT/PROD deployment environments."
  ],
  "qualifications": [
    "Experimental and engineering skills focusing on end-to-end solutions.",
    "Ability to move quickly to explore and deploy new solutions in a fast-paced environment.",
    "Strong communication skills with the ability to work independently and collaboratively.",
    "Experience with end-to-end solutions, from problem statement to deployment.",
    "Knowledge on data intensive application development using Pandas, NumPy, etc.",
    "Experience developing web frontends using React and/or Angular.",
    "Working knowledge of SQL and other database technologies.",
    "Experience with developing dashboards and other data visualization applications with Plotly, Matplotlib, Bokeh, Dash, etc.",
    "Experience using AWS technologies such as S3, Athena, SQS, Batch, Lambda.",
    "Experience with DevOps practices using containerization and orchestration technologies (e.g. Docker / Kubernetes)."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on developing research and trading applications, engaging with portfolio managers, and ensuring DevOps management. The skills required include experience with Python, front-end development, AWS technologies, data visualization, and DevOps practices. There is no mention of working with AI models, natural language processing, or any specific AI technologies that would indicate involvement with GenAI or LLMs. The focus is more on software development, data-intensive applications, and cloud technologies.",
  "is_genai_role": false
}