{
  "filename": "jce7a2",
  "responsibilities": [
    "Lead the modernization of IHS health records by establishing a central repository for clinical data and longitudinal patient records.",
    "Design and implement Azure data pipelines to consolidate clinical data from 200+ healthcare facilities into an enterprise analytics environment.",
    "Develop automated ETL processes for high-volume JSON/HL7 FHIR data using Azure Data Factory and Data Lake.",
    "Create and optimize PySpark processes for large-scale healthcare data transformation.",
    "Build and maintain enterprise data models to standardize clinical information across facilities.",
    "Implement monitoring solutions to ensure data quality and pipeline performance.",
    "Provide technical leadership on cloud architecture best practices."
  ],
  "skills": [
    "Proficiency in Microsoft Azure.",
    "Strong programming skills in Python (PySpark) and .NET for large-scale data processing.",
    "Proficiency in Structured Query Language (SQL) and data modeling for enterprise-scale databases.",
    "Extensive experience with Azure data services including Azure Data Lake Gen2, Azure Synapse Analytics, Azure Data Factory, Azure Monitor, and Spark Clusters.",
    "Experience developing Infrastructure as Code and RESTful APIs in Azure.",
    "Track record of implementing CI/CD pipelines and DevOps practices.",
    "Advanced PowerBI data visualization and development skills.",
    "Experience with HL7 FHIR implementation and healthcare data standards.",
    "Experience with Agile methodologies and team leadership."
  ],
  "analysis": "The job responsibilities focus on modernizing health records, designing and implementing data pipelines, developing ETL processes, and creating data models, all within the context of healthcare data management. The skills required include proficiency in Microsoft Azure, programming in Python and .NET, SQL, and experience with Azure data services, data visualization, and healthcare data standards. There is no mention of Generative AI, language models, or any tasks related to natural language processing, text generation, or AI model development. The focus is primarily on data engineering, cloud architecture, and healthcare data standards.",
  "is_genai_role": false
}