{
  "filename": "jced8b",
  "responsibilities": [
    "Write SQL or other querying code to extract and manipulate data from various on and off chain data sources",
    "Partner with Product and Data Science to design and define analytics product specifications",
    "Ensure accuracy of data results and analytic methods through testing and validation of underlying data",
    "Coordinate closely with Data Product on issue resolution",
    "Learn about the top Blockchains and Protocols to model a data framework for proper analysis of their use cases",
    "Become an expert on customer blockchain projects and serve as the main point of contact for data questions",
    "Mentor other analysts",
    "Build data models that align with analytics product specifications in SQL and other programming languages",
    "Work with internal and external blockchain analysts to gather insights and gain a better understanding of the data",
    "Accept and give out constructive feedback and switch priorities based on the team’s needs"
  ],
  "skills": [
    "Strong analytical background",
    "Experience working with complex data sets",
    "Subject matter expertise with Blockchain Data",
    "Ability to create dbt models",
    "Background in data modeling",
    "Familiarity with star schema and dimensional modeling",
    "Self-directed and capable of driving projects forward to meet deadlines",
    "Great communication skills (verbal and written)",
    "Ability to present ideas to a wide audience",
    "Strong background in writing SQL (Snowflake, Athena, Hive, Postgres, SQL Server)",
    "Familiarity with ETL pipelining tools like DBT",
    "Analytical mindset"
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on data analysis, data modeling, and working with blockchain data. The responsibilities include writing SQL queries, partnering with product and data science teams, ensuring data accuracy, and building data models. The skills required include a strong analytical background, experience with complex data sets, and expertise in blockchain data. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on data extraction, manipulation, and modeling, particularly in the context of blockchain technology, rather than on natural language processing or AI model development.",
  "is_genai_role": false
}