{
  "filename": "jd1edd",
  "responsibilities": [
    "Design, build, and maintain data infrastructure for a clinical data registry platform.",
    "Manage, optimize, and expand data infrastructure to enable critical insights.",
    "Build and grow a clinical data registry platform over many years.",
    "Collaborate with a dedicated team of collaborators and customers.",
    "Leverage data engineering skills to positively impact patient outcomes."
  ],
  "skills": [
    "Advanced SQL and Python.",
    "Expertise in designing and constructing Big Data Lakes and Data Warehouses.",
    "Experience building dynamic, metadata-driven pipelines and analyses.",
    "Building and managing fully automated data pipelines (ETL, ELT, ELTL).",
    "Designing and building data interfaces to source systems.",
    "Combining and transforming data into appropriate formats for storage.",
    "Developing data sets for analytics purposes.",
    "Developing pipelines that handle common issues/errors robustly and automatically.",
    "Cloud experience in Azure, AWS, or GCP.",
    "Spark / PySpark experience.",
    "Working in Agile and DevOps environments.",
    "Basic Python, Bash, or PowerShell for automation.",
    "Data modeling – Kimball, Data Vault, Star/Snowflake schema, Query-first, etc.",
    "Data visualization in Power BI, Tableau, Qlik, or similar.",
    "Architecting Data Platforms - designing BI/MI/Analytics solutions using Big Data, Relational, or Streaming technologies."
  ],
  "analysis": "The job responsibilities and skills listed focus primarily on data infrastructure, data engineering, and data analytics. The responsibilities include designing, building, and maintaining data infrastructure, managing and optimizing data infrastructure, and collaborating with a team to impact patient outcomes. The skills required include advanced SQL and Python, expertise in Big Data Lakes and Data Warehouses, building automated data pipelines, cloud experience, and data visualization.\n\nThere is no mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on data engineering, data management, and analytics rather than on developing or working with AI models, particularly those related to natural language processing or generation.\n\nTherefore, based on the provided information, the job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}