{
  "filename": "jd2ac1",
  "responsibilities": [
    "Enhance the existing NLP/NLU platform using the latest machine learning techniques and tools.",
    "Work on voice transcription and translation pipelines, search and discovery algorithms, Generative AI, and voice assistance technology.",
    "Solve problems in the NLP/NLU domain such as named entity recognition, user intent recognition, and query classification.",
    "Build, train, and deploy open source models such as Whisper and LLaMA.",
    "Hypothesize, design, and conduct experiments in natural language processing, understanding, and generation.",
    "Build tools to mine and label text datasets for training and testing.",
    "Work on search algorithms and optimizations using OpenSearch/Elastic Search."
  ],
  "qualifications": [
    "Understanding of transformer models and GenAI, including few-shot learning, fine-tuning, guardrailing, and benchmarking.",
    "Knowledge of neural network architectures for NLP, such as CNN, LSTM, GRU, and transformer-based architectures.",
    "Deep understanding of word embeddings, BERT, GPT, text classifiers, transfer learning, text mining, and text labeling concepts.",
    "Experience with technologies like Tensorflow, PyTorch, spaCy, Sagemaker, MLFlow, Airflow, TensorBoard, Anaconda, Jupyter, and Kubernetes.",
    "Experience with building personal digital assistants or chatbots.",
    "Experience with building search platforms and personalizing search and discovery.",
    "Worked with automatic speech recognition (ASR)."
  ],
  "analysis": "The job responsibilities and skills clearly indicate involvement with Generative AI (GenAI) and language models (LLMs). The responsibilities mention working on Generative AI, building, training, and deploying open-source models like Whisper and LLaMA, and conducting experiments in natural language processing, understanding, and generation. These tasks are directly related to the development and application of language models and generative AI technologies.\n\nThe skills section further supports this by listing an understanding of transformer models and GenAI, including few-shot learning, fine-tuning, and benchmarking. It also mentions knowledge of neural network architectures for NLP, such as transformer-based architectures, and a deep understanding of models like BERT and GPT, which are well-known language models. Additionally, experience with building personal digital assistants or chatbots and working with automatic speech recognition (ASR) are indicative of working with language models and generative AI.\n\nOverall, both the responsibilities and skills sections strongly suggest that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}