{
  "filename": "jd2fca",
  "responsibilities": [
    "Lead multiple large-scale research and advisory projects across Latin America, from inception to completion.",
    "Oversee the work of two analysts, providing mentorship, guidance, and ensuring high-quality outputs.",
    "Collaborate with Engagement Directors to manage project timelines, deliverables, and budgets.",
    "Conduct stakeholder engagement, including presenting findings and solutions to clients and partners.",
    "Design, evaluate, and manage randomized controlled trials (RCTs) and other experimental or quasi-experimental research designs.",
    "Conduct systemic analysis to identify leverage points within complex systems.",
    "Develop and implement both quantitative and qualitative research methods, including survey instruments, focus groups, and in-depth interviews.",
    "Analyze data using advanced statistical and behavioral science tools, synthesizing findings into actionable recommendations.",
    "Design and test behaviorally informed interventions, incorporating insights from psychology, economics, and behavioral science.",
    "Lead co-creation workshops with stakeholders and end-users to develop contextually relevant solutions.",
    "Provide thought leadership on applying behavioral science principles to systemic challenges.",
    "Mentor and support analysts in developing their skills and contributing to high-impact projects.",
    "Contribute to knowledge-sharing initiatives within Busara and the behavioral science community.",
    "Support business development efforts, including proposal writing, pitching, and client relationship management.",
    "Drive Busara’s regional growth strategy in Latin America, building partnerships and expanding the organization’s footprint."
  ],
  "skills": [
    "Fluency in English and either Spanish or Portuguese.",
    "Strong analytical skills with proficiency in statistical software (e.g., Stata, R, Python).",
    "Familiarity with systemic thinking and the application of behavioral insights to complex challenges.",
    "Excellent communication and writing skills for diverse audiences.",
    "Willingness to travel extensively and work in diverse environments, including challenging or sensitive contexts.",
    "Familiarity with qualitative research techniques, including human-centered design and co-creation methodologies.",
    "Technical proficiency in survey science and behavioral modeling."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The focus is on leading research and advisory projects, conducting stakeholder engagement, designing and managing research methods, analyzing data using statistical and behavioral science tools, and applying behavioral science principles. The skills required include proficiency in statistical software, systemic thinking, communication, and qualitative research techniques. While there is a mention of technical proficiency in behavioral modeling, there is no direct reference to working with GenAI or LLMs. The job seems to be more centered around behavioral science, research methodologies, and data analysis rather than AI or language models.",
  "is_genai_role": false
}