{
  "filename": "jd75ab",
  "responsibilities": [
    "Evangelize the challenges of building Enterprise Data Science Platforms to technical and non-technical audiences.",
    "Understand customer requirements in terms of scalability, availability, and security and provide architecture recommendations.",
    "Deploy Dataiku in a large variety of technical environments (on-prem/cloud, Kubernetes, Spark, Hadoop, etc).",
    "Design and build reference architectures, decks, scripts, and diagrams to make the deployment and maintenance of Dataiku smooth and easy.",
    "Coordinate with Revenue and Customer teams to deliver a consistent experience and message to our customers.",
    "Train clients and partners in the art and science of administering a bleeding-edge Elastic AI platform.",
    "Drive technical success by being a trusted advisor to prospects and internal account teams to provide the best recommendations and advance customer accounts.",
    "Troubleshoot complex customer issues when necessary."
  ],
  "skills": [
    "Strong Linux system administration experience.",
    "Hands-on experience with the Kubernetes ecosystem for setup, administration, troubleshooting, and tuning.",
    "Experience with cloud-based services like AWS, GCP, and Azure.",
    "Grit when faced with technical issues and persistence in understanding why something does not work.",
    "Comfort and confidence in client-facing interactions.",
    "Hands-on experience with the Hadoop and/or Spark ecosystem for setup, administration, troubleshooting, and tuning.",
    "Some experience with Python.",
    "Familiarity with Ansible or other application deployment tools (Terraform, CloudFormation, etc)."
  ],
  "analysis": "The job responsibilities focus on deploying and maintaining Dataiku, an enterprise data science platform, in various technical environments. The tasks include understanding customer requirements, providing architecture recommendations, and troubleshooting complex issues. The role also involves training clients and partners on the platform and coordinating with teams to ensure a consistent customer experience. The skills required include Linux system administration, experience with Kubernetes, cloud services, Hadoop, Spark, and some Python knowledge. There is no mention of working with Generative AI or language models (LLMs) in the responsibilities or skills. The focus is more on infrastructure, deployment, and administration of data science platforms rather than developing or working with GenAI or LLMs.",
  "is_genai_role": false
}