{
  "filename": "jd7735",
  "responsibilities": [
    "Assemble and build advanced optical microscopes from off-the-shelf or custom-designed optical/mechanical/electrical components",
    "Collaborate with application engineers and scientists to automate instrument control and data acquisition pipeline",
    "Conduct proof-of-principle imaging experiments to evaluate microscope performance",
    "Maintain, troubleshoot, and optimize the performance of existing microscopes in the lab",
    "Maintain accurate documentation of microscope hardware designs and standard operating procedures",
    "Train users to operate the microscope and collaborate with biologists in conducting live imaging experiments"
  ],
  "qualifications": [
    "Solid understanding of geometric optics, physical optics, Fourier optics, and imaging theory",
    "Proficient in common optical/electrical test and measurement tools",
    "Experience with CAD design software (e.g., Solidworks, Onshape)",
    "Proficient in using Python for data/image analysis and instrumentation control",
    "Willingness to learn new methods, protocols, and technologies",
    "Collaborative spirit and teamwork skills"
  ],
  "analysis": "The job responsibilities and skills listed are primarily focused on the assembly, maintenance, and operation of advanced optical microscopes. The responsibilities include building microscopes, collaborating with engineers and scientists, conducting imaging experiments, and training users. The skills required include understanding optics, proficiency in optical/electrical tools, experience with CAD design software, and using Python for data/image analysis and instrumentation control.\n\nThere is no mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on optical microscopy, data acquisition, and analysis, which are not directly related to GenAI or LLMs. The use of Python is for data/image analysis and instrumentation control, which does not imply the use of GenAI or LLMs.\n\nTherefore, based on the provided information, the job does not involve working with Generative AI or language models.",
  "is_genai_role": false
}