{
  "filename": "jd82fa",
  "responsibilities": [
    "Collaborate with the web team to identify key metrics and dashboards needed to monitor performance.",
    "Partner with the data team to design, build, and maintain scalable data pipelines to transform raw web data into structured, actionable datasets.",
    "Build and manage dashboards in Tableau to monitor website performance—from engagement and user metrics through to sales funnel performance.",
    "Proactively provide regular performance updates and recommendations for optimization.",
    "Conduct deep dive and ad hoc analyses to investigate why a specific trend is occurring.",
    "Monitor the impact of website testing and optimizations to determine impact through to pipeline and revenue.",
    "Promote self-serve analytics exploration by developing a comprehensive suite of fully automated and reliable dashboards."
  ],
  "qualifications": [
    "Experience with a mix of analytics/data engineering working with marketing/sales teams.",
    "Deep understanding of how web engagement metrics impact pipeline and revenue downstream.",
    "Experience creating visually compelling dashboards in Tableau or similar BI platforms.",
    "Proficiency in web analytics tools like Amplitude, FullStory, or similar.",
    "Proficiency in optimization tools like Optimizely, Intellimize, or similar.",
    "Proficiency in CMS tools like Contentful, Webflow, or similar.",
    "Proficiency in chat tools like Qualified, Drift, or similar.",
    "Proficiency in customer data platforms like Segment or similar.",
    "Investigative mindset and strong problem-solving skills.",
    "Excellent communication skills for conveying complex data to non-technical audiences.",
    "Highly collaborative with the ability to work cross-functionally in a fast-paced environment.",
    "Growth mindset and eagerness to learn and adapt to new technologies and challenges.",
    "Ability to build reports and dashboards in Salesforce or similar CRM tools.",
    "Proficiency in SQL, Python, and dbt for data transformation and modeling.",
    "Experience with cloud-based data warehouses like BigQuery."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on data analysis, building dashboards, and optimizing website performance. The skills required include proficiency in analytics tools, data transformation, and dashboard creation, with no mention of AI or language models. The tools and platforms mentioned, such as Tableau, Amplitude, and Salesforce, are related to data analytics and business intelligence rather than AI or LLMs. Additionally, the job emphasizes collaboration with marketing and sales teams, which aligns with data-driven decision-making rather than AI development or application.",
  "is_genai_role": false
}