{
  "filename": "jde642",
  "responsibilities": [
    "Prototype, evaluate, and iterate on solutions using real-world data and simulations to improve self-driving algorithms.",
    "Formulate problems and propose solutions based on research insights in deep learning, computer vision, and self-driving technologies.",
    "Support deploying solutions to production systems and collaborate with platform teams for seamless integration.",
    "Champion engineering excellence by ensuring high-quality, well-structured, and tested code.",
    "Collaborate in a multidisciplinary team to solve problems related to perception, motion forecasting, planning, traffic modeling, and sensor simulation.",
    "Stay up-to-date with advancements in AI, machine learning, computer vision, and self-driving technologies.",
    "Work with large datasets from various sources and Waabi World simulator.",
    "Contribute to the publication of research findings in conferences and Waabi's blog."
  ],
  "qualifications": [
    "Expertise in deep learning, computer vision, and self-driving technologies.",
    "Proficient in Python programming with a focus on high-quality, well-structured, and tested code.",
    "Comfortable working with large datasets for machine learning applications.",
    "Strong grasp of machine learning literature, including current trends and state-of-the-art techniques.",
    "Experience in working with platform teams and collaborating with research teams.",
    "Solid experience with concurrent, parallel, and distributed computing techniques.",
    "Proficiency in Pytorch, Rust, C++, and/or CUDA."
  ],
  "analysis": "The job responsibilities and skills focus primarily on self-driving technologies, deep learning, computer vision, and machine learning. The responsibilities include prototyping solutions for self-driving algorithms, collaborating on perception and motion forecasting, and staying updated with advancements in AI and self-driving technologies. The skills required include expertise in deep learning, computer vision, and self-driving technologies, proficiency in Python, and experience with large datasets and concurrent computing techniques.\n\nThere is no explicit mention of Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is more on self-driving technologies and related AI fields rather than on natural language processing or generation, which are typically associated with GenAI and LLMs.\n\nTherefore, based on the provided information, the job does not appear to involve working with Generative AI or language models.",
  "is_genai_role": false
}