{
  "filename": "jdea57",
  "responsibilities": [
    "Conduct advanced research and engineering in reliable distributed systems using AI approaches.",
    "Enable Cloud and Edge powered Embodied AI solutions for AIoT business domains such as autonomous driving, industrial automation, and robotics.",
    "Collaborate with a global team to transfer research findings to Bosch's operational units.",
    "Collaborate with UC Berkeley on scalable and distributed autonomous systems research.",
    "Implement research results to solve real-world challenges and ensure high-quality system integration within Bosch's platforms.",
    "Stay updated on technological advancements and market trends by attending academic conferences, technical events, and seminars.",
    "Offer expert insights to the management team for strategic planning, R&D trajectory, and investment decisions.",
    "Document and disseminate research findings through publications and/or patent submissions."
  ],
  "qualifications": [
    "Proficiency in programming languages such as Rust, C++, and Python.",
    "In-depth experience with autonomous system architectures for autonomous driving or robotics.",
    "Hands-on experience with middleware frameworks like AUTOSAR, ROS2, Zenoh, or DDS.",
    "Familiarity with AI inferencing and training, and knowledge of machine learning frameworks like TensorFlow or PyTorch.",
    "Experience in reliable and safe distributed function design.",
    "Strong interpersonal, communication, and teamwork capabilities."
  ],
  "analysis": "The job responsibilities and skills focus on advanced research and engineering in distributed systems, autonomous systems, and AIoT business domains such as autonomous driving, industrial automation, and robotics. The responsibilities include enabling Cloud and Edge powered Embodied AI solutions, collaborating on scalable and distributed autonomous systems research, and implementing research results to solve real-world challenges. The skills required include proficiency in programming languages like Rust, C++, and Python, experience with autonomous system architectures, middleware frameworks, and AI inferencing and training using machine learning frameworks like TensorFlow or PyTorch.\n\nWhile the job involves AI and machine learning, there is no specific mention of working with Generative AI (GenAI) or language models (LLMs). The focus is more on autonomous systems, distributed systems, and AIoT solutions rather than on natural language processing or generation tasks typically associated with GenAI or LLMs.",
  "is_genai_role": false
}