{
  "filename": "jdf99d",
  "responsibilities": [
    "Translate complex data requirements into clear data sampling plans with efficient SQL queries.",
    "Create and maintain dashboards (Tableau) and data pipelines (DBT) that help drive product and business decisions.",
    "Work closely with Ai Engineering team to build toolings for data science projects.",
    "Contribute to continuous efforts to enforce data privacy and compliance.",
    "Answer daily questions from Ai team about data.",
    "Collaborate with cross-functional teams, including Ai, engineering, and product team.",
    "Conduct in-depth data analysis that leads to new data science opportunities and business insights."
  ],
  "qualifications": [
    "Excellent data analysis skills from writing and optimizing SQL queries to data visualization and report writing.",
    "Strong foundation in statistics.",
    "Familiarity with DBT Cloud (bonus: DBT Core).",
    "Familiarity with BI tools such as Tableau and DOMO.",
    "Functional competency in Python or similar scripting language.",
    "Strong attention to detail, with a focus on data accuracy, quality, and integrity.",
    "Familiarity with analyzing user behaviour data (e.g., Amplitude) would be a plus.",
    "Familiarity with public cloud environments such as GCP, AWS, etc.",
    "Strong problem-solving and analytical abilities, with the capacity to handle complex technical and analytical problems.",
    "Excellent communication and collaboration skills to effectively work in a multi-disciplinary team.",
    "Familiarity with version control tools like Git for collaborative projects."
  ],
  "analysis": "The job responsibilities and skills listed do not explicitly mention Generative AI (GenAI) or language models (LLMs). The responsibilities focus on data analysis, creating dashboards, maintaining data pipelines, and collaborating with AI and engineering teams. The skills required include data analysis, SQL, statistics, Python, and familiarity with BI tools and cloud environments. While there is mention of working with an AI team, there is no specific reference to working with GenAI or LLMs. The focus appears to be more on data science, data analysis, and engineering support rather than on developing or working with language models or generative AI technologies.",
  "is_genai_role": false
}