{
  "filename": "je03e8",
  "responsibilities": [
    "Work on advanced Machine Learning (ML) and Artificial Intelligence (AI) technologies, focusing on areas such as Large language models (LLMs), Generative AI, Search, Conversational Agents, and AI Optimization.",
    "Pioneer innovations to address complex real-world problems and develop state-of-the-art AI solutions.",
    "Design system and model architectures.",
    "Conduct rigorous experimentation and model evaluations.",
    "Apply AI/ML to various product problems to improve Atlassian products.",
    "Actively contribute to Atlassian Intelligence features."
  ],
  "qualifications": [
    "Proficiency in Python programming and ability to write clean, efficient, and well-documented code.",
    "Expertise in managing data using Python libraries such as NumPy, Pandas, Matplotlib.",
    "Experience leveraging models from Hugging Face.",
    "Practical knowledge of applied machine learning and deep learning frameworks, like PyTorch.",
    "Exposure to natural language processing (NLP), Computer Vision (CV), Reinforcement Learning (RL), and AI Optimization.",
    "Familiarity with state-of-the-art research in machine learning and AI.",
    "Ability to solve ambiguous and complex problems, navigate uncertain situations, and develop innovative solutions."
  ],
  "analysis": "The job responsibilities explicitly mention working on advanced Machine Learning (ML) and Artificial Intelligence (AI) technologies, with a specific focus on Large Language Models (LLMs) and Generative AI. This indicates that the job involves working with these technologies. Additionally, the responsibilities include working on Conversational Agents, which often utilize language models, and contributing to AI features, which could involve GenAI.\n\nThe skills section further supports this analysis. It mentions experience with models from Hugging Face, a platform known for its work with language models and generative AI. The skills also include practical knowledge of applied machine learning and deep learning frameworks, which are commonly used in developing and deploying LLMs and GenAI solutions. The mention of natural language processing (NLP) aligns with working with language models.\n\nOverall, both the responsibilities and skills clearly indicate that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}