{
  "filename": "je3014",
  "responsibilities": [
    "Contribute to multiple AI/ML programs in various phases of their lifecycles—Dev*Ops of planning, data, development, and deployment",
    "Implement mature applied mathematical techniques such as Bayesian Estimation, Neural Networks, and Reinforcement Learning to solving real-world autonomous vehicle operations",
    "Be conversant on the current AI/ML developments, practices, and principles",
    "Generate and propose analytical approaches that fit technical and business requirements and constraints",
    "Curate, tag, and wrangle data",
    "Be a proficient algorithm developer; MATLAB, and/or C++ skills are critical",
    "Demonstrate flexibility, scalability regarding your development environment and platform",
    "Coordinate with others to ensure optimized hardware/software/resource utilization",
    "Ensure solutions meet and comply with all security and contractual requirements",
    "Demonstrated experience writing technical proposals",
    "Other duties as required"
  ],
  "skills": [
    "Proficiency in algorithm development",
    "MATLAB and/or C++ skills",
    "Flexibility and scalability in development environment and platform",
    "Ability to wrangle data",
    "Competence in a variety of programming languages (e.g., Python, MATLAB, Java, C++, LISP, R)",
    "Exceptional verbal and written communication skills",
    "Ability to work independently and as a team member",
    "Demonstrated initiative with product or algorithm development"
  ],
  "analysis": "The job responsibilities and skills listed focus on AI/ML programs, applied mathematical techniques, and algorithm development. The responsibilities include implementing techniques such as Bayesian Estimation, Neural Networks, and Reinforcement Learning, which are common in AI/ML but not specifically indicative of working with Generative AI or language models. The skills required include proficiency in algorithm development, MATLAB, C++, and other programming languages, as well as data wrangling and communication skills. There is no explicit mention of Generative AI, language models, or tasks typically associated with them, such as natural language processing, text generation, or working with specific LLM frameworks like GPT or BERT. The focus seems to be more on general AI/ML and algorithm development rather than on Generative AI or LLMs.",
  "is_genai_role": false
}