{
  "filename": "jeaf37",
  "responsibilities": [
    "Lead end-to-end research projects from planning and methodology selection to execution and presentation of findings.",
    "Conduct qualitative and quantitative research including user interviews, usability testing, participatory design, diary studies, usability studies, and surveys.",
    "Deliver actionable insights to understand customers, identify business opportunities, and shape decision-making.",
    "Proactively share insights using clear communication strategies and advanced storytelling.",
    "Build strong cross-functional relationships with Design, Product, Engineering, and Data Science teams to integrate research and user feedback into product development."
  ],
  "qualifications": [
    "4+ years of professional industry experience in UX research for digital products.",
    "Ability to balance between craft, speed, and the bottom line.",
    "Understanding of strengths and limitations of different research methods.",
    "Hands-on experience in independently designing and running UX research.",
    "Good listening and collaboration skills with different stakeholders."
  ],
  "analysis": "The job described involves leading research projects, conducting qualitative and quantitative research, delivering insights, and building cross-functional relationships. The responsibilities focus on user experience (UX) research, which includes user interviews, usability testing, and surveys. The skills required include experience in UX research, understanding research methods, and collaboration skills.\n\nThere is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The focus is on UX research methodologies and integrating user feedback into product development, which does not inherently involve GenAI or LLMs. While these technologies could potentially be used in UX research, there is no explicit indication in the job description that they are a part of this role.",
  "is_genai_role": false
}