{
  "filename": "jf1613",
  "responsibilities": [
    "Build AI models and features that directly impact Loop’s business.",
    "Train and deploy in-house multimodal LLMs.",
    "Scale inference infrastructure.",
    "Build out and ship AI agent workflows.",
    "Extract, normalize, and link data using multimodal LLMs.",
    "Ensure high accuracy in data models for customer data ingestion and normalization.",
    "Expand AI capabilities into workflow automation and audit.",
    "Develop and fine-tune multimodal LLMs to reduce hallucinations.",
    "Build agents that audit freight invoices."
  ],
  "qualifications": [
    "Proficiency in deep learning frameworks (e.g., PyTorch, Tensorflow).",
    "Solid understanding of fundamental ML algorithms, especially multimodal LLMs.",
    "Experience in fine-tuning LLMs and deploying them to production.",
    "Ability to ship high-quality code to production.",
    "Experience in cloud environments (AWS, Google, Azure).",
    "Strong communication skills.",
    "Willingness to collaborate in a cross-functional team environment.",
    "Ability to keep up to date with the latest AI research.",
    "Ability to work in a fast-paced environment."
  ],
  "analysis": "The job responsibilities and skills clearly indicate involvement with Generative AI and language models. The responsibilities include tasks such as training and deploying in-house multimodal LLMs, developing and fine-tuning multimodal LLMs to reduce hallucinations, and extracting, normalizing, and linking data using multimodal LLMs. These tasks are directly related to working with language models. Additionally, the skills required include proficiency in deep learning frameworks, a solid understanding of fundamental ML algorithms, especially multimodal LLMs, and experience in fine-tuning LLMs and deploying them to production. These skills are essential for working with language models and Generative AI. Therefore, the job involves working with Generative AI and language models.",
  "is_genai_role": true
}