{
  "filename": "jf5ac9",
  "responsibilities": [
    "Own the proactive and reactive support for Glean customers by prioritizing issues for your designated customer(s)",
    "Meet with your assigned customers regularly to review issues and develop resolution plans and drive continuous improvement in how you and your Glean teammates provide support to them",
    "Be available to your assigned customers via collaborative communication channels consistently to ensure you are providing timely responses and updates on issues",
    "Create and maintain customer-specific runbooks and knowledge articles",
    "Provide first response, technical troubleshooting, resolution, and follow-through of customer issues and inquiries",
    "Assist customers in the configuration, set-up, and verification of new content sources and product features to enable them to realize additional value for their users",
    "Educate customers on the use of Glean product features",
    "Identify system and user health issues, then create and execute remediation plans while coordinating and updating the customer accordingly",
    "Handle customer-impacting alerts which require coordination with customer admin and system resources through resolution",
    "Work closely with teams across Glean to drive product, process, and service improvements",
    "Drive key improvement projects that will improve the scale and efficiency of support, while providing upgrades to the customers’ support experience",
    "Coordinate all support activities with your assigned customer(s), which may include more stringent access and security processes, ensuring you move with high urgency for their issues",
    "Represent the unique needs of your assigned customer(s) with respect to product and security improvements that will improve the customer support experience"
  ],
  "skills": [
    "Problem solving: technical problem-solving skills including the ability to troubleshoot and isolate issues to their root cause",
    "Ability to debug issues including searching & reading application logs, analyzing stack traces and browser trace files",
    "Strong communicator: professional presenter with superior interaction skills with both customers and internal teams",
    "Detail-oriented: highly organized and methodical, ensuring all issues are managed to completion",
    "Data-driven: utilize metrics and objective measurements to assess success and improvement opportunities"
  ],
  "analysis": "The job responsibilities primarily focus on customer support, issue resolution, and improving customer experience with the Glean product. The tasks include troubleshooting, creating runbooks, educating customers on product features, and coordinating support activities. The skills required emphasize problem-solving, debugging, communication, organization, and data-driven decision-making. There is no mention of working with Generative AI (GenAI) or language models (LLMs) in the responsibilities or skills. The job seems to be centered around technical support and customer service rather than developing or working with AI technologies.",
  "is_genai_role": false
}