{
  "filename": "jf816b",
  "responsibilities": [
    "Partner with a cross-functional team of engineers, research scientists, technical program managers, and product managers to deliver AI-powered products.",
    "Design, develop, test, deploy, and support AI software components including foundation model training, large language model inference, similarity search, guardrails, model evaluation, experimentation, governance, and observability.",
    "Leverage a broad stack of Open Source and SaaS AI technologies such as AWS Ultraclusters, Huggingface, VectorDBs, Nemo Guardrails, PyTorch, and more.",
    "Invent and introduce state-of-the-art LLM optimization techniques to improve the performance of large scale production AI systems.",
    "Contribute to the technical vision and the long term roadmap of foundational AI systems at Capital One."
  ],
  "qualifications": [
    "Ability to build systems and take pride in the quality of work.",
    "Passion for staying abreast of the latest research and ability to understand scientific publications.",
    "Ability to adapt quickly and bring clarity to big, undefined problems.",
    "Strong foundation in engineering and mathematics.",
    "Expertise in hardware, software, and AI to see and exploit optimization opportunities.",
    "Resilience and ability to forge new paths to achieve business goals."
  ],
  "analysis": "The job responsibilities clearly indicate involvement with Generative AI and language models. The responsibilities include designing, developing, and supporting AI software components such as foundation model training and large language model inference. The mention of \"LLM optimization techniques\" directly refers to working with Large Language Models. Additionally, the use of technologies like Huggingface, which is known for its work with language models, further supports this. The skills required, such as a strong foundation in engineering and mathematics, and expertise in AI, align with the technical demands of working with GenAI and LLMs.",
  "is_genai_role": true
}