{
  "filename": "jf9ece",
  "responsibilities": [
    "Lead projects in the responsible AI frontier to identify, avoid, and mitigate bias across a wide range of ML applications at Pinterest, including generative AI.",
    "Collaborate with other engineering teams to leverage their platforms and signals and work with them to adopt and evaluate Inclusive AI and ML Fairness tooling across Pinterest.",
    "Mentor junior engineers on the Inclusive AI team and across the company on the Inclusive AI / ML Fairness space.",
    "Work with the team and senior leaders at the company to define and drive technical strategy in this area."
  ],
  "qualifications": [
    "Production experience in ML and responsible technology (fairness, diversity, equity) deployments in production systems.",
    "Familiarity with state of the art ML approaches, especially within the Search and RecSys space, such as transformer based architectures, n-tower architectures, LLMs, etc.",
    "Hands-on experience building, deploying, and measuring ML Fairness at a very large scale.",
    "Ability to bridge state of the art approaches to real world impact.",
    "Experience in leadership roles with the ability to define a vision, strategy, and plans, with concrete OKRs and execute on them.",
    "Experience in working on backend and ML systems for large-scale user-facing products.",
    "Good understanding of how backend and ML systems work.",
    "Experience in closely collaborating with other engineering teams to ship ML technologies to improve fairness and reduce bias."
  ],
  "analysis": "The job responsibilities include leading projects in the responsible AI frontier, specifically mentioning generative AI, which directly indicates involvement with Generative AI. Additionally, the skills section mentions familiarity with state-of-the-art ML approaches, including transformer-based architectures and LLMs (Large Language Models), which are key components of language models. The mention of LLMs explicitly indicates that the job involves working with language models. Therefore, both the responsibilities and skills sections provide clear evidence that the job involves working with Generative AI and language models.",
  "is_genai_role": true
}