{
  "filename": "jfaf0b",
  "responsibilities": [
    "Train and fine-tune cutting-edge models on real-world lab data.",
    "Collaborate with experts across biology and automation to push boundaries.",
    "Design and implement generative models tailored for biological sequences, structures, and molecular modalities.",
    "Integrate domain-specific constraints and priors into generative models to enhance biological plausibility and experimental viability.",
    "Develop rigorous testing, documentation, and model benchmarking."
  ],
  "qualifications": [
    "Proficiency in large-scale generative models.",
    "Expertise in data pipelines.",
    "Excellence in software engineering.",
    "Experience with ML frameworks such as PyTorch, TensorFlow, or Jax.",
    "Robust experience in the Python data science ecosystem.",
    "Experience in training and deploying ML models on distributed computing services (e.g., AWS, GCP, Azure, or clusters)."
  ],
  "analysis": "The job responsibilities include designing and implementing generative models tailored for biological sequences, structures, and molecular modalities. This indicates a focus on generative AI, as it involves creating models that can generate new data based on learned patterns. Additionally, the responsibility to integrate domain-specific constraints into generative models further supports the involvement of generative AI.\n\nThe skills required for the job include proficiency in large-scale generative models, which directly points to working with generative AI. The mention of experience with ML frameworks such as PyTorch, TensorFlow, or Jax, and training and deploying ML models on distributed computing services, suggests a strong focus on machine learning and model development, which is consistent with working on generative AI projects.\n\nOverall, both the responsibilities and skills indicate that the job involves working with generative AI. There is no explicit mention of language models or large language models (LLMs), but the focus on generative models suggests a strong likelihood of working with generative AI technologies.",
  "is_genai_role": true
}