{
  "filename": "jfbbf9",
  "responsibilities": [
    "Research methodologies to adapt topological descriptors to rate-distortion theories for reducing scientific data with trusts.",
    "Develop automatic derivation for preserving quantity of interests in scientific data compression.",
    "Research machine learning approaches for analyzing and simplifying topological features derived from ensemble simulations.",
    "Carry out software deliverables in collaboration with domain science stakeholders including hard X-ray sciences and climate sciences.",
    "Mentor graduate researchers.",
    "Participate in conferences/workshops to share research progress.",
    "Write and publish scientific documents."
  ],
  "skills": [
    "Expertise in visualization or high-performance computing.",
    "Programming skills in languages such as C/C++, Python, or equivalent.",
    "Proficiency in machine learning frameworks such as TensorFlow and PyTorch.",
    "Excellent communication and writing skills.",
    "Ability to work independently and collaboratively with interdisciplinary researchers."
  ],
  "analysis": "The job responsibilities focus on research methodologies for scientific data reduction, developing automatic derivation for data compression, and analyzing topological features using machine learning. The responsibilities also include software deliverables, mentoring, and participating in conferences. The skills required include expertise in visualization or high-performance computing, programming skills in languages like C/C++ and Python, proficiency in machine learning frameworks such as TensorFlow and PyTorch, and excellent communication skills.\n\nWhile the job involves machine learning, there is no explicit mention of working with Generative AI (GenAI) or language models (LLMs). The focus seems to be more on scientific data analysis, compression, and visualization rather than on natural language processing or generation tasks typically associated with GenAI or LLMs. The use of machine learning frameworks like TensorFlow and PyTorch could potentially involve GenAI or LLMs, but without specific mention of tasks related to language models or generative tasks, it is not clear that this job involves working with GenAI or LLMs.",
  "is_genai_role": false
}