{
  "filename": "j0fafd",
  "responsibilities": [
    "Own, plan, and optimize the AI behind Enterprise customer’s deepest technical problems",
    "Leverage SGP to build advanced AI agents with multimodal functionality and tool-calling",
    "Gather business requirements and translate them into technical solutions",
    "Meet regularly with customer teams onsite and virtually, collaborating cross-functionally",
    "Push production code in multiple development environments, writing and debugging code in both customer’s and Scale’s codebases",
    "Multi-task and learn new technologies quickly"
  ],
  "skills": [
    "Ability to solve deeply complex technical problems with ambiguity using state-of-the-art research and AI",
    "Proficiency in Python to write, test, and debug code using common libraries (e.g., numpy, pandas)",
    "Experience working with cloud technology stack (e.g., AWS or GCP) and developing machine learning models in a cloud environment",
    "Strong knowledge of software engineering best practices",
    "Familiarity with state-of-the-art LLMs and their strengths/weaknesses"
  ],
  "analysis": "The Job responsibilities and skills focus on solving complex technical problems using AI, writing and debugging code, working with cloud technologies, and collaborating cross-functionally. The skills required include proficiency in Python, experience with cloud technology stacks, and familiarity with state-of-the-art LLMs.\n\n1. **AI Research Scientist**: This option focuses on AI methodologies, experiments, and staying current with AI research. While there is some overlap in AI and LLMs, the job's focus on solving technical problems and coding aligns less with research and more with engineering.\n\n2. **AI/ML Engineer**: This option involves transforming research into scalable AI solutions, productionizing models, and collaborating with research scientists. The job's focus on solving technical problems, writing and debugging code, and working with cloud technologies aligns well with this role.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment, scaling, and monitoring AI systems. While there is some overlap in cloud technologies, the job's focus on solving technical problems and coding aligns less with infrastructure and more with engineering.\n\n4. **AI Solution Architect**: This option involves designing AI solutions and collaborating cross-functionally. While there is some overlap in collaboration and AI, the job's focus on solving technical problems and coding aligns less with architecture and more with engineering.\n\n5. **Data Scientist**: This option focuses on statistical analysis, machine learning, and data visualization. While there is some overlap in machine learning, the job's focus on solving technical problems and coding aligns less with data science and more with engineering.\n\n6. **Data Engineer**: This option involves designing data pipelines and architectures. While there is some overlap in cloud technologies, the job's focus on solving technical problems and coding aligns less with data engineering and more with AI/ML engineering.\n\n7. **Product Manager**: This option focuses on product vision, strategy, and collaboration. While there is some overlap in collaboration, the job's focus on solving technical problems and coding aligns less with product management and more with engineering.\n\n8. **Software Engineer**: This option involves designing and maintaining software applications, writing code, and collaborating with teams. While there is some overlap in coding and collaboration, the job's focus on AI and solving technical problems aligns more with AI/ML engineering.\n\nThe job's responsibilities and skills align most closely with the AI/ML Engineer role, as it involves solving technical problems, writing and debugging code, and working with cloud technologies.",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}