{
  "filename": "j154ea",
  "responsibilities": [
    "Process and structure large amounts of graph data to power applications across Atlassian.",
    "Build great APIs.",
    "Use generative AI and ML creatively to process, structure, and reason over large amounts of data to power intelligent products.",
    "Mentor and coach team members on best practices, code quality, design patterns, testing, debugging, and documentation.",
    "Communicate and explain data science concepts to diverse audiences and craft a compelling story.",
    "Communicate effectively with internal and external partners, present technical concepts and results clearly and concisely, and solicit feedback and input from various stakeholders."
  ],
  "skills": [
    "Experience building and scaling business applications and systems using large amounts of data.",
    "Ability to build generalizable platforms with a focus on empowering applications in product.",
    "Agile development mindset, appreciating the benefit of iteration and improvement.",
    "Experience working with LLMs and RAG (a bonus)."
  ],
  "analysis": "The Job Responsibilities and Skills focus on processing and structuring large amounts of graph data, building APIs, using generative AI and ML, mentoring team members, and communicating data science concepts. The Skills required include experience with large data applications, building platforms, an agile mindset, and experience with LLMs and RAG.\n\n1. **AI Research Scientist**: This option focuses on AI methodologies, experiments, and staying current with AI research. While there is some overlap with generative AI, the primary focus on research and experiments does not align well with the job's emphasis on application development and mentoring.\n\n2. **AI/ML Engineer**: This role involves transforming research into scalable AI solutions, developing data pipelines, and collaborating with research scientists. The job's focus on building APIs and using AI/ML creatively aligns with this option, especially with the emphasis on scaling business applications and systems using large data.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is about deploying and monitoring AI systems, which does not align with the job's focus on building APIs and mentoring.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with SMEs, which partially aligns with the job's focus on using AI creatively and communicating concepts. However, the job's emphasis on building APIs and mentoring is not a primary focus here.\n\n5. **Data Scientist**: This option focuses on data analysis, model development, and presenting findings, which does not align with the job's focus on building APIs and using AI/ML creatively.\n\n6. **Data Engineer**: This role involves building data pipelines and architectures, which does not align with the job's focus on building APIs and using AI/ML creatively.\n\n7. **Product Manager**: This option involves driving product vision and strategy, which does not align with the job's focus on building APIs and using AI/ML creatively.\n\n8. **Software Engineer**: This role involves developing software applications and services, which aligns with the job's focus on building APIs and mentoring team members. The emphasis on code quality, design patterns, and testing also matches the job's responsibilities.\n\nThe job is a good fit with Option 2 (AI/ML Engineer) and Option 8 (Software Engineer). However, the emphasis on building APIs and using AI/ML creatively suggests a stronger alignment with the AI/ML Engineer role, which focuses on transforming research into scalable solutions and developing data pipelines.",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}