{
  "filename": "j21947",
  "responsibilities": [
    "Tackle meaningful technical problems using deep understanding of CV, ML, NLP, and AI.",
    "Collaborate with the product development team to transfer ideas into solutions for Huawei products.",
    "Utilize frameworks such as TensorFlow, PyTorch, and other relevant tools to build and deploy machine learning models.",
    "Conduct academic and applied research by developing core algorithms and platforms.",
    "Guide and manage processes including data collection, processing, model training, and testing.",
    "Develop highly-optimized, compact models for real-time processing.",
    "Develop and fine-tune neural network architectures, including CNNs, encoder-decoder structures, and generative networks."
  ],
  "skills": [
    "Proficiency in software design and programming.",
    "Expertise in Python and C/C++.",
    "Hands-on development experience, preferably in a Linux-based environment.",
    "Solid foundation in AI/ML principles.",
    "Exposure to cutting-edge machine learning trends.",
    "Strong analytical and problem-solving abilities."
  ],
  "analysis": "The job responsibilities and skills focus heavily on machine learning (ML), computer vision (CV), natural language processing (NLP), and artificial intelligence (AI). The responsibilities include developing and deploying machine learning models, conducting research, and collaborating with product development teams. The skills required include proficiency in Python and C/C++, experience in a Linux-based environment, and a solid foundation in AI/ML principles.\n\n1. **AI Research Scientist**: This option focuses on investigating AI methodologies and conducting experiments, which aligns with the job's emphasis on research and developing core algorithms. However, the job description does not mention generative models or LLMs, which are a primary focus for this option.\n\n2. **AI/ML Engineer**: This option involves transforming research into scalable AI solutions, which aligns with the job's focus on deploying machine learning models and collaborating with product teams. The skills required, such as proficiency in Python and software engineering practices, also match well with the job description.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment, scaling, and monitoring of AI systems, which is not the primary focus of the job. The job is more about developing models and conducting research rather than infrastructure management.\n\n4. **AI Solution Architect**: This option involves designing AI solutions and collaborating with SMEs, which does not align with the job's focus on technical problem-solving and model development.\n\n5. **Data Scientist**: This option focuses on data analysis and model development, which partially aligns with the job. However, the job is more focused on developing and deploying models rather than data analysis and visualization.\n\n6. **Data Engineer**: This option is about building data pipelines and architectures, which does not align with the job's focus on model development and research.\n\n7. **Product Manager**: This option involves driving product vision and strategy, which does not align with the technical and research-focused nature of the job.\n\n8. **Software Engineer**: This option involves software development and system architecture, which partially aligns with the job's requirement for proficiency in programming. However, the job is more focused on AI/ML model development rather than general software engineering.\n\nThe job description aligns most closely with the \"AI/ML Engineer\" option, as it involves developing and deploying machine learning models, collaborating with product teams, and requires proficiency in Python and software engineering practices.",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}