{
  "filename": "j266aa",
  "responsibilities": [
    "• Build and operationalize complex data solutions, correct problems, apply transformations, and recommend data cleansing/quality solutions.",
    "• Design complex data solutions.",
    "• Perform analysis of complex sources to determine value and use and recommend data to include in analytical processes.",
    "• Incorporate core data management competencies including data governance, data security, and data quality.",
    "• Collaborate within and across teams to support delivery and educate end users on complex data products/analytic environment.",
    "• Perform data and system analysis, assessment, and resolution for complex defects and incidents and correct as appropriate.",
    "• Test data movement, transformation code, and data components.",
    "• Design and implement secure data pipelines to support LLM and GenAI applications across international markets.",
    "• Build and maintain vector database infrastructure for efficient storage and retrieval of embeddings used in RAG applications.",
    "• Develop APIs and integration layers for enterprise AI services, ensuring compliance with regional data protection requirements.",
    "• Create and optimize data streaming architectures for real-time AI applications across multiple geographic regions.",
    "• Implement monitoring and observability solutions for AI data pipelines to ensure performance and reliability across international operations.",
    "• Collaborate with international teams to establish data governance practices for AI applications across different regulatory environments.",
    "• Perform other duties as assigned."
  ],
  "skills": [
    "• Technical expertise in Large Language Models (LLMs) and Generative AI platforms (Anthropic, OpenAI).",
    "• Prompt engineering and LLM optimization techniques.",
    "• Retrieval-Augmented Generation (RAG) architectures.",
    "• Vector database implementations (Postgres, OpenSearch, Pinecone, or Weaviate).",
    "• AI Agent development and orchestration.",
    "• Enterprise API development and integration.",
    "• Responsible AI and AI safety practices.",
    "• Data security and privacy frameworks.",
    "• Cloud and AI infrastructure experience, including AWS services (especially Bedrock, Lambda, S3).",
    "• LLM deployment strategies and integration.",
    "• Model serving and scaling techniques.",
    "• Container orchestration (Kubernetes/Docker).",
    "• Infrastructure as Code (Terraform).",
    "• MLOps and monitoring practices.",
    "• Data processing and storage, including Snowflake and data warehouse technologies.",
    "• Real-time and batch processing systems.",
    "• ETL/ELT pipeline development.",
    "• Data quality and validation frameworks.",
    "• Vector embedding techniques.",
    "• Knowledge base creation and management.",
    "• Development practices, including Python, SQL, and shell scripting.",
    "• API design and development.",
    "• Git and CI/CD pipelines.",
    "• Testing and monitoring frameworks.",
    "• Documentation and technical writing.",
    "• Agile/Scrum methodologies."
  ],
  "analysis": "The job responsibilities and skills focus heavily on data solutions, AI applications, and infrastructure, with a strong emphasis on data pipelines, AI services, and compliance with data protection requirements. The skills required include expertise in LLMs, AI platforms, vector databases, API development, cloud infrastructure, and MLOps practices.\n\n1. **AI Research Scientist**: This option focuses on AI methodologies, experiments, and staying current with AI research. While there is some overlap in LLM expertise, the job's focus on data solutions and infrastructure is not aligned with this role's primary focus on research and experimentation.\n\n2. **AI/ML Engineer**: This role involves transforming research into scalable AI solutions and developing data pipelines. There is some overlap with the job's focus on data pipelines and AI applications, but the job's emphasis on infrastructure and compliance is not a primary focus here.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is closely aligned with the job's focus on reliable deployment, scaling, and monitoring of AI systems. The responsibilities and skills related to CI/CD pipelines, monitoring, and infrastructure management match well with the job's requirements.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and ensuring compliance with data governance and security, which aligns with some aspects of the job. However, the job's focus on data pipelines and infrastructure is more technical than the architect's focus on solution design and collaboration.\n\n5. **Data Scientist**: This role focuses on statistical analysis, machine learning, and data visualization, which does not align with the job's emphasis on data solutions and AI infrastructure.\n\n6. **Data Engineer**: This role involves designing and maintaining data pipelines and architectures, which aligns with the job's focus on data solutions and infrastructure. The skills in ETL/ELT, cloud services, and data governance are relevant to the job.\n\n7. **Product Manager**: This role focuses on product vision and strategy, which does not align with the technical and infrastructure-focused responsibilities of the job.\n\n8. **Software Engineer**: This role involves software development and system architecture, which does not align with the job's focus on data solutions and AI infrastructure.\n\nThe job is most similar to the \"MLOps / AI Infrastructure Engineer\" option, as it involves ensuring reliable deployment, scaling, and monitoring of AI systems, which matches the job's focus on data pipelines, AI applications, and infrastructure management.",
  "role_classification": 3,
  "role_title": "MLOps / AI Infrastructure Engineer"
}