{
  "filename": "j3b6ea",
  "responsibilities": [
    "Identify, recruit and hire a team of scientists in Physics Informed AI with a focus on design",
    "Work closely with a multi-disciplinary team of research scientists and engineers to conceive, plan, develop, and implement scientific research projects",
    "Direct & perform research on machine learning models combining physics simulation and measurement data",
    "Manage a team, perform bi-annual evaluations, plan development, coach, mentor and connect your personnel to academic communities and throughout the company",
    "Publish papers in peer-reviewed scientific journals/conferences",
    "Supervise researchers, engineers and interns (undergrad, Masters, PhD or Post-docs)",
    "Document and communicate the intent and the results of projects in clear terms to both technical and non-technical team audiences",
    "Present research findings at conferences and participate in research collaborations with external research institutes and universities",
    "Communicate and promote the use of research findings throughout Autodesk",
    "Consult with product teams on the implementation of research findings into products"
  ],
  "skills": [
    "Excellent written and oral communication skills",
    "Excellent knowledge of Numerical Methods",
    "Ability to quickly learn new technologies and adapt to new situations",
    "Ability to collaborate effectively with a diverse, multicultural global team of scientists, engineers and architects",
    "Knowledge of geometry and topology",
    "Experience training large-scale, multi-modal models and ensembles",
    "Familiarity with collaborative development environments and version control systems",
    "Experience with 2D and 3D computer graphics programming",
    "Visualization techniques",
    "Bayesian statistics",
    "Experience with NVIDIA Warp and/or JAX, NVIDIA Modulus or similar",
    "Proficiency in Pytorch, Pytorch Lightning, Weights & Biases, Ray, AWS Sagemaker",
    "Experience training diverse architectures: CNNs, GNNs, Diffusion models, Contrastive learning, Transformers, LLMs, RNNs etc. at scale",
    "Knowledge of Koopman, DMD, SINDy, Fourier Neural Operators, PINNs etc.",
    "Computer Vision",
    "Proficiency in Python, C++, Rust",
    "Experience with OpenMP, Clang, SIMD, etc."
  ],
  "analysis": "The job responsibilities and skills focus on leading a team of scientists in Physics Informed AI, conducting research, publishing papers, and collaborating with both internal and external teams. The skills required include strong communication, numerical methods, machine learning, and proficiency in programming languages like Python and C++. \n\n1. **AI Research Scientist**: This option focuses on AI methodologies and conducting experiments, which aligns with the research aspect of the job. However, it lacks the leadership and team management responsibilities emphasized in the job description.\n\n2. **AI/ML Engineer**: This role is more about transforming research into scalable solutions, which doesn't align with the research and leadership focus of the job.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is centered around deployment and infrastructure, which is not relevant to the research and leadership aspects of the job.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with SMEs, which doesn't match the research and team management focus of the job.\n\n5. **Data Scientist**: While this role involves machine learning and data analysis, it doesn't cover the leadership and research publication aspects of the job.\n\n6. **Data Engineer**: This role is focused on data pipelines and architecture, which is not relevant to the research and leadership focus of the job.\n\n7. **Product Manager**: This role involves product vision and strategy, which doesn't align with the research and scientific focus of the job.\n\n8. **Software Engineer**: This role is about software development, which doesn't match the research and leadership focus of the job.\n\nNone of the options fully align with the job's emphasis on leading a research team, publishing scientific papers, and conducting research in Physics Informed AI. The closest match in terms of research focus is the AI Research Scientist, but it lacks the leadership and team management responsibilities that are central to the job description.",
  "role_classification": 0,
  "role_title": "Other"
}