{
  "filename": "j3c904",
  "responsibilities": [
    "Lead all on-device AI optimization efforts and collaborate with HQ and other AI Labs for product-level technical implementation.",
    "Define and lead the execution of model compression, distillation, and integration into the full on-device AI user experiences.",
    "Grow and maintain relationships with internal and external stakeholders to develop innovative Edge-centric AI applications and platforms.",
    "Publish novel research at top ML conferences.",
    "Initiate and oversee the development, implementation, administration, monitoring, and improvement of security, policies, programs, and protocols.",
    "Work with leading academic or third-party company researchers to expedite edge-centric AI platform development.",
    "Execute the full software development life cycle (SDLC)."
  ],
  "skills": [
    "Expert-level knowledge of on-device AI model optimization and accelerators.",
    "Familiarity with model compression algorithms including quantization, pruning, and distillation.",
    "Experience optimizing large diffusion models or language models.",
    "Continued experience researching the latest Generative AI trends.",
    "Good understanding of System Architecture for energy-efficient edge AI.",
    "Experience in hybrid architecture design to maximize edge processing and cloud computation.",
    "Collaboration experience with internal and external technical partners.",
    "Excellent communication skills.",
    "Experience working in agile environments with cross-functional delivery teams.",
    "Detailed knowledge of system design and software development methodology and its application to overall system design."
  ],
  "analysis": "The job responsibilities and skills focus heavily on on-device AI optimization, model compression, and edge-centric AI applications. The responsibilities include leading AI optimization efforts, collaborating with AI Labs, publishing research, and working with academic researchers. The skills required include expert-level knowledge of on-device AI model optimization, familiarity with model compression algorithms, and experience in hybrid architecture design.\n\n1. **AI Research Scientist**: This option focuses on investigating AI methodologies and conducting experiments, which aligns with the job's research and publication aspects. However, it lacks the emphasis on on-device AI optimization and edge-centric applications.\n\n2. **AI/ML Engineer**: This role involves transforming research into scalable AI solutions, which partially aligns with the job's focus on technical implementation and collaboration. However, it does not emphasize on-device AI optimization or model compression.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment and monitoring of AI systems, which is not the primary focus of the job. The job is more about optimization and research rather than infrastructure management.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with SMEs, which does not align with the job's focus on technical implementation and optimization of on-device AI.\n\n5. **Data Scientist**: This option focuses on data analysis and model development, which does not align with the job's focus on AI optimization and edge-centric applications.\n\n6. **Data Engineer**: This role involves building data pipelines and architectures, which is not relevant to the job's focus on AI model optimization and research.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which does not align with the job's technical and research-oriented responsibilities.\n\n8. **Software Engineer**: This role involves software development and system architecture, which partially aligns with the job's focus on the software development life cycle. However, it lacks the emphasis on AI optimization and research.\n\nThe job's focus on on-device AI optimization, model compression, and edge-centric applications aligns most closely with the responsibilities and skills of an AI Research Scientist, particularly in terms of research and collaboration with academic researchers. However, none of the options perfectly match the job's emphasis on on-device AI optimization and edge-centric applications. The closest match is the AI Research Scientist, but it is not a perfect fit.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}