{
  "filename": "j3d2af",
  "responsibilities": [
    "Work closely with engineers, researchers, and product managers to implement ML solutions that promote globalization and culturalization.",
    "Work across organizational boundaries to align on priorities and drive projects forward.",
    "Contribute to designing and developing Machine Learning technologies for text, image, audio, and video, focusing on Generative AI.",
    "Collaborate with cross-functional teams, including machine learning engineers, research engineers, and product management, to contribute to new ML features.",
    "Engage in the product lifecycle, design, deployment, and production operations.",
    "Be comfortable with prompt engineering and building models leveraging large data.",
    "Preprocess, clean, organize, and evaluate datasets as needed for model training and evaluation.",
    "Evaluate model performance and improve accuracy.",
    "Stay up-to-date with the latest machine learning and AI technologies, bringing innovative solutions to the team and advocating for new tools, frameworks, and methodologies.",
    "Create and maintain detailed documentation for data processing, model development, testing, and integration ensuring clear communication across teams and stakeholders."
  ],
  "skills": [
    "Proficient in multiple programming languages (preferably Typescript/Javascript, Python), web components and ML frameworks.",
    "Knowledge and experience with the entire ML training pipeline (data collection, training and evaluation).",
    "Good verbal and written communication skills.",
    "Self-motivated, self-starter, quick learner, independent."
  ],
  "analysis": "The Job Responsibilities and Skills focus on implementing machine learning (ML) solutions, collaborating with cross-functional teams, and staying updated with the latest ML and AI technologies. The job also emphasizes working with large datasets, evaluating model performance, and contributing to new ML features.\n\n1. **AI Research Scientist**: This option focuses on investigating AI methodologies and conducting experiments, which aligns with the job's emphasis on staying updated with AI technologies and evaluating model performance. However, the job's focus on implementation and collaboration across teams is more aligned with engineering roles.\n\n2. **AI/ML Engineer**: This option involves transforming research into scalable AI solutions, productionizing models, and collaborating with research scientists. The job's focus on implementing ML solutions, collaborating with engineers and product managers, and working with large datasets aligns well with this role.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment, scaling, and monitoring of AI systems, which is not the primary focus of the job described.\n\n4. **AI Solution Architect**: This option involves designing AI solutions and collaborating with SMEs, which is more strategic and high-level compared to the job's focus on implementation and collaboration with engineers and product managers.\n\n5. **Data Scientist**: This option focuses on data analysis and developing predictive models, which is not the primary focus of the job described.\n\n6. **Data Engineer**: This option involves designing data pipelines and architectures, which is not the primary focus of the job described.\n\n7. **Product Manager**: This option involves driving product vision and strategy, which is not the primary focus of the job described.\n\n8. **Software Engineer**: This option involves developing software applications, which is not the primary focus of the job described.\n\nThe job's focus on implementing ML solutions, collaborating with engineers and product managers, and working with large datasets aligns most closely with the responsibilities and skills of an AI/ML Engineer (Option 2).",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}