{
  "filename": "j4bbbe",
  "responsibilities": [
    "Process and structure large amounts of graph data to power applications across Atlassian.",
    "Build great APIs.",
    "Use generative AI and ML creatively to process, structure, and reason over large amounts of data to power intelligent products.",
    "Mentor and coach team members on best practices, code quality, design patterns, testing, debugging, and documentation.",
    "Communicate effectively with internal and external partners, present technical concepts and results clearly and concisely, and solicit feedback and input from various stakeholders."
  ],
  "skills": [
    "Experience in building and scaling business applications and systems using large amounts of data.",
    "Ability to build generalizable platforms with a focus on empowering applications in product.",
    "Agile development mindset, appreciating the benefit of iteration and improvement.",
    "Experience working with LLMs and RAG (a bonus)."
  ],
  "analysis": "The job responsibilities and skills focus on processing and structuring large amounts of graph data, building APIs, using generative AI and ML, mentoring team members, and effective communication. The skills required include experience in building and scaling business applications with large data, building generalizable platforms, an agile development mindset, and experience with LLMs and RAG.\n\n1. **AI Research Scientist**: This option focuses on AI methodologies, conducting experiments, and developing datasets. While it involves generative AI, it is more research-oriented and does not align with the job's focus on building APIs and mentoring.\n\n2. **AI/ML Engineer**: This role involves transforming research into scalable AI solutions, productionizing models, and developing data pipelines. It aligns with building scalable applications and APIs, but the job's focus on mentoring and communication is not emphasized here.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is about deploying and monitoring AI systems, which does not align with the job's focus on building APIs and using generative AI creatively.\n\n4. **AI Solution Architect**: This role involves designing AI solutions, collaborating with SMEs, and providing thought leadership. It aligns with using generative AI and communication skills but does not focus on building APIs or mentoring.\n\n5. **Data Scientist**: This role focuses on statistical analysis, model development, and data visualization. It does not align with the job's focus on building APIs and using generative AI.\n\n6. **Data Engineer**: This role involves designing data pipelines and architectures, which does not align with the job's focus on building APIs and using generative AI.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which does not align with the technical focus of the job on building APIs and using generative AI.\n\n8. **Software Engineer**: This role involves designing and maintaining software applications, writing code, and participating in system architecture. It aligns with building APIs and mentoring team members, and the agile development mindset is a match. The focus on communication and collaboration also aligns with the job's responsibilities.\n\nThe job is most similar to the Software Engineer option, as it involves building APIs, mentoring, and having an agile mindset, which are key aspects of the job description.",
  "role_classification": 8,
  "role_title": "Software Engineer"
}