{
  "filename": "j4cbfd",
  "responsibilities": [
    "Participate in requirements analysis to provide the right technical and business solutions for customers",
    "Propose innovative solutions based on AI landscape trends",
    "Design, architect, and deliver AI key modules end-to-end",
    "Write clean, scalable code and test and deploy applications and systems",
    "Revise, update, refactor, and debug code",
    "Deliver high-quality, secure voice solutions to Aircall clients",
    "Optimize product and platform performance and monitor live sites",
    "Participate in an on-call rotation to respond to critical system issues and ensure continuous system reliability",
    "Mentor team members"
  ],
  "skills": [
    "Ability to design, develop, deploy, and operate business-critical AI features",
    "Experience with implementing AI features",
    "Knowledge of AI frameworks (Langchain, LlamaIndex, Auto Gen, etc.)",
    "Understanding of AI architectures (RAG, reranking, etc.)",
    "Proficiency in back-end development with Python, Typescript/Node.js, or Java",
    "Focus on delivering for security, scalability, availability, and performance",
    "Experience with AWS in a production environment (nice to have)"
  ],
  "analysis": "The job responsibilities and skills focus on designing, developing, and deploying AI solutions, with a strong emphasis on AI frameworks, architectures, and back-end development. The responsibilities include participating in requirements analysis, proposing innovative AI solutions, designing and delivering AI modules, writing and debugging code, optimizing performance, and mentoring team members. The skills required include proficiency in AI feature development, knowledge of AI frameworks and architectures, back-end development skills, and experience with AWS.\n\n1. **AI Research Scientist**: This option focuses on investigating AI methodologies and conducting experiments, which is not the primary focus of the job. The job is more about implementing and deploying AI solutions rather than research.\n\n2. **AI/ML Engineer**: This option involves transforming research into scalable AI solutions, productionizing AI models, and developing data pipelines. The job aligns well with this option as it involves designing, developing, and deploying AI solutions, and requires proficiency in back-end development and AI frameworks.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment, scaling, and monitoring of AI systems, which is not the primary focus of the job. The job is more about developing AI features and solutions rather than infrastructure management.\n\n4. **AI Solution Architect**: This option involves designing AI solutions and collaborating with SMEs, which is somewhat related to the job's focus on proposing innovative AI solutions. However, the job is more hands-on with development and deployment rather than high-level architecture.\n\n5. **Data Scientist**: This option focuses on statistical analysis and model development, which is not the primary focus of the job. The job is more about developing and deploying AI solutions rather than data analysis.\n\n6. **Data Engineer**: This option involves building data pipelines and architectures, which is not the primary focus of the job. The job is more about AI feature development and deployment.\n\n7. **Product Manager**: This option focuses on product vision and strategy, which is not the primary focus of the job. The job is more technical and development-oriented.\n\n8. **Software Engineer**: This option involves developing software applications and services, which aligns with the job's focus on writing and deploying code. However, the job has a specific focus on AI solutions, which is more aligned with the AI/ML Engineer role.\n\nThe job is most similar to the AI/ML Engineer option, as it involves developing and deploying AI solutions, requires proficiency in back-end development, and focuses on AI frameworks and architectures.",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}