{
  "filename": "j6d6df",
  "responsibilities": [
    "Design, iterate, and build ML models to detect unwanted or anomalous behaviors from both users and LLM models",
    "Work with T&S ML engineers to review and iterate experiment ideations",
    "Co-author the experiment success criteria and production deployment roadmaps",
    "Partner with T&S Policy and Enforcement cross-functional teams to understand emerging and sustained abuse patterns from user prompts and behaviors",
    "Incorporate insights into T&S research datasets",
    "Surface abuse patterns to sibling research teams in the company",
    "Collaborate to harden Anthropic’s LLMs at the pre/post training stages",
    "Stay current with state-of-the-art research in AI and machine learning",
    "Propose ways to apply advancements to T&S systems"
  ],
  "skills": [
    "Significant Python programming experience",
    "Machine learning experience",
    "Proficiency in building trustworthy and safe AI technology",
    "Strong communication skills",
    "Ability to explain complex technical concepts to non-technical stakeholders"
  ],
  "analysis": "The job responsibilities and skills focus on designing and building machine learning models to detect unwanted behaviors, collaborating with cross-functional teams, staying current with AI research, and applying advancements to systems. The skills required include significant Python programming experience, machine learning experience, proficiency in building trustworthy AI, and strong communication skills.\n\n1. **AI Research Scientist**: This option involves investigating AI methodologies, conducting experiments, and staying current with AI research, which aligns with the job's focus on designing ML models and staying updated with AI advancements. However, the responsibilities are more research-oriented rather than focused on detecting unwanted behaviors.\n\n2. **AI/ML Engineer**: This role focuses on transforming research into scalable solutions, productionizing AI models, and developing data pipelines. While there is some overlap in skills, the job's focus on detecting unwanted behaviors and collaborating with policy teams is not a primary focus here.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is centered around deployment, scaling, and monitoring AI systems, which does not align with the job's focus on designing ML models and detecting behaviors.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with teams, which partially aligns with the job's responsibilities. However, the focus on detecting unwanted behaviors and building ML models is not a primary aspect of this role.\n\n5. **Data Scientist**: This role involves statistical analysis, model development, and data visualization, which partially aligns with the job's focus on ML models. However, the specific focus on detecting unwanted behaviors and collaborating with policy teams is not emphasized.\n\n6. **Data Engineer**: This role focuses on data pipelines and architectures, which does not align with the job's focus on designing ML models and detecting behaviors.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which does not align with the job's technical focus on ML models and detecting behaviors.\n\n8. **Software Engineer**: This role involves software development and maintenance, which does not align with the job's focus on ML models and detecting behaviors.\n\nThe job aligns most closely with the **AI Research Scientist** option, as both involve designing and iterating on ML models, staying current with AI research, and collaborating with cross-functional teams. The focus on detecting unwanted behaviors and building trustworthy AI technology is a unique aspect of the job that is not fully captured by any option, but the AI Research Scientist role is the closest match.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}