{
  "filename": "j6ef41",
  "responsibilities": [
    "Develop innovative and practical Generative AI applications for Tempus product line using large multi-modal datasets.",
    "Collaborate cross-functionally with other teams to align Foundation Model/LLMs with strategic company objectives.",
    "Explore and evaluate new technologies and methodologies to enhance technical capabilities and remain at the cutting edge of ML innovation.",
    "Conduct research and exploration of generative AI techniques with a focus on healthcare applications.",
    "Contribute to thought leadership and develop up-to-date knowledge of Generative AI trends.",
    "Establish and drive research opportunities and collaboration with partner organizations.",
    "Design and implement generative AI models tailored for healthcare scenarios.",
    "Develop evaluation metrics that align with healthcare outcomes and optimize models to achieve performance criteria.",
    "Stay actively involved in healthcare and AI research communities by attending conferences, workshops, and seminars.",
    "Publish research findings in reputable scientific venues.",
    "Collaborate with academic and industry partners to advance generative AI for healthcare."
  ],
  "skills": [
    "Strong collaboration and communication abilities.",
    "Solid knowledge of machine learning concepts, including deep learning, optimization algorithms, regularization techniques, and transformer architecture.",
    "Extensive experience in developing and implementing generative AI models, such as GANs, VAEs, and related architectures.",
    "Experience in applying Large Language Models to practical industry challenges.",
    "Proficiency in programming languages commonly used in AI research, such as Python and TensorFlow/PyTorch.",
    "Experience with healthcare-specific frameworks (e.g., DICOM, FHIR) is a plus.",
    "Expertise with embeddings and multimodal fusion."
  ],
  "analysis": "The job focuses on developing generative AI applications for healthcare, collaborating cross-functionally, conducting research, and staying updated with AI trends. It requires strong machine learning knowledge, experience with generative AI models, and proficiency in programming languages like Python and TensorFlow/PyTorch. The job also values experience with healthcare-specific frameworks and expertise in embeddings and multimodal fusion.\n\n1. **AI Research Scientist**: This option aligns well with the job's focus on generative AI, research, and staying current with AI trends. The responsibilities and skills required for this option, such as conducting experiments, collaborating with engineers, and having a deep understanding of LLMs, match the job's requirements.\n\n2. **AI/ML Engineer**: This option focuses on transforming research into scalable solutions, which is not the primary focus of the job. The job is more research-oriented rather than production-focused.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is about deploying and monitoring AI systems, which does not align with the research and development focus of the job.\n\n4. **AI Solution Architect**: This option involves designing AI solutions and collaborating with SMEs, which is somewhat related but not as closely aligned with the research and development focus of the job.\n\n5. **Data Scientist**: This option focuses on data analysis and model development, which is not the primary focus of the job that emphasizes generative AI and healthcare applications.\n\n6. **Data Engineer**: This option is about data pipelines and architecture, which is not relevant to the job's focus on generative AI research and development.\n\n7. **Product Manager**: This option is about driving product vision and strategy, which does not align with the research and technical focus of the job.\n\n8. **Software Engineer**: This option focuses on software development, which is not the primary focus of the job that emphasizes AI research and healthcare applications.\n\nThe job is most similar to the \"AI Research Scientist\" option due to its emphasis on generative AI research, collaboration, and staying updated with AI trends.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}