{
  "filename": "j75d82",
  "responsibilities": [
    "Develop innovative machine learning technology and products that serve millions of Snapchatters",
    "Work on state of the art GenAI pipelines for image and video generation",
    "Deliver generative machine learning experiences on device",
    "Build cutting-edge augmented reality experiences using generative and diffusion models",
    "Partner with cross-functional Snap teams to explore and prototype new products"
  ],
  "skills": [
    "Proven passion for machine learning; staying up-to-date with research and excited about prototyping new ideas quickly",
    "Knowledge of mathematics and deep learning foundations",
    "Desire to solve open ambiguous problems",
    "Desire to grow professionally, learn and help others",
    "Ability to effectively collaborate with internal teams and external partners",
    "Ability to work independently"
  ],
  "analysis": "The job responsibilities and skills focus heavily on machine learning, generative AI, and augmented reality experiences. The responsibilities include developing machine learning technology, working on GenAI pipelines, delivering experiences on devices, and building augmented reality experiences. The skills emphasize a passion for machine learning, knowledge of deep learning foundations, problem-solving, collaboration, and independence.\n\n1. **AI Research Scientist**: This option involves investigating AI methodologies, conducting experiments, and staying current with AI research. The job's focus on developing innovative machine learning technology and staying up-to-date with research aligns well with this option. However, the responsibilities do not mention conducting experiments or developing datasets, which are key responsibilities for this role.\n\n2. **AI/ML Engineer**: This role focuses on transforming research into scalable AI solutions, productionizing models, and developing data pipelines. The job's emphasis on developing machine learning technology and delivering experiences aligns with this role, but the job does not mention productionizing models or developing data pipelines.\n\n3. **MLOps / AI Infrastructure Engineer**: This role is about deploying and monitoring AI systems, which does not align with the job's focus on developing machine learning technology and experiences.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with teams, which aligns with the job's responsibilities of partnering with cross-functional teams. However, the job does not focus on designing solutions or providing thought leadership, which are key aspects of this role.\n\n5. **Data Scientist**: This role involves data analysis, model development, and presenting findings, which does not align with the job's focus on developing machine learning technology and experiences.\n\n6. **Data Engineer**: This role focuses on data pipelines and architectures, which does not align with the job's focus on machine learning and augmented reality experiences.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which does not align with the job's focus on developing machine learning technology and experiences.\n\n8. **Software Engineer**: This role involves software development and maintenance, which does not align with the job's focus on machine learning and augmented reality experiences.\n\nThe job aligns most closely with the **AI Research Scientist** role due to its focus on developing innovative machine learning technology, staying up-to-date with research, and prototyping new ideas. The responsibilities and skills match the primary focus and key responsibilities of the AI Research Scientist option.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}