{
  "filename": "j76df3",
  "responsibilities": [
    "Build new features within the Remitly app to help customers resolve common issues.",
    "Contribute to Remitly's virtual assistant and help center within the app.",
    "Build backend services in Go on AWS.",
    "Develop ML-driven components into customer-facing experiences.",
    "Deliver end-to-end complex projects and product features with high autonomy and quality.",
    "Partner with product managers and engineers across teams to help achieve product and business goals."
  ],
  "skills": [
    "Proficiency in Go or Python for application development.",
    "Experience with natural language search and search optimization.",
    "Ability to build models to process unstructured and semi-structured text data using natural language processing techniques.",
    "Knowledge of software development principles, including version control, testing, and debugging.",
    "Experience integrating ML-driven components into customer-facing products."
  ],
  "analysis": "The job responsibilities and skills focus on building features within an app, developing backend services, integrating ML-driven components, and collaborating with product managers and engineers. The skills required include proficiency in Go or Python, experience with natural language processing, and integrating ML components into products.\n\n1. **AI Research Scientist**: This option focuses on AI methodologies, experiments, and datasets, which doesn't align with the job's focus on app development and backend services.\n\n2. **AI/ML Engineer**: This option involves transforming research into scalable AI solutions, productionizing AI models, and developing data pipelines. The job's focus on integrating ML-driven components and proficiency in Go or Python aligns well with this option.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is about deploying and monitoring AI systems, which doesn't match the job's focus on app features and backend services.\n\n4. **AI Solution Architect**: This option involves designing AI solutions and collaborating on generative AI use cases, which is not directly related to the job's responsibilities.\n\n5. **Data Scientist**: This option focuses on data analysis and model development, which doesn't align with the job's focus on app development and backend services.\n\n6. **Data Engineer**: This option involves data pipelines and architectures, which is not the primary focus of the job.\n\n7. **Product Manager**: This option is about driving product vision and strategy, which doesn't match the technical development focus of the job.\n\n8. **Software Engineer**: This option involves designing and maintaining software applications, which aligns with the job's focus on building app features and backend services. The skills in Go or Python and software development principles also match well.\n\nThe job is a good fit for both the AI/ML Engineer and Software Engineer options, but the focus on building app features and backend services, along with the required skills, makes it most similar to the Software Engineer role.",
  "role_classification": 8,
  "role_title": "Software Engineer"
}