{
  "filename": "jd78a3",
  "responsibilities": [
    "Develop and lead projects, team ideas, and mentor junior engineers.",
    "Conduct advanced research and engineering on AI-based rendering techniques.",
    "Transfer advanced research AI/CG solutions to solve real-world problems for integration into Huawei products.",
    "Provide expert opinions on relevant fields by summarizing research findings in high-quality papers or patents."
  ],
  "skills": [
    "Extensive background in machine learning and deep learning, including DNN, GAN, ViT, and Diffusion techniques.",
    "Experience in neural representation/rendering such as NerF, Gaussian Splatting, neural rendering, procedural generation, SVBRDF, etc.",
    "Proficiency in Python, PyTorch, TensorFlow, etc.",
    "Strong programming skills in shading languages, e.g., glsl, hlsl, etc.",
    "Experience in building large-scale machine learning solutions for computer vision/graphics topics, including model design, data collection/augmentation evaluation, etc."
  ],
  "analysis": "The job responsibilities and skills focus on advanced AI research, particularly in rendering techniques and machine learning. The responsibilities include leading projects, conducting research, and transferring solutions to real-world problems, which aligns with roles that involve research and development in AI. The skills required include a strong background in machine learning, neural rendering, and proficiency in programming languages like Python and PyTorch.\n\n1. **AI Research Scientist**: This option involves investigating AI methodologies and conducting experiments, which aligns with the job's focus on research and development. However, the specific focus on generative models and prompt engineering in the option does not fully match the job's emphasis on rendering techniques and neural representation.\n\n2. **AI/ML Engineer**: This role focuses on transforming research into scalable solutions, which partially aligns with the job's responsibility of transferring research solutions to real-world problems. However, the primary focus on productionizing models and developing data pipelines is not a direct match for the job's research-oriented responsibilities.\n\n3. **MLOps / AI Infrastructure Engineer**: This option is centered around deployment and infrastructure, which does not align with the job's research and development focus.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with SMEs, which does not align with the job's focus on conducting research and developing rendering techniques.\n\n5. **Data Scientist**: This role focuses on data analysis and model development, which does not align with the job's emphasis on AI research and rendering techniques.\n\n6. **Data Engineer**: This role is about building data pipelines and architectures, which does not match the job's focus on AI research and rendering techniques.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which does not align with the job's research and development focus.\n\n8. **Software Engineer**: This role focuses on software development and maintenance, which does not align with the job's emphasis on AI research and rendering techniques.\n\nThe job is most similar to the \"AI Research Scientist\" option, as both involve conducting advanced research and developing AI methodologies. However, the specific focus on rendering techniques in the job is not fully captured by the option's emphasis on generative models and prompt engineering. Despite this, the research-oriented nature of both roles makes the \"AI Research Scientist\" the closest match.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}