{
  "filename": "je4e3f",
  "responsibilities": [
    "Collaborate with customer stakeholders and internal teams to design end-to-end technical architectures for seamless integration of Parloa into complex enterprise environments.",
    "Serve as the bridge and voice between customer requirements and internal engineering, translating business needs into actionable technical specifications and scalable solutions.",
    "Lead strategic customer projects to build bespoke features and extensions, iterating quickly to address evolving customer needs.",
    "Advise customers and non-technical colleagues on technical topics, including conversational AI, backend integrations, telephony systems, and voice bot logic design.",
    "Collaborate on data analytics projects, enabling clear and actionable reporting on customers’ voice bots using Python, SQL, and KQL.",
    "Build serverless web services using TypeScript to extend the product and provide custom functionality for strategic accounts.",
    "Continuously evaluate customer feedback and product performance to propose improvements and collaborate with the product team to shape Parloa’s roadmap."
  ],
  "skills": [
    "Strong understanding of TypeScript and Python.",
    "Familiarity with distributed systems, APIs, and microservice architectures.",
    "Knowledge of telephony communication.",
    "Excellent communication and presentation skills in English.",
    "Strong interest in generative and conversational AI.",
    "Ability to work autonomously and take ownership of tasks from inception to completion."
  ],
  "analysis": "The job involves designing technical architectures, translating customer requirements into technical specifications, leading customer projects, advising on technical topics, collaborating on data analytics projects, building serverless web services, and proposing product improvements. The skills required include TypeScript, Python, distributed systems, APIs, telephony communication, communication skills, and an interest in AI.\n\n1. AI Research Scientist: This role focuses on AI methodologies, experiments, and model evaluation, which doesn't align with the job's focus on customer integration and technical architecture.\n2. AI/ML Engineer: This role involves productionizing AI models and developing data pipelines, which is not a direct match for the job's focus on customer projects and technical architecture.\n3. MLOps / AI Infrastructure Engineer: This role focuses on deployment, scaling, and monitoring AI systems, which doesn't align with the job's responsibilities in customer integration and architecture design.\n4. AI Solution Architect: This role involves designing AI solutions, collaborating with SMEs, and developing technical proposals, which aligns well with the job's focus on designing architectures, translating requirements, and advising on technical topics.\n5. Data Scientist: This role focuses on data analysis and model development, which doesn't match the job's focus on technical architecture and customer integration.\n6. Data Engineer: This role involves building data pipelines and architectures, which is not a direct match for the job's focus on customer projects and technical architecture.\n7. Product Manager: This role involves driving product vision and strategy, which doesn't align with the job's technical and customer-focused responsibilities.\n8. Software Engineer: This role involves developing software applications, which partially aligns with the job's focus on building web services but doesn't cover the broader responsibilities of customer integration and architecture design.\n\nThe AI Solution Architect (Option 4) is the most similar to the job, as it involves designing AI solutions, collaborating with stakeholders, and translating complex requirements into actionable plans, which aligns with the job's responsibilities and skills.",
  "role_classification": 4,
  "role_title": "AI Solution Architect"
}