{
  "filename": "je6eb1",
  "responsibilities": [
    "Research and develop cutting-edge AR Effect Generation AI systems for interactive experience generation.",
    "Design and implement new features for TikTok's AI Effect Generation product to enhance user creation experience.",
    "Design and implement data collection, training, and evaluation pipelines to build and assess AI Effect Generation system performance.",
    "Investigate ways to improve system intelligence at various stages.",
    "Use inference stage techniques such as RAG, CoT, and Prompt Engineering to improve TikTok's AI Effect Generation model output."
  ],
  "skills": [
    "Expertise in Generative AI and Graphics technologies.",
    "Proficiency in designing and implementing AI systems and features.",
    "Experience with data collection, training, and evaluation pipelines.",
    "Knowledge of inference stage techniques like RAG, CoT, and Prompt Engineering.",
    "Ability to innovate and improve AI system performance and intelligence."
  ],
  "analysis": "The job responsibilities and skills focus on developing AI systems for AR Effect Generation, designing features, and improving system intelligence using techniques like RAG, CoT, and Prompt Engineering. The skills required include expertise in Generative AI, proficiency in AI system design, and knowledge of inference stage techniques.\n\n1. **AI Research Scientist**: This option involves investigating AI methodologies, conducting experiments, and staying current with AI research. The job's focus on developing cutting-edge AI systems and improving system intelligence aligns well with this role, especially with the emphasis on generative models and prompt engineering.\n\n2. **AI/ML Engineer**: This role focuses on transforming research into scalable solutions and maintaining data pipelines. While there is some overlap in terms of developing AI systems, the job's emphasis on research and development of new AI features aligns more closely with the AI Research Scientist role.\n\n3. **MLOps / AI Infrastructure Engineer**: This role is about deploying and monitoring AI systems, which is not the primary focus of the job described.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with SMEs, which is not the primary focus of the job described.\n\n5. **Data Scientist**: This role focuses on data analysis and model development, which is not the primary focus of the job described.\n\n6. **Data Engineer**: This role involves building data pipelines and architectures, which is not the primary focus of the job described.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which is not the primary focus of the job described.\n\n8. **Software Engineer**: This role involves software development and maintenance, which is not the primary focus of the job described.\n\nThe job's responsibilities and skills align most closely with the AI Research Scientist role, as both involve developing and improving AI systems, with a focus on generative AI and prompt engineering.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}