{
  "filename": "je817a",
  "responsibilities": [
    "Work cross-functionally and cross-product area with a large working group to rapidly prototype, build, experiment, and launch new conversational AI learning features on Search.",
    "Collaborate with engineers to understand quality issues and design solutions, analyze evaluations, and drive execution towards launches.",
    "Help the team achieve the best outcomes quickly by writing code, running/analyzing evaluations, and contributing to requests for comments.",
    "Identify opportunities and lead collaborations across LearnX and Search to develop shared capabilities that extend beyond the education vertical."
  ],
  "skills": [
    "Ability to rapidly prototype and build AI-powered features.",
    "Strong collaboration skills to work with engineers and cross-functional teams.",
    "Problem-solving skills to address quality issues and design solutions.",
    "Ability to analyze evaluations and drive execution towards product launches.",
    "Leadership skills to identify opportunities and lead collaborations."
  ],
  "analysis": "The job involves working on conversational AI learning features, collaborating with engineers, analyzing evaluations, and leading collaborations. The skills required include rapid prototyping, collaboration, problem-solving, analysis, and leadership.\n\n1. **AI Research Scientist**: This role focuses on AI methodologies, experiments, and collaboration with engineers, which aligns with the job's focus on AI features and collaboration. However, the job's emphasis on rapid prototyping and launching features is not a primary focus here.\n\n2. **AI/ML Engineer**: This role involves transforming research into scalable solutions and collaborating with research scientists, which aligns with the job's focus on building and launching AI features. The skills in collaboration and execution towards product launches are relevant.\n\n3. **MLOps / AI Infrastructure Engineer**: This role focuses on deployment, scaling, and monitoring AI systems, which is not directly aligned with the job's focus on prototyping and launching new features.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating across teams, which aligns with the job's focus on collaboration and leading collaborations. However, the job's emphasis on rapid prototyping and building features is not a primary focus here.\n\n5. **Data Scientist**: This role focuses on data analysis and model development, which is not directly aligned with the job's focus on building and launching AI features.\n\n6. **Data Engineer**: This role focuses on data pipelines and architecture, which is not directly aligned with the job's focus on building and launching AI features.\n\n7. **Product Manager**: This role involves driving product vision and collaborating with cross-functional teams, which aligns with the job's focus on collaboration and leading collaborations. However, the job's emphasis on rapid prototyping and building features is not a primary focus here.\n\n8. **Software Engineer**: This role involves developing software applications and collaborating with cross-functional teams, which aligns with the job's focus on building and launching features. The skills in writing code and collaboration are relevant.\n\nThe job is most similar to the **AI/ML Engineer** role, as it involves building AI-powered features, collaborating with engineers, and driving execution towards product launches.",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}