{
  "filename": "jef107",
  "responsibilities": [
    "Research and develop novel computer vision models in Generative AI, focusing on 3D objects, textures, and scene generation.",
    "Publish research results in top-tier journals and at leading international conferences.",
    "Collaborate with team members throughout the lifetime of a project, from early research through prototyping.",
    "Work with product partners to deploy research into Meta's products."
  ],
  "skills": [
    "Mastery of modern features in C++ or Python.",
    "Experience with ML frameworks such as PyTorch.",
    "Experience designing machine learning algorithms, including creating software for data loading, training, and inference of novel ML architectures.",
    "Interpersonal experience: cross-group and cross-functional collaboration.",
    "Mathematical background and understanding of numerical optimization, linear algebra, probabilistic estimation, and 3D geometry."
  ],
  "analysis": "The job involves research and development of novel computer vision models in Generative AI, focusing on 3D objects, textures, and scene generation. It also includes publishing research results, collaborating with team members, and deploying research into products. The skills required include mastery of C++ or Python, experience with ML frameworks like PyTorch, designing machine learning algorithms, and a strong mathematical background.\n\n1. **AI Research Scientist**: This option focuses on investigating and adapting AI methodologies, conducting experiments, and staying current with AI research. The responsibilities and skills align well with the job's focus on research, development, and collaboration in AI, particularly in generative models. The mathematical background and experience with ML frameworks are also relevant.\n\n2. **AI/ML Engineer**: This role is more about transforming research into scalable solutions and maintaining data pipelines, which is less aligned with the research and development focus of the job.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment, scaling, and monitoring of AI systems, which does not align with the research and development focus of the job.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with experts, which is not directly aligned with the research and development focus of the job.\n\n5. **Data Scientist**: This role focuses on data analysis and model development, which is not directly aligned with the research and development focus of the job.\n\n6. **Data Engineer**: This role is about designing data pipelines and architectures, which is not aligned with the research and development focus of the job.\n\n7. **Product Manager**: This role involves driving product vision and strategy, which is not aligned with the research and development focus of the job.\n\n8. **Software Engineer**: This role involves software development and maintenance, which is not aligned with the research and development focus of the job.\n\nThe job is most similar to the \"AI Research Scientist\" option, as both involve research and development in AI, particularly in generative models, and require similar skills and collaboration.",
  "role_classification": 1,
  "role_title": "AI Research Scientist"
}