{
  "filename": "jf816b",
  "responsibilities": [
    "Partner with a cross-functional team of engineers, research scientists, technical program managers, and product managers to deliver AI-powered products.",
    "Design, develop, test, deploy, and support AI software components including foundation model training, large language model inference, similarity search, guardrails, model evaluation, experimentation, governance, and observability.",
    "Leverage a broad stack of Open Source and SaaS AI technologies such as AWS Ultraclusters, Huggingface, VectorDBs, Nemo Guardrails, PyTorch, and more.",
    "Invent and introduce state-of-the-art LLM optimization techniques to improve the performance of large scale production AI systems.",
    "Contribute to the technical vision and the long term roadmap of foundational AI systems at Capital One."
  ],
  "skills": [
    "Ability to build systems and take pride in the quality of work.",
    "Passion for staying abreast of the latest research and ability to understand scientific publications.",
    "Ability to adapt quickly and bring clarity to big, undefined problems.",
    "Strong foundation in engineering and mathematics.",
    "Expertise in hardware, software, and AI to see and exploit optimization opportunities.",
    "Resilience and ability to forge new paths to achieve business goals."
  ],
  "analysis": "The job responsibilities and skills focus on AI software development, optimization, and collaboration with cross-functional teams. The responsibilities include delivering AI-powered products, developing AI software components, leveraging AI technologies, and contributing to AI systems' technical vision. The skills emphasize system building, staying updated with research, problem-solving, engineering, mathematics, and optimization.\n\n1. **AI Research Scientist**: This option focuses on investigating AI methodologies, conducting experiments, and staying current with AI research. While there is some overlap in staying updated with research, the job's focus on software development and optimization is not aligned with this role's primary focus on research and experimentation.\n\n2. **AI/ML Engineer**: This role involves transforming research into scalable AI solutions, productionizing AI models, and collaborating with research scientists. The job's focus on developing AI software components, leveraging AI technologies, and optimization aligns well with this role's responsibilities and skills.\n\n3. **MLOps / AI Infrastructure Engineer**: This option focuses on deployment, scaling, and monitoring AI systems. While there is some overlap in ensuring reliable AI systems, the job's emphasis on software development and optimization is not the primary focus of this role.\n\n4. **AI Solution Architect**: This role involves designing AI solutions and collaborating with SMEs. The job's focus on software development and optimization does not align with this role's emphasis on solution design and architecture.\n\n5. **Data Scientist**: This option focuses on statistical analysis, machine learning, and data visualization. The job's focus on AI software development and optimization does not align with this role's emphasis on data analysis and modeling.\n\n6. **Data Engineer**: This role involves designing data pipelines and architectures. The job's focus on AI software development and optimization does not align with this role's emphasis on data engineering.\n\n7. **Product Manager**: This option focuses on driving product vision and strategy. The job's focus on AI software development and optimization does not align with this role's emphasis on product management.\n\n8. **Software Engineer**: This role involves developing software applications and services. While there is some overlap in software development, the job's specific focus on AI technologies and optimization is more aligned with the AI/ML Engineer role.\n\nThe job is most similar to the AI/ML Engineer role, as both involve developing AI software components, leveraging AI technologies, and focusing on optimization and collaboration with cross-functional teams.",
  "role_classification": 2,
  "role_title": "AI/ML Engineer"
}